; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._qstr_pool_t = type { %struct._qstr_pool_t*, i64, i64, i64, [0 x i8*] }
%struct.anon = type { i8*, i64* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._mp_obj_str_t = type { %struct._mp_obj_base_t, i64, i64, i8* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 47, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime0.h", directory: "")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !{!0, !71, !109, !116, !123, !128, !138, !288, !290}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "raw_code_frozentest__lt_module_gt_", scope: !2, file: !73, line: 106, type: !74, isLocal: false, isDefinition: true)
!73 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !76, line: 62, baseType: !77)
!76 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/emitglue.h", directory: "")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !76, line: 42, size: 256, elements: !78)
!78 = !{!79, !85, !86, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !77, file: !76, line: 43, baseType: !80, size: 3, flags: DIFlagBitField, extraData: i64 0)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !81, line: 70, baseType: !82)
!81 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !83, line: 30, baseType: !84)
!83 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !77, file: !76, line: 44, baseType: !80, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !77, file: !76, line: 45, baseType: !80, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !76, line: 61, baseType: !88, size: 192, offset: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !77, file: !76, line: 46, size: 192, elements: !89)
!89 = !{!90, !102}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !88, file: !76, line: 55, baseType: !91, size: 128)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !76, line: 47, size: 128, elements: !92)
!92 = !{!93, !99}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !91, file: !76, line: 48, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !97, line: 39, baseType: !98)
!97 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !91, file: !76, line: 49, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !88, file: !76, line: 60, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !88, file: !76, line: 56, size: 192, elements: !104)
!104 = !{!105, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !103, file: !76, line: 57, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !103, file: !76, line: 58, baseType: !100, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !103, file: !76, line: 59, baseType: !80, size: 64, offset: 128)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "mp_frozen_mpy_names", scope: !2, file: !73, line: 121, type: !111, isLocal: false, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, elements: !114)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!114 = !{!115}
!115 = !DISubrange(count: 16)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "mp_frozen_mpy_content", scope: !2, file: !73, line: 124, type: !118, isLocal: false, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !121)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "bytecode_data_frozentest__lt_module_gt_", scope: !2, file: !73, line: 51, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 736, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 92)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "const_table_data_frozentest__lt_module_gt_", scope: !2, file: !73, line: 101, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, elements: !136)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!136 = !{!137}
!137 = !DISubrange(count: 3)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__0", scope: !2, file: !73, line: 98, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !142, line: 37, baseType: !143)
!142 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objstr.h", directory: "")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !142, line: 31, size: 256, elements: !144)
!144 = !{!145, !285, !286, !287}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !143, file: !142, line: 32, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !6, line: 57, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !154)
!154 = !{!155, !156, !160, !161, !185, !209, !214, !220, !226, !234, !239, !251, !256, !277, !278, !279}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !6, line: 476, baseType: !146, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !6, line: 479, baseType: !157, size: 16, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !158, line: 31, baseType: !159)
!158 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!159 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !6, line: 482, baseType: !157, size: 16, offset: 80)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !153, file: !6, line: 485, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !166, !183, !184}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !169, line: 53, baseType: !170)
!169 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !169, line: 50, size: 128, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !169, line: 51, baseType: !106, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !170, file: !169, line: 52, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !169, line: 48, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !106, !178, !179}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !180, line: 31, baseType: !181)
!180 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !182, line: 92, baseType: !84)
!182 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !106)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !153, file: !6, line: 488, baseType: !186, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!183, !150, !179, !190, !192}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !194, file: !6, line: 366, baseType: !179, size: 1, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !194, file: !6, line: 367, baseType: !179, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !194, file: !6, line: 368, baseType: !179, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !194, file: !6, line: 369, baseType: !179, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !194, file: !6, line: 371, baseType: !179, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !194, file: !6, line: 372, baseType: !179, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !194, file: !6, line: 373, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !205, file: !6, line: 351, baseType: !183, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !205, file: !6, line: 352, baseType: !183, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !153, file: !6, line: 491, baseType: !210, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!183, !183, !179, !179, !190}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !153, file: !6, line: 495, baseType: !215, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!183, !219, !183}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !153, file: !6, line: 496, baseType: !221, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!183, !225, !183, !183}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !153, file: !6, line: 509, baseType: !227, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !183, !231, !233}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !232, line: 48, baseType: !179)
!232 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !153, file: !6, line: 516, baseType: !235, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!183, !183, !183, !183}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !153, file: !6, line: 521, baseType: !240, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!183, !183, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !246, file: !6, line: 433, baseType: !146, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !6, line: 434, baseType: !250, size: 192, offset: 64)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 192, elements: !136)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !153, file: !6, line: 525, baseType: !252, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!183, !183}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !153, file: !6, line: 528, baseType: !257, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !259)
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !258, file: !6, line: 469, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !183, !269, !80}
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !81, line: 69, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !266, line: 32, baseType: !267)
!266 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !182, line: 49, baseType: !268)
!268 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !271, file: !6, line: 457, baseType: !106, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !271, file: !6, line: 458, baseType: !179, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !271, file: !6, line: 459, baseType: !276, size: 32, offset: 128)
!276 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !153, file: !6, line: 531, baseType: !134, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !153, file: !6, line: 537, baseType: !134, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !153, file: !6, line: 540, baseType: !280, size: 64, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !281, file: !6, line: 776, baseType: !146, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !281, file: !6, line: 777, baseType: !193, size: 192, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !143, file: !142, line: 33, baseType: !80, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !143, file: !142, line: 35, baseType: !179, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !143, file: !142, line: 36, baseType: !94, size: 64, offset: 192)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__1", scope: !2, file: !73, line: 99, type: !140, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__2", scope: !2, file: !73, line: 100, type: !140, isLocal: true, isDefinition: true)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr_pool_t", file: !232, line: 56, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qstr_pool_t", file: !232, line: 50, size: 256, elements: !295)
!295 = !{!296, !298, !299, !300, !301}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !294, file: !232, line: 51, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "total_prev_len", scope: !294, file: !232, line: 52, baseType: !179, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !294, file: !232, line: 53, baseType: !179, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !294, file: !232, line: 54, baseType: !179, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "qstrs", scope: !294, file: !232, line: 55, baseType: !302, offset: 256)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: -1)
!305 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!306 = !{i32 2, !"Dwarf Version", i32 4}
!307 = !{i32 2, !"Debug Info Version", i32 3}
!308 = !{i32 1, !"wchar_size", i32 4}
!309 = !{i32 7, !"PIC Level", i32 2}
!310 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
