; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._qstr_pool_t = type { %struct._qstr_pool_t*, i64, i64, i64, [0 x i8*] }
%struct.anon = type { i8*, i64* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._mp_obj_str_t = type { %struct._mp_obj_base_t, i64, i64, i8* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }

!3 = !DIFile(filename: "build/_frozen_mpy.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !{!5, !14, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 423, size: 32, elements: !7)
!6 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "PRINT_STR", value: 0)
!9 = !DIEnumerator(name: "PRINT_REPR", value: 1)
!10 = !DIEnumerator(name: "PRINT_EXC", value: 2)
!11 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!12 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!13 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 47, size: 32, elements: !16)
!15 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!18 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!19 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!20 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!22 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!23 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!24 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!25 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!26 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !{!0, !70, !108, !115, !122, !127, !137, !287, !289}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "raw_code_frozentest__lt_module_gt_", scope: !2, file: !72, line: 106, type: !73, isLocal: false, isDefinition: true)
!72 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/build/_frozen_mpy.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !75, line: 62, baseType: !76)
!75 = !DIFile(filename: "../../py/emitglue.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !75, line: 42, size: 256, elements: !77)
!77 = !{!78, !84, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !76, file: !75, line: 43, baseType: !79, size: 3, flags: DIFlagBitField, extraData: i64 0)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !80, line: 71, baseType: !81)
!80 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !82, line: 30, baseType: !83)
!82 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !76, file: !75, line: 44, baseType: !79, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !76, file: !75, line: 45, baseType: !79, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !75, line: 61, baseType: !87, size: 192, offset: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !75, line: 46, size: 192, elements: !88)
!88 = !{!89, !101}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !87, file: !75, line: 55, baseType: !90, size: 128)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !75, line: 47, size: 128, elements: !91)
!91 = !{!92, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !90, file: !75, line: 48, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !96, line: 39, baseType: !97)
!96 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !90, file: !75, line: 49, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !87, file: !75, line: 60, baseType: !102, size: 192)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !87, file: !75, line: 56, size: 192, elements: !103)
!103 = !{!104, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !102, file: !75, line: 57, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !102, file: !75, line: 58, baseType: !99, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !102, file: !75, line: 59, baseType: !79, size: 64, offset: 128)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "mp_frozen_mpy_names", scope: !2, file: !72, line: 121, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !113)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!113 = !{!114}
!114 = !DISubrange(count: 16)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "mp_frozen_mpy_content", scope: !2, file: !72, line: 124, type: !117, isLocal: false, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !120)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "bytecode_data_frozentest__lt_module_gt_", scope: !2, file: !72, line: 51, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 736, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 92)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "const_table_data_frozentest__lt_module_gt_", scope: !2, file: !72, line: 101, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 192, elements: !135)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!135 = !{!136}
!136 = !DISubrange(count: 3)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__0", scope: !2, file: !72, line: 98, type: !139, isLocal: true, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !141, line: 37, baseType: !142)
!141 = !DIFile(filename: "../../py/objstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !141, line: 31, size: 256, elements: !143)
!143 = !{!144, !284, !285, !286}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !142, file: !141, line: 32, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !6, line: 57, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !153)
!153 = !{!154, !155, !159, !160, !184, !208, !213, !219, !225, !233, !238, !250, !255, !276, !277, !278}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !152, file: !6, line: 476, baseType: !145, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !6, line: 479, baseType: !156, size: 16, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !157, line: 31, baseType: !158)
!157 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !6, line: 482, baseType: !156, size: 16, offset: 80)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !152, file: !6, line: 485, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !165, !182, !183}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !168, line: 53, baseType: !169)
!168 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !168, line: 50, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !168, line: 51, baseType: !105, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !169, file: !168, line: 52, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !168, line: 48, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !105, !177, !178}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 31, baseType: !180)
!179 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !181, line: 92, baseType: !83)
!181 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !105)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !152, file: !6, line: 488, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!182, !149, !178, !189, !191}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !193, file: !6, line: 366, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !193, file: !6, line: 367, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !193, file: !6, line: 368, baseType: !178, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !193, file: !6, line: 369, baseType: !178, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !193, file: !6, line: 371, baseType: !178, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !193, file: !6, line: 372, baseType: !178, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !193, file: !6, line: 373, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !204, file: !6, line: 351, baseType: !182, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !6, line: 352, baseType: !182, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !152, file: !6, line: 491, baseType: !209, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!182, !182, !178, !178, !189}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !152, file: !6, line: 495, baseType: !214, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!182, !218, !182}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !152, file: !6, line: 496, baseType: !220, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!182, !224, !182, !182}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !152, file: !6, line: 509, baseType: !226, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !182, !230, !232}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !231, line: 48, baseType: !178)
!231 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !152, file: !6, line: 516, baseType: !234, size: 64, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!182, !182, !182, !182}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !152, file: !6, line: 521, baseType: !239, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!182, !182, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !245, file: !6, line: 433, baseType: !145, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !6, line: 434, baseType: !249, size: 192, offset: 64)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 192, elements: !135)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !152, file: !6, line: 525, baseType: !251, size: 64, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!182, !182}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !152, file: !6, line: 528, baseType: !256, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !257, file: !6, line: 469, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !182, !268, !79}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !80, line: 70, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !265, line: 32, baseType: !266)
!265 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !181, line: 49, baseType: !267)
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !270, file: !6, line: 457, baseType: !105, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !270, file: !6, line: 458, baseType: !178, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !270, file: !6, line: 459, baseType: !275, size: 32, offset: 128)
!275 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !152, file: !6, line: 531, baseType: !133, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !6, line: 537, baseType: !133, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !152, file: !6, line: 540, baseType: !279, size: 64, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !280, file: !6, line: 776, baseType: !145, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !280, file: !6, line: 777, baseType: !192, size: 192, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !142, file: !141, line: 33, baseType: !79, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !142, file: !141, line: 35, baseType: !178, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !141, line: 36, baseType: !93, size: 64, offset: 192)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__1", scope: !2, file: !72, line: 99, type: !139, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "const_obj_frozentest__lt_module_gt__2", scope: !2, file: !72, line: 100, type: !139, isLocal: true, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr_pool_t", file: !231, line: 56, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qstr_pool_t", file: !231, line: 50, size: 256, elements: !294)
!294 = !{!295, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !293, file: !231, line: 51, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "total_prev_len", scope: !293, file: !231, line: 52, baseType: !178, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !293, file: !231, line: 53, baseType: !178, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !293, file: !231, line: 54, baseType: !178, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "qstrs", scope: !293, file: !231, line: 55, baseType: !301, offset: 256)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: -1)
!304 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!305 = !{i32 2, !"Dwarf Version", i32 4}
!306 = !{i32 2, !"Debug Info Version", i32 3}
!307 = !{i32 1, !"wchar_size", i32 4}
!308 = !{i32 7, !"PIC Level", i32 2}
!309 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
