; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._mp_arg_t = type { i16, i16, %union._mp_arg_val_t }
%union._mp_arg_val_t = type { i64 }

@.str = private unnamed_addr constant [28 x i8] c"argument num/types mismatch\00", align 1

; Function Attrs: nounwind ssp uwtable
define void @mp_arg_check_num(i64, %struct._mp_map_t* readonly, i64, i64, i1 zeroext) local_unnamed_addr #0 !dbg !34 {
  call void @llvm.dbg.value(metadata i64 %0, metadata !61, metadata !DIExpression()), !dbg !67
  call void @llvm.dbg.value(metadata %struct._mp_map_t* %1, metadata !62, metadata !DIExpression()), !dbg !68
  call void @llvm.dbg.value(metadata i64 %2, metadata !63, metadata !DIExpression()), !dbg !69
  call void @llvm.dbg.value(metadata i64 %3, metadata !64, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.value(metadata i64 0, metadata !66, metadata !DIExpression()), !dbg !71
  %6 = icmp eq %struct._mp_map_t* %1, null, !dbg !72
  br i1 %6, label %11, label %7, !dbg !74

; <label>:7:                                      ; preds = %5

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple clang version 11.0.0 (clang-1100.0.33.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !25, nameTableKind: GNU)
!6 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c", directory: "/private/var/folders/8t/rc0yh_3d5j32mgv0b31lrm080000gn/T")
!7 = !{!8, !18}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 38, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17}
!12 = !DIEnumerator(name: "MP_ARG_BOOL", value: 1, isUnsigned: true)
!13 = !DIEnumerator(name: "MP_ARG_INT", value: 2, isUnsigned: true)
!14 = !DIEnumerator(name: "MP_ARG_OBJ", value: 3, isUnsigned: true)
!15 = !DIEnumerator(name: "MP_ARG_KIND_MASK", value: 255, isUnsigned: true)
!16 = !DIEnumerator(name: "MP_ARG_REQUIRED", value: 256, isUnsigned: true)
!17 = !DIEnumerator(name: "MP_ARG_KW_ONLY", value: 512, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !19, line: 377, baseType: !10, size: 32, elements: !20)
!19 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/obj.h", directory: "")
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3, isUnsigned: true)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !19, line: 46, baseType: !26)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !29, line: 70, baseType: !30)
!29 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 30, baseType: !32)
!31 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!34 = distinct !DISubprogram(name: "mp_arg_check_num", scope: !35, file: !35, line: 36, type: !36, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !60)
!35 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !42, !38, !38, !59}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 31, baseType: !40)
!39 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !41, line: 92, baseType: !32)
!41 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !19, line: 374, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !19, line: 365, size: 192, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !44, file: !19, line: 366, baseType: !38, size: 1, flags: DIFlagBitField, extraData: i64 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !44, file: !19, line: 367, baseType: !38, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !44, file: !19, line: 368, baseType: !38, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !44, file: !19, line: 369, baseType: !38, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !44, file: !19, line: 371, baseType: !38, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !44, file: !19, line: 372, baseType: !38, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !44, file: !19, line: 373, baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !19, line: 353, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !19, line: 350, size: 128, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !55, file: !19, line: 351, baseType: !27, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !19, line: 352, baseType: !27, size: 64, offset: 64)
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DILocalVariable(name: "n_args", arg: 1, scope: !34, file: !35, line: 36, type: !38)
!62 = !DILocalVariable(name: "kw_args", arg: 2, scope: !34, file: !35, line: 36, type: !42)
!63 = !DILocalVariable(name: "n_args_min", arg: 3, scope: !34, file: !35, line: 36, type: !38)
!64 = !DILocalVariable(name: "n_args_max", arg: 4, scope: !34, file: !35, line: 36, type: !38)
!65 = !DILocalVariable(name: "takes_kw", arg: 5, scope: !34, file: !35, line: 36, type: !59)
!66 = !DILocalVariable(name: "n_kw", scope: !34, file: !35, line: 37, type: !38)
!67 = !DILocation(line: 36, column: 30, scope: !34)
!68 = !DILocation(line: 36, column: 48, scope: !34)
!69 = !DILocation(line: 36, column: 64, scope: !34)
!70 = !DILocation(line: 36, column: 83, scope: !34)
!71 = !DILocation(line: 37, column: 12, scope: !34)
!72 = !DILocation(line: 38, column: 17, scope: !73)
!73 = distinct !DILexicalBlock(scope: !34, file: !35, line: 38, column: 9)
!74 = !DILocation(line: 38, column: 9, scope: !34)
!75 = !DILocation(line: 39, column: 25, scope: !76)
!76 = distinct !DILexicalBlock(scope: !73, file: !35, line: 38, column: 26)
!77 = !DILocation(line: 40, column: 5, scope: !76)
!78 = !DILocation(line: 0, scope: !34)
!79 = !DILocation(line: 41, column: 5, scope: !34)
!80 = !DILocation(line: 42, column: 1, scope: !34)
!81 = distinct !DISubprogram(name: "mp_arg_check_num_kw_array", scope: !35, file: !35, line: 44, type: !82, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !84)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !38, !38, !38, !38, !59}
!84 = !{!85, !86, !87, !88, !89}
!85 = !DILocalVariable(name: "n_args", arg: 1, scope: !81, file: !35, line: 44, type: !38)
!86 = !DILocalVariable(name: "n_kw", arg: 2, scope: !81, file: !35, line: 44, type: !38)
!87 = !DILocalVariable(name: "n_args_min", arg: 3, scope: !81, file: !35, line: 44, type: !38)
!88 = !DILocalVariable(name: "n_args_max", arg: 4, scope: !81, file: !35, line: 44, type: !38)
!89 = !DILocalVariable(name: "takes_kw", arg: 5, scope: !81, file: !35, line: 44, type: !59)
!90 = !DILocation(line: 44, column: 39, scope: !81)
!91 = !DILocation(line: 44, column: 54, scope: !81)
!92 = !DILocation(line: 44, column: 67, scope: !81)
!93 = !DILocation(line: 44, column: 86, scope: !81)
!94 = !DILocation(line: 47, column: 5, scope: !81)
!95 = !{i32 1916}
!96 = !DILocation(line: 50, column: 14, scope: !97)
!97 = distinct !DILexicalBlock(scope: !81, file: !35, line: 50, column: 9)
!98 = !DILocation(line: 50, column: 18, scope: !97)
!99 = !DILocation(line: 52, column: 13, scope: !100)
!100 = distinct !DILexicalBlock(scope: !97, file: !35, line: 50, column: 32)
!101 = !DILocation(line: 58, column: 20, scope: !102)
!102 = distinct !DILexicalBlock(scope: !81, file: !35, line: 58, column: 9)
!103 = !DILocation(line: 58, column: 9, scope: !81)
!104 = !DILocation(line: 59, column: 20, scope: !105)
!105 = distinct !DILexicalBlock(scope: !106, file: !35, line: 59, column: 13)
!106 = distinct !DILexicalBlock(scope: !102, file: !35, line: 58, column: 35)
!107 = !DILocation(line: 59, column: 13, scope: !106)
!108 = !DILocation(line: 61, column: 17, scope: !109)
!109 = distinct !DILexicalBlock(scope: !105, file: !35, line: 59, column: 35)
!110 = !DILocation(line: 69, column: 20, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !35, line: 69, column: 13)
!112 = distinct !DILexicalBlock(scope: !102, file: !35, line: 68, column: 12)
!113 = !DILocation(line: 69, column: 13, scope: !112)
!114 = !DILocation(line: 71, column: 17, scope: !115)
!115 = distinct !DILexicalBlock(scope: !111, file: !35, line: 69, column: 34)
!116 = !DILocation(line: 77, column: 27, scope: !117)
!117 = distinct !DILexicalBlock(scope: !111, file: !35, line: 77, column: 20)
!118 = !DILocation(line: 77, column: 20, scope: !111)
!119 = !DILocation(line: 79, column: 17, scope: !120)
!120 = distinct !DILexicalBlock(scope: !117, file: !35, line: 77, column: 41)
!121 = !DILocation(line: 87, column: 1, scope: !81)
!122 = distinct !DISubprogram(name: "mp_arg_error_terse_mismatch", scope: !35, file: !35, line: 161, type: !123, scopeLine: 161, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !{}
!126 = !DILocation(line: 162, column: 24, scope: !122)
!127 = !DILocation(line: 162, column: 5, scope: !122)
!128 = distinct !DISubprogram(name: "mp_arg_parse_all", scope: !35, file: !35, line: 89, type: !129, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !161)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !38, !131, !42, !38, !133, !160}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_t", file: !9, line: 58, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_arg_t", file: !9, line: 54, size: 128, elements: !137)
!137 = !{!138, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !136, file: !9, line: 55, baseType: !139, size: 16)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !140, line: 31, baseType: !141)
!140 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !9, line: 56, baseType: !139, size: 16, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !136, file: !9, line: 57, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_val_t", file: !9, line: 52, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_mp_arg_val_t", file: !9, line: 47, size: 64, elements: !146)
!146 = !{!147, !148, !154, !155}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "u_bool", scope: !145, file: !9, line: 48, baseType: !59, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "u_int", scope: !145, file: !9, line: 49, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !29, line: 69, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !151, line: 32, baseType: !152)
!151 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !41, line: 49, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "u_obj", scope: !145, file: !9, line: 50, baseType: !27, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "u_rom_obj", scope: !145, file: !9, line: 51, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !19, line: 243, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !19, line: 47, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !175}
!162 = !DILocalVariable(name: "n_pos", arg: 1, scope: !128, file: !35, line: 89, type: !38)
!163 = !DILocalVariable(name: "pos", arg: 2, scope: !128, file: !35, line: 89, type: !131)
!164 = !DILocalVariable(name: "kws", arg: 3, scope: !128, file: !35, line: 89, type: !42)
!165 = !DILocalVariable(name: "n_allowed", arg: 4, scope: !128, file: !35, line: 89, type: !38)
!166 = !DILocalVariable(name: "allowed", arg: 5, scope: !128, file: !35, line: 89, type: !133)
!167 = !DILocalVariable(name: "out_vals", arg: 6, scope: !128, file: !35, line: 89, type: !160)
!168 = !DILocalVariable(name: "pos_found", scope: !128, file: !35, line: 91, type: !38)
!169 = !DILocalVariable(name: "kws_found", scope: !128, file: !35, line: 91, type: !38)
!170 = !DILocalVariable(name: "i", scope: !171, file: !35, line: 92, type: !38)
!171 = distinct !DILexicalBlock(scope: !128, file: !35, line: 92, column: 5)
!172 = !DILocalVariable(name: "given_arg", scope: !173, file: !35, line: 94, type: !27)
!173 = distinct !DILexicalBlock(scope: !174, file: !35, line: 92, column: 44)
!174 = distinct !DILexicalBlock(scope: !171, file: !35, line: 92, column: 5)
!175 = !DILocalVariable(name: "kw", scope: !176, file: !35, line: 104, type: !53)
!176 = distinct !DILexicalBlock(scope: !177, file: !35, line: 102, column: 16)
!177 = distinct !DILexicalBlock(scope: !173, file: !35, line: 95, column: 13)
!178 = !DILocation(line: 89, column: 30, scope: !128)
!179 = !DILocation(line: 89, column: 53, scope: !128)
!180 = !DILocation(line: 89, column: 68, scope: !128)
!181 = !DILocation(line: 89, column: 80, scope: !128)
!182 = !DILocation(line: 89, column: 107, scope: !128)
!183 = !DILocation(line: 89, column: 130, scope: !128)
!184 = !DILocation(line: 91, column: 12, scope: !128)
!185 = !DILocation(line: 91, column: 27, scope: !128)
!186 = !DILocation(line: 92, column: 17, scope: !171)
!187 = !DILocation(line: 94, column: 18, scope: !173)
!188 = !DILocation(line: 92, column: 26, scope: !174)
!189 = !DILocation(line: 92, column: 5, scope: !171)
!190 = !DILocation(line: 95, column: 15, scope: !177)
!191 = !DILocation(line: 95, column: 13, scope: !173)
