; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._mp_arg_t = type { i16, i16, %union._mp_arg_val_t }
%union._mp_arg_val_t = type { i64 }

@.str = private unnamed_addr constant [28 x i8] c"argument num/types mismatch\00", align 1

; Function Attrs: nounwind ssp uwtable
define void @mp_arg_check_num(i64, %struct._mp_map_t* readonly, i64, i64, i1 zeroext) local_unnamed_addr #0 !dbg !33 {
  call void @llvm.dbg.value(metadata i64 %0, metadata !59, metadata !DIExpression()), !dbg !65
  call void @llvm.dbg.value(metadata %struct._mp_map_t* %1, metadata !60, metadata !DIExpression()), !dbg !66
  call void @llvm.dbg.value(metadata i64 %2, metadata !61, metadata !DIExpression()), !dbg !67
  call void @llvm.dbg.value(metadata i64 %3, metadata !62, metadata !DIExpression()), !dbg !68
  call void @llvm.dbg.value(metadata i1 %4, metadata !63, metadata !DIExpression()), !dbg !69
  call void @llvm.dbg.value(metadata i64 0, metadata !64, metadata !DIExpression()), !dbg !70
  %6 = icmp eq %struct._mp_map_t* %1, null, !dbg !71
  br i1 %6, label %11, label %7, !dbg !73


!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!1 = !{i32 2, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = distinct !DICompileUnit(language: DW_LANG_C99, file: !6, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !24)
!6 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/argcheck.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !17}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 38, size: 32, elements: !10)
!9 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!10 = !{!11, !12, !13, !14, !15, !16}
!11 = !DIEnumerator(name: "MP_ARG_BOOL", value: 1)
!12 = !DIEnumerator(name: "MP_ARG_INT", value: 2)
!13 = !DIEnumerator(name: "MP_ARG_OBJ", value: 3)
!14 = !DIEnumerator(name: "MP_ARG_KIND_MASK", value: 255)
!15 = !DIEnumerator(name: "MP_ARG_REQUIRED", value: 256)
!16 = !DIEnumerator(name: "MP_ARG_KW_ONLY", value: 512)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !18, line: 377, size: 32, elements: !19)
!18 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0)
!21 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1)
!22 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2)
!23 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !18, line: 46, baseType: !25)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !28, line: 71, baseType: !29)
!28 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 30, baseType: !31)
!30 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!33 = distinct !DISubprogram(name: "mp_arg_check_num", scope: !6, file: !6, line: 35, type: !34, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !58)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36, !40, !36, !36, !57}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 31, baseType: !38)
!37 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !39, line: 92, baseType: !31)
!39 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !18, line: 374, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !18, line: 365, size: 192, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !42, file: !18, line: 366, baseType: !36, size: 1, flags: DIFlagBitField, extraData: i64 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !42, file: !18, line: 367, baseType: !36, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !42, file: !18, line: 368, baseType: !36, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !42, file: !18, line: 369, baseType: !36, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !42, file: !18, line: 371, baseType: !36, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !42, file: !18, line: 372, baseType: !36, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !42, file: !18, line: 373, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !18, line: 353, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !18, line: 350, size: 128, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !53, file: !18, line: 351, baseType: !26, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !53, file: !18, line: 352, baseType: !26, size: 64, offset: 64)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DILocalVariable(name: "n_args", arg: 1, scope: !33, file: !6, line: 35, type: !36)
!60 = !DILocalVariable(name: "kw_args", arg: 2, scope: !33, file: !6, line: 35, type: !40)
!61 = !DILocalVariable(name: "n_args_min", arg: 3, scope: !33, file: !6, line: 35, type: !36)
!62 = !DILocalVariable(name: "n_args_max", arg: 4, scope: !33, file: !6, line: 35, type: !36)
!63 = !DILocalVariable(name: "takes_kw", arg: 5, scope: !33, file: !6, line: 35, type: !57)
!64 = !DILocalVariable(name: "n_kw", scope: !33, file: !6, line: 36, type: !36)
!65 = !DILocation(line: 35, column: 30, scope: !33)
!66 = !DILocation(line: 35, column: 48, scope: !33)
!67 = !DILocation(line: 35, column: 64, scope: !33)
!68 = !DILocation(line: 35, column: 83, scope: !33)
!69 = !DILocation(line: 35, column: 100, scope: !33)
!70 = !DILocation(line: 36, column: 12, scope: !33)
!71 = !DILocation(line: 37, column: 17, scope: !72)
!72 = distinct !DILexicalBlock(scope: !33, file: !6, line: 37, column: 9)
!73 = !DILocation(line: 37, column: 9, scope: !33)
!74 = !DILocation(line: 38, column: 25, scope: !75)
!75 = distinct !DILexicalBlock(scope: !72, file: !6, line: 37, column: 26)
!76 = !DILocation(line: 39, column: 5, scope: !75)
!77 = !DILocation(line: 0, scope: !33)
!78 = !DILocation(line: 40, column: 5, scope: !33)
!79 = !DILocation(line: 41, column: 1, scope: !33)
!80 = distinct !DISubprogram(name: "mp_arg_check_num_kw_array", scope: !6, file: !6, line: 43, type: !81, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !36, !36, !36, !36, !57}
!83 = !{!84, !85, !86, !87, !88}
!84 = !DILocalVariable(name: "n_args", arg: 1, scope: !80, file: !6, line: 43, type: !36)
!85 = !DILocalVariable(name: "n_kw", arg: 2, scope: !80, file: !6, line: 43, type: !36)
!86 = !DILocalVariable(name: "n_args_min", arg: 3, scope: !80, file: !6, line: 43, type: !36)
!87 = !DILocalVariable(name: "n_args_max", arg: 4, scope: !80, file: !6, line: 43, type: !36)
!88 = !DILocalVariable(name: "takes_kw", arg: 5, scope: !80, file: !6, line: 43, type: !57)
!89 = !DILocation(line: 43, column: 39, scope: !80)
!90 = !DILocation(line: 43, column: 54, scope: !80)
!91 = !DILocation(line: 43, column: 67, scope: !80)
!92 = !DILocation(line: 43, column: 86, scope: !80)
!93 = !DILocation(line: 43, column: 103, scope: !80)
!94 = !DILocation(line: 46, column: 5, scope: !80)
!95 = !{i32 1897}
!96 = !DILocation(line: 49, column: 14, scope: !97)
!97 = distinct !DILexicalBlock(scope: !80, file: !6, line: 49, column: 9)
!98 = !DILocation(line: 49, column: 18, scope: !97)
!99 = !DILocation(line: 51, column: 13, scope: !100)
!100 = distinct !DILexicalBlock(scope: !97, file: !6, line: 49, column: 32)
!101 = !DILocation(line: 57, column: 20, scope: !102)
!102 = distinct !DILexicalBlock(scope: !80, file: !6, line: 57, column: 9)
!103 = !DILocation(line: 57, column: 9, scope: !80)
!104 = !DILocation(line: 58, column: 20, scope: !105)
!105 = distinct !DILexicalBlock(scope: !106, file: !6, line: 58, column: 13)
!106 = distinct !DILexicalBlock(scope: !102, file: !6, line: 57, column: 35)
!107 = !DILocation(line: 58, column: 13, scope: !106)
!108 = !DILocation(line: 60, column: 17, scope: !109)
!109 = distinct !DILexicalBlock(scope: !105, file: !6, line: 58, column: 35)
!110 = !DILocation(line: 68, column: 20, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !6, line: 68, column: 13)
!112 = distinct !DILexicalBlock(scope: !102, file: !6, line: 67, column: 12)
!113 = !DILocation(line: 68, column: 13, scope: !112)
!114 = !DILocation(line: 70, column: 17, scope: !115)
!115 = distinct !DILexicalBlock(scope: !111, file: !6, line: 68, column: 34)
!116 = !DILocation(line: 76, column: 27, scope: !117)
!117 = distinct !DILexicalBlock(scope: !111, file: !6, line: 76, column: 20)
!118 = !DILocation(line: 76, column: 20, scope: !111)
!119 = !DILocation(line: 78, column: 17, scope: !120)
!120 = distinct !DILexicalBlock(scope: !117, file: !6, line: 76, column: 41)
!121 = !DILocation(line: 86, column: 1, scope: !80)
!122 = distinct !DISubprogram(name: "mp_arg_error_terse_mismatch", scope: !6, file: !6, line: 150, type: !123, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{null}
!125 = !{}
!126 = !DILocation(line: 151, column: 24, scope: !122)
!127 = !DILocation(line: 151, column: 5, scope: !122)
!128 = distinct !DISubprogram(name: "mp_arg_parse_all", scope: !6, file: !6, line: 88, type: !129, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !161)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !36, !131, !40, !36, !133, !160}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_t", file: !9, line: 58, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_arg_t", file: !9, line: 54, size: 128, elements: !137)
!137 = !{!138, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !136, file: !9, line: 55, baseType: !139, size: 16)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !140, line: 31, baseType: !141)
!140 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !9, line: 56, baseType: !139, size: 16, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !136, file: !9, line: 57, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_val_t", file: !9, line: 52, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_mp_arg_val_t", file: !9, line: 47, size: 64, elements: !146)
!146 = !{!147, !148, !154, !155}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "u_bool", scope: !145, file: !9, line: 48, baseType: !57, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "u_int", scope: !145, file: !9, line: 49, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !28, line: 70, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !151, line: 32, baseType: !152)
!151 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !39, line: 49, baseType: !153)
!153 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "u_obj", scope: !145, file: !9, line: 50, baseType: !26, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "u_rom_obj", scope: !145, file: !9, line: 51, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !18, line: 243, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !18, line: 47, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !172, !175}
!162 = !DILocalVariable(name: "n_pos", arg: 1, scope: !128, file: !6, line: 88, type: !36)
!163 = !DILocalVariable(name: "pos", arg: 2, scope: !128, file: !6, line: 88, type: !131)
!164 = !DILocalVariable(name: "kws", arg: 3, scope: !128, file: !6, line: 88, type: !40)
!165 = !DILocalVariable(name: "n_allowed", arg: 4, scope: !128, file: !6, line: 88, type: !36)
!166 = !DILocalVariable(name: "allowed", arg: 5, scope: !128, file: !6, line: 88, type: !133)
!167 = !DILocalVariable(name: "out_vals", arg: 6, scope: !128, file: !6, line: 88, type: !160)
!168 = !DILocalVariable(name: "pos_found", scope: !128, file: !6, line: 89, type: !36)
!169 = !DILocalVariable(name: "kws_found", scope: !128, file: !6, line: 89, type: !36)
!170 = !DILocalVariable(name: "i", scope: !171, file: !6, line: 90, type: !36)
!171 = distinct !DILexicalBlock(scope: !128, file: !6, line: 90, column: 5)
!172 = !DILocalVariable(name: "given_arg", scope: !173, file: !6, line: 91, type: !26)
!173 = distinct !DILexicalBlock(scope: !174, file: !6, line: 90, column: 44)
!174 = distinct !DILexicalBlock(scope: !171, file: !6, line: 90, column: 5)
!175 = !DILocalVariable(name: "kw", scope: !176, file: !6, line: 99, type: !51)
!176 = distinct !DILexicalBlock(scope: !177, file: !6, line: 98, column: 16)
!177 = distinct !DILexicalBlock(scope: !173, file: !6, line: 92, column: 13)
!178 = !DILocation(line: 88, column: 30, scope: !128)
!179 = !DILocation(line: 88, column: 53, scope: !128)
!180 = !DILocation(line: 88, column: 68, scope: !128)
!181 = !DILocation(line: 88, column: 80, scope: !128)
!182 = !DILocation(line: 88, column: 107, scope: !128)
!183 = !DILocation(line: 88, column: 130, scope: !128)
!184 = !DILocation(line: 89, column: 12, scope: !128)
!185 = !DILocation(line: 89, column: 27, scope: !128)
!186 = !DILocation(line: 90, column: 17, scope: !171)
!187 = !DILocation(line: 91, column: 18, scope: !173)
!188 = !DILocation(line: 90, column: 26, scope: !174)
!189 = !DILocation(line: 90, column: 5, scope: !171)
!190 = !DILocation(line: 92, column: 15, scope: !177)
