; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/bc.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/bc.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_code_state_t = type { %struct._mp_obj_fun_bc_t*, i8*, i8**, %struct._mp_exc_stack_t*, %struct._mp_obj_dict_t*, [0 x i8*] }
%struct._mp_obj_fun_bc_t = type { %struct._mp_obj_base_t, %struct._mp_obj_dict_t*, i8*, i64*, [0 x i8*] }

!14 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!15 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!16 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 47, size: 32, elements: !19)
!18 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!22 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!23 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!24 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!25 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!26 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!27 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!28 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!29 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!30 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 69, size: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!35 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!36 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!37 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!38 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!39 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!40 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!41 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!52 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!53 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!54 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!55 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!56 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!57 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!58 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!59 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!60 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!62 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!63 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!64 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!65 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!67 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!68 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!69 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!70 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!71 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !9, line: 377, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0)
!75 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1)
!76 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2)
!77 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3)
!78 = !{!79, !84, !97, !98, !142, !231, !244, !217}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 31, baseType: !81)
!80 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !82, line: 92, baseType: !83)
!82 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !86, line: 70, baseType: !87)
!86 = !DIFile(filename: "../../py/bc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !86, line: 63, size: 192, elements: !88)
!88 = !{!89, !95, !99}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !87, file: !86, line: 64, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !93, line: 39, baseType: !94)
!93 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !87, file: !86, line: 67, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !9, line: 46, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !87, file: !86, line: 69, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !9, line: 59, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !9, line: 56, size: 64, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !9, line: 57, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !9, line: 52, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !9, line: 474, size: 960, elements: !109)
!109 = !{!110, !111, !115, !116, !137, !161, !166, !172, !178, !185, !190, !204, !209, !234, !237, !238}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !108, file: !9, line: 476, baseType: !101, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !9, line: 479, baseType: !112, size: 16, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !113, line: 31, baseType: !114)
!113 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !9, line: 482, baseType: !112, size: 16, offset: 80)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !108, file: !9, line: 485, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !9, line: 441, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !121, !97, !136}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !124, line: 53, baseType: !125)
!124 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !124, line: 50, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !124, line: 51, baseType: !98, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !125, file: !124, line: 52, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !124, line: 48, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !98, !133, !79}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !9, line: 430, baseType: !8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !108, file: !9, line: 488, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !9, line: 442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!97, !105, !79, !142, !144}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !9, line: 374, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !9, line: 365, size: 192, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !146, file: !9, line: 366, baseType: !79, size: 1, flags: DIFlagBitField, extraData: i64 0)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !146, file: !9, line: 367, baseType: !79, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !146, file: !9, line: 368, baseType: !79, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !146, file: !9, line: 369, baseType: !79, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !146, file: !9, line: 371, baseType: !79, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !146, file: !9, line: 372, baseType: !79, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !146, file: !9, line: 373, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !9, line: 353, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !9, line: 350, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !157, file: !9, line: 351, baseType: !97, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !157, file: !9, line: 352, baseType: !97, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !108, file: !9, line: 491, baseType: !162, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !9, line: 443, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!97, !97, !79, !79, !142}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !108, file: !9, line: 495, baseType: !167, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !9, line: 444, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!97, !171, !97}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !18, line: 65, baseType: !17)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !108, file: !9, line: 496, baseType: !173, size: 64, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !9, line: 445, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!97, !177, !97, !97}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !18, line: 145, baseType: !31)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !108, file: !9, line: 509, baseType: !179, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !9, line: 446, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !97, !183, !96}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !184, line: 48, baseType: !79)
!184 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !108, file: !9, line: 516, baseType: !186, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !9, line: 447, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!97, !97, !97, !97}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !108, file: !9, line: 521, baseType: !191, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !9, line: 448, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!97, !97, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !9, line: 435, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !9, line: 432, size: 256, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !197, file: !9, line: 433, baseType: !101, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !197, file: !9, line: 434, baseType: !201, size: 192, offset: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 192, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !108, file: !9, line: 525, baseType: !205, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !9, line: 415, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!97, !97}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !108, file: !9, line: 528, baseType: !210, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !9, line: 470, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !9, line: 468, size: 64, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !211, file: !9, line: 469, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!217, !97, !223, !231}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !218, line: 70, baseType: !219)
!218 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !220, line: 32, baseType: !221)
!220 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !82, line: 49, baseType: !222)
!222 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !9, line: 464, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !9, line: 451, size: 192, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !225, file: !9, line: 457, baseType: !98, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !9, line: 458, baseType: !79, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !225, file: !9, line: 459, baseType: !230, size: 32, offset: 128)
!230 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !218, line: 71, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !233, line: 30, baseType: !83)
!233 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !108, file: !9, line: 531, baseType: !235, size: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !108, file: !9, line: 537, baseType: !235, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !108, file: !9, line: 540, baseType: !239, size: 64, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !9, line: 775, size: 256, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !240, file: !9, line: 776, baseType: !101, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !240, file: !9, line: 777, baseType: !145, size: 192, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !9, line: 778, baseType: !240)
!246 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!247 = distinct !DISubprogram(name: "mp_decode_uint", scope: !6, file: !6, line: 45, type: !248, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !251)
!248 = !DISubroutineType(types: !249)
!249 = !{!231, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!251 = !{!252, !253, !254, !255}
!252 = !DILocalVariable(name: "ptr", arg: 1, scope: !247, file: !6, line: 45, type: !250)
!253 = !DILocalVariable(name: "unum", scope: !247, file: !6, line: 46, type: !231)
!254 = !DILocalVariable(name: "val", scope: !247, file: !6, line: 47, type: !92)
!255 = !DILocalVariable(name: "p", scope: !247, file: !6, line: 48, type: !90)
!256 = !DILocation(line: 45, column: 39, scope: !247)
!257 = !DILocation(line: 46, column: 15, scope: !247)
!258 = !DILocation(line: 48, column: 21, scope: !247)
!259 = !{!260, !260, i64 0}
!260 = !{!"any pointer", !261, i64 0}
!261 = !{!"omnipotent char", !262, i64 0}
!262 = !{!"Simple C/C++ TBAA"}
!263 = !DILocation(line: 48, column: 17, scope: !247)
!264 = !DILocation(line: 49, column: 5, scope: !247)
!265 = !DILocation(line: 0, scope: !266)
!266 = distinct !DILexicalBlock(scope: !247, file: !6, line: 49, column: 8)
!267 = !DILocation(line: 50, column: 17, scope: !266)
!268 = !DILocation(line: 50, column: 15, scope: !266)
!269 = !{!261, !261, i64 0}
!270 = !DILocation(line: 47, column: 10, scope: !247)
!271 = !DILocation(line: 51, column: 22, scope: !266)
!272 = !DILocation(line: 51, column: 35, scope: !266)
!273 = !DILocation(line: 51, column: 30, scope: !266)
!274 = !DILocation(line: 51, column: 28, scope: !266)
!275 = !DILocation(line: 52, column: 27, scope: !247)
!276 = !DILocation(line: 52, column: 5, scope: !266)
!277 = distinct !{!277, !264, !278}
!278 = !DILocation(line: 52, column: 31, scope: !247)
!279 = !DILocation(line: 53, column: 10, scope: !247)
!280 = !DILocation(line: 54, column: 5, scope: !247)
!281 = distinct !DISubprogram(name: "mp_decode_uint_value", scope: !6, file: !6, line: 63, type: !282, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!231, !90}
!284 = !{!285}
!285 = !DILocalVariable(name: "ptr", arg: 1, scope: !281, file: !6, line: 63, type: !90)
!286 = !DILocation(line: 63, column: 44, scope: !281)
!287 = !DILocation(line: 64, column: 12, scope: !281)
!288 = !DILocation(line: 64, column: 5, scope: !281)
!289 = distinct !DISubprogram(name: "mp_decode_uint_skip", scope: !6, file: !6, line: 69, type: !290, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !292)
!290 = !DISubroutineType(types: !291)
!291 = !{!90, !90}
!292 = !{!293}
!293 = !DILocalVariable(name: "ptr", arg: 1, scope: !289, file: !6, line: 69, type: !90)
!294 = !DILocation(line: 69, column: 45, scope: !289)
!295 = !DILocation(line: 70, column: 5, scope: !289)
!296 = !DILocation(line: 70, column: 17, scope: !289)
!297 = !DILocation(line: 70, column: 13, scope: !289)
!298 = distinct !{!298, !295, !299}
!299 = !DILocation(line: 71, column: 5, scope: !289)
!300 = !DILocation(line: 72, column: 5, scope: !289)
!301 = distinct !DISubprogram(name: "mp_setup_code_state", scope: !6, file: !6, line: 110, type: !302, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !332)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !304, !79, !79, !142}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !86, line: 90, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !86, line: 72, size: 320, elements: !307)
!307 = !{!308, !324, !325, !326, !327, !328}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !306, file: !86, line: 77, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !311, line: 42, baseType: !312)
!311 = !DIFile(filename: "../../py/objfun.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !311, line: 31, size: 256, elements: !313)
!313 = !{!314, !315, !316, !317, !320}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !312, file: !311, line: 32, baseType: !101, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !312, file: !311, line: 33, baseType: !244, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !312, file: !311, line: 34, baseType: !90, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !312, file: !311, line: 35, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !312, file: !311, line: 41, baseType: !321, offset: 256)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: -1)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !306, file: !86, line: 78, baseType: !90, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !306, file: !86, line: 79, baseType: !96, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !306, file: !86, line: 81, baseType: !84, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !306, file: !86, line: 82, baseType: !244, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !306, file: !86, line: 87, baseType: !329, offset: 320)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 0)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !353, !355, !358, !359, !361, !364, !366, !367, !368, !370, !372, !377, !378}
!333 = !DILocalVariable(name: "code_state", arg: 1, scope: !301, file: !6, line: 110, type: !304)
!334 = !DILocalVariable(name: "n_args", arg: 2, scope: !301, file: !6, line: 110, type: !79)
!335 = !DILocalVariable(name: "n_kw", arg: 3, scope: !301, file: !6, line: 110, type: !79)
!336 = !DILocalVariable(name: "args", arg: 4, scope: !301, file: !6, line: 110, type: !142)
!337 = !DILocalVariable(name: "self", scope: !301, file: !6, line: 115, type: !309)
!338 = !DILocalVariable(name: "n_state", scope: !301, file: !6, line: 125, type: !79)
!339 = !DILocalVariable(name: "scope_flags", scope: !301, file: !6, line: 127, type: !79)
!340 = !DILocalVariable(name: "n_pos_args", scope: !301, file: !6, line: 128, type: !79)
!341 = !DILocalVariable(name: "n_kwonly_args", scope: !301, file: !6, line: 129, type: !79)
!342 = !DILocalVariable(name: "n_def_pos_args", scope: !301, file: !6, line: 130, type: !79)
!343 = !DILocalVariable(name: "kwargs", scope: !301, file: !6, line: 138, type: !142)
!344 = !DILocalVariable(name: "var_pos_kw_args", scope: !301, file: !6, line: 141, type: !96)
!345 = !DILocalVariable(name: "i", scope: !346, file: !6, line: 163, type: !79)
!346 = distinct !DILexicalBlock(scope: !347, file: !6, line: 163, column: 17)
!347 = distinct !DILexicalBlock(scope: !348, file: !6, line: 161, column: 66)
!348 = distinct !DILexicalBlock(scope: !349, file: !6, line: 161, column: 17)
!349 = distinct !DILexicalBlock(scope: !350, file: !6, line: 160, column: 72)
!350 = distinct !DILexicalBlock(scope: !351, file: !6, line: 160, column: 13)
!351 = distinct !DILexicalBlock(scope: !352, file: !6, line: 153, column: 12)
!352 = distinct !DILexicalBlock(scope: !301, file: !6, line: 145, column: 9)
!353 = !DILocalVariable(name: "i", scope: !354, file: !6, line: 173, type: !79)
!354 = distinct !DILexicalBlock(scope: !301, file: !6, line: 173, column: 5)
!355 = !DILocalVariable(name: "dict", scope: !356, file: !6, line: 183, type: !97)
!356 = distinct !DILexicalBlock(scope: !357, file: !6, line: 179, column: 68)
!357 = distinct !DILexicalBlock(scope: !301, file: !6, line: 179, column: 9)
!358 = !DILocalVariable(name: "arg_names", scope: !356, file: !6, line: 190, type: !142)
!359 = !DILocalVariable(name: "i", scope: !360, file: !6, line: 192, type: !79)
!360 = distinct !DILexicalBlock(scope: !356, file: !6, line: 192, column: 9)
!361 = !DILocalVariable(name: "wanted_arg_name", scope: !362, file: !6, line: 194, type: !97)
!362 = distinct !DILexicalBlock(scope: !363, file: !6, line: 192, column: 43)
!363 = distinct !DILexicalBlock(scope: !360, file: !6, line: 192, column: 9)
!364 = !DILocalVariable(name: "j", scope: !365, file: !6, line: 202, type: !79)
!365 = distinct !DILexicalBlock(scope: !362, file: !6, line: 202, column: 13)
!366 = !DILocalVariable(name: "d", scope: !356, file: !6, line: 229, type: !96)
!367 = !DILocalVariable(name: "s", scope: !356, file: !6, line: 230, type: !96)
!368 = !DILocalVariable(name: "i", scope: !369, file: !6, line: 231, type: !79)
!369 = distinct !DILexicalBlock(scope: !356, file: !6, line: 231, column: 9)
!370 = !DILocalVariable(name: "i", scope: !371, file: !6, line: 250, type: !79)
!371 = distinct !DILexicalBlock(scope: !356, file: !6, line: 250, column: 9)
!372 = !DILocalVariable(name: "elem", scope: !373, file: !6, line: 252, type: !155)
!373 = distinct !DILexicalBlock(scope: !374, file: !6, line: 251, column: 81)
!374 = distinct !DILexicalBlock(scope: !375, file: !6, line: 251, column: 17)
!375 = distinct !DILexicalBlock(scope: !376, file: !6, line: 250, column: 52)
