; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/bc.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/bc.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_code_state_t = type { %struct._mp_obj_fun_bc_t*, i8*, i8**, %struct._mp_exc_stack_t*, %struct._mp_obj_dict_t*, [0 x i8*] }
%struct._mp_obj_fun_bc_t = type { %struct._mp_obj_base_t, %struct._mp_obj_dict_t*, i8*, i64*, [0 x i8*] }

!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!70 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!71 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!72 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !9, line: 377, baseType: !10, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3, isUnsigned: true)
!79 = !{!80, !81, !82, !84, !89, !129, !233, !213}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !9, line: 46, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !85, line: 70, baseType: !86)
!85 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !87, line: 30, baseType: !88)
!87 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!88 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !9, line: 778, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !9, line: 775, size: 256, elements: !92)
!92 = !{!93, !232}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !91, file: !9, line: 776, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !9, line: 59, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !9, line: 56, size: 64, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !9, line: 57, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !9, line: 52, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !9, line: 474, size: 960, elements: !102)
!102 = !{!103, !104, !108, !109, !134, !156, !161, !167, !173, !181, !186, !200, !205, !226, !229, !230}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !101, file: !9, line: 476, baseType: !94, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !9, line: 479, baseType: !105, size: 16, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !106, line: 31, baseType: !107)
!106 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!107 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !9, line: 482, baseType: !105, size: 16, offset: 80)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !101, file: !9, line: 485, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !9, line: 441, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !80, !133}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !117, line: 53, baseType: !118)
!117 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !117, line: 50, size: 128, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !118, file: !117, line: 51, baseType: !81, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !118, file: !117, line: 52, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !117, line: 48, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !81, !126, !129}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !130, line: 31, baseType: !131)
!130 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !132, line: 92, baseType: !88)
!132 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !9, line: 430, baseType: !8)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !101, file: !9, line: 488, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !9, line: 442, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!80, !98, !129, !82, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !9, line: 374, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !9, line: 365, size: 192, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !141, file: !9, line: 366, baseType: !129, size: 1, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !141, file: !9, line: 367, baseType: !129, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !141, file: !9, line: 368, baseType: !129, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !141, file: !9, line: 369, baseType: !129, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !141, file: !9, line: 371, baseType: !129, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !141, file: !9, line: 372, baseType: !129, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !141, file: !9, line: 373, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !9, line: 353, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !9, line: 350, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !152, file: !9, line: 351, baseType: !80, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !9, line: 352, baseType: !80, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !101, file: !9, line: 491, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !9, line: 443, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!80, !80, !129, !129, !82}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !101, file: !9, line: 495, baseType: !162, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !9, line: 444, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!80, !166, !80}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !19, line: 65, baseType: !18)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !101, file: !9, line: 496, baseType: !168, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !9, line: 445, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!80, !172, !80, !80}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !19, line: 145, baseType: !32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !101, file: !9, line: 509, baseType: !174, size: 64, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !9, line: 446, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !80, !178, !180}
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !179, line: 48, baseType: !129)
!179 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !101, file: !9, line: 516, baseType: !182, size: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !9, line: 447, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!80, !80, !80, !80}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !101, file: !9, line: 521, baseType: !187, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !9, line: 448, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!80, !80, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !9, line: 435, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !9, line: 432, size: 256, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !193, file: !9, line: 433, baseType: !94, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !193, file: !9, line: 434, baseType: !197, size: 192, offset: 64)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 192, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 3)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !101, file: !9, line: 525, baseType: !201, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !9, line: 415, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!80, !80}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !101, file: !9, line: 528, baseType: !206, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !9, line: 470, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !9, line: 468, size: 64, elements: !208)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !207, file: !9, line: 469, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !80, !218, !84}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !85, line: 69, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !132, line: 49, baseType: !217)
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !9, line: 464, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !9, line: 451, size: 192, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !9, line: 457, baseType: !81, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !220, file: !9, line: 458, baseType: !129, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !220, file: !9, line: 459, baseType: !225, size: 32, offset: 128)
!225 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !101, file: !9, line: 531, baseType: !227, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !9, line: 537, baseType: !227, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !101, file: !9, line: 540, baseType: !231, size: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !91, file: !9, line: 777, baseType: !140, size: 192, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !235, line: 70, baseType: !236)
!235 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/bc.h", directory: "")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !235, line: 63, size: 192, elements: !237)
!237 = !{!238, !244, !245}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !236, file: !235, line: 64, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !242, line: 39, baseType: !243)
!242 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !236, file: !235, line: 67, baseType: !180, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !236, file: !235, line: 69, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!247 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!248 = distinct !DISubprogram(name: "mp_decode_uint", scope: !249, file: !249, line: 46, type: !250, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !253)
!249 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/bc.c", directory: "")
!250 = !DISubroutineType(types: !251)
!251 = !{!84, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!253 = !{!254, !255, !256, !257}
!254 = !DILocalVariable(name: "ptr", arg: 1, scope: !248, file: !249, line: 46, type: !252)
!255 = !DILocalVariable(name: "unum", scope: !248, file: !249, line: 47, type: !84)
!256 = !DILocalVariable(name: "val", scope: !248, file: !249, line: 48, type: !241)
!257 = !DILocalVariable(name: "p", scope: !248, file: !249, line: 49, type: !239)
!258 = !DILocation(line: 46, column: 39, scope: !248)
!259 = !DILocation(line: 47, column: 15, scope: !248)
!260 = !DILocation(line: 49, column: 21, scope: !248)
!261 = !{!262, !262, i64 0}
!262 = !{!"any pointer", !263, i64 0}
!263 = !{!"omnipotent char", !264, i64 0}
!264 = !{!"Simple C/C++ TBAA"}
!265 = !DILocation(line: 49, column: 17, scope: !248)
!266 = !DILocation(line: 50, column: 5, scope: !248)
!267 = !DILocation(line: 0, scope: !248)
!268 = !DILocation(line: 51, column: 17, scope: !269)
!269 = distinct !DILexicalBlock(scope: !248, file: !249, line: 50, column: 8)
!270 = !DILocation(line: 51, column: 15, scope: !269)
!271 = !{!263, !263, i64 0}
!272 = !DILocation(line: 48, column: 10, scope: !248)
!273 = !DILocation(line: 52, column: 22, scope: !269)
!274 = !DILocation(line: 52, column: 35, scope: !269)
!275 = !DILocation(line: 52, column: 30, scope: !269)
!276 = !DILocation(line: 52, column: 28, scope: !269)
!277 = !DILocation(line: 53, column: 27, scope: !248)
!278 = !DILocation(line: 53, column: 5, scope: !269)
!279 = distinct !{!279, !266, !280}
!280 = !DILocation(line: 53, column: 31, scope: !248)
!281 = !DILocation(line: 54, column: 10, scope: !248)
!282 = !DILocation(line: 55, column: 5, scope: !248)
!283 = distinct !DISubprogram(name: "mp_decode_uint_value", scope: !249, file: !249, line: 64, type: !284, scopeLine: 64, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !286)
!284 = !DISubroutineType(types: !285)
!285 = !{!84, !239}
!286 = !{!287}
!287 = !DILocalVariable(name: "ptr", arg: 1, scope: !283, file: !249, line: 64, type: !239)
!288 = !DILocation(line: 64, column: 44, scope: !283)
!289 = !DILocation(line: 65, column: 12, scope: !283)
!290 = !DILocation(line: 65, column: 5, scope: !283)
!291 = distinct !DISubprogram(name: "mp_decode_uint_skip", scope: !249, file: !249, line: 70, type: !292, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !294)
!292 = !DISubroutineType(types: !293)
!293 = !{!239, !239}
!294 = !{!295}
!295 = !DILocalVariable(name: "ptr", arg: 1, scope: !291, file: !249, line: 70, type: !239)
!296 = !DILocation(line: 70, column: 45, scope: !291)
!297 = !DILocation(line: 71, column: 5, scope: !291)
!298 = !DILocation(line: 71, column: 17, scope: !291)
!299 = !DILocation(line: 71, column: 13, scope: !291)
!300 = distinct !{!300, !297, !301}
!301 = !DILocation(line: 72, column: 5, scope: !291)
!302 = !DILocation(line: 73, column: 5, scope: !291)
!303 = distinct !DISubprogram(name: "mp_setup_code_state_mid_head", scope: !249, file: !249, line: 113, type: !304, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !334)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !129, !129, !82, !129, !129, !129, !129, !129, !82, !180}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !235, line: 90, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !235, line: 72, size: 320, elements: !309)
!309 = !{!310, !326, !327, !328, !329, !330}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !308, file: !235, line: 77, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !313, line: 42, baseType: !314)
!313 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objfun.h", directory: "")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !313, line: 31, size: 256, elements: !315)
!315 = !{!316, !317, !318, !319, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !314, file: !313, line: 32, baseType: !94, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !314, file: !313, line: 33, baseType: !89, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !314, file: !313, line: 34, baseType: !239, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !314, file: !313, line: 35, baseType: !320, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !314, file: !313, line: 41, baseType: !323, offset: 256)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: -1)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !308, file: !235, line: 78, baseType: !239, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !308, file: !235, line: 79, baseType: !180, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !308, file: !235, line: 81, baseType: !233, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !308, file: !235, line: 82, baseType: !89, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !235, line: 87, baseType: !331, offset: 320)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 0)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !351, !354}
!335 = !DILocalVariable(name: "code_state", arg: 1, scope: !303, file: !249, line: 113, type: !306)
!336 = !DILocalVariable(name: "n_args", arg: 2, scope: !303, file: !249, line: 113, type: !129)
!337 = !DILocalVariable(name: "n_kw", arg: 3, scope: !303, file: !249, line: 113, type: !129)
!338 = !DILocalVariable(name: "args", arg: 4, scope: !303, file: !249, line: 113, type: !82)
!339 = !DILocalVariable(name: "n_state", arg: 5, scope: !303, file: !249, line: 113, type: !129)
!340 = !DILocalVariable(name: "n_pos_args", arg: 6, scope: !303, file: !249, line: 113, type: !129)
!341 = !DILocalVariable(name: "n_kwonly_args", arg: 7, scope: !303, file: !249, line: 113, type: !129)
!342 = !DILocalVariable(name: "n_def_pos_args", arg: 8, scope: !303, file: !249, line: 113, type: !129)
!343 = !DILocalVariable(name: "scope_flags", arg: 9, scope: !303, file: !249, line: 113, type: !129)
!344 = !DILocalVariable(name: "kwargs", arg: 10, scope: !303, file: !249, line: 113, type: !82)
!345 = !DILocalVariable(name: "var_pos_kw_args", arg: 11, scope: !303, file: !249, line: 113, type: !180)
!346 = !DILocalVariable(name: "self", scope: !303, file: !249, line: 115, type: !311)
!347 = !DILocalVariable(name: "dict", scope: !303, file: !249, line: 119, type: !80)
!348 = !DILocalVariable(name: "arg_names", scope: !303, file: !249, line: 126, type: !82)
!349 = !DILocalVariable(name: "i", scope: !350, file: !249, line: 128, type: !129)
!350 = distinct !DILexicalBlock(scope: !303, file: !249, line: 128, column: 9)
!351 = !DILocalVariable(name: "wanted_arg_name", scope: !352, file: !249, line: 130, type: !80)
!352 = distinct !DILexicalBlock(scope: !353, file: !249, line: 128, column: 43)
!353 = distinct !DILexicalBlock(scope: !350, file: !249, line: 128, column: 9)
!354 = !DILocalVariable(name: "j", scope: !355, file: !249, line: 138, type: !129)
!355 = distinct !DILexicalBlock(scope: !352, file: !249, line: 138, column: 13)
!356 = !DILocation(line: 113, column: 52, scope: !303)
!357 = !DILocation(line: 113, column: 71, scope: !303)
!358 = !DILocation(line: 113, column: 86, scope: !303)
!359 = !DILocation(line: 113, column: 108, scope: !303)
!360 = !DILocation(line: 113, column: 121, scope: !303)
!361 = !DILocation(line: 113, column: 137, scope: !303)
!362 = !DILocation(line: 113, column: 156, scope: !303)
!363 = !DILocation(line: 113, column: 178, scope: !303)
!364 = !DILocation(line: 113, column: 201, scope: !303)
!365 = !DILocation(line: 113, column: 230, scope: !303)
!366 = !DILocation(line: 113, column: 248, scope: !303)
!367 = !DILocation(line: 115, column: 41, scope: !303)
!368 = !{!369, !262, i64 0}
!369 = !{!"_mp_code_state_t", !262, i64 0, !262, i64 8, !262, i64 16, !262, i64 24, !262, i64 32, !263, i64 40}
!370 = !DILocation(line: 115, column: 22, scope: !303)
!371 = !DILocation(line: 119, column: 18, scope: !303)
!372 = !DILocation(line: 120, column: 26, scope: !373)
!373 = distinct !DILexicalBlock(scope: !303, file: !249, line: 120, column: 13)
!374 = !DILocation(line: 120, column: 55, scope: !373)
!375 = !DILocation(line: 120, column: 13, scope: !303)
!376 = !DILocation(line: 121, column: 20, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !249, line: 120, column: 61)
!378 = !DILocation(line: 122, column: 30, scope: !377)
!379 = !DILocation(line: 123, column: 9, scope: !377)
!380 = !DILocation(line: 0, scope: !303)
!381 = !DILocation(line: 126, column: 60, scope: !303)
!382 = !DILocation(line: 126, column: 25, scope: !303)
!383 = !DILocation(line: 128, column: 21, scope: !350)
!384 = !DILocation(line: 128, column: 30, scope: !353)
!385 = !DILocation(line: 128, column: 9, scope: !350)
