; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/builtinevex.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/builtinevex.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!319 = !DIEnumerator(name: "MP_QSTR_get", value: 147)
!320 = !DIEnumerator(name: "MP_QSTR_getattr", value: 148)
!321 = !DIEnumerator(name: "MP_QSTR_getter", value: 149)
!322 = !DIEnumerator(name: "MP_QSTR_globals", value: 150)
!323 = !DIEnumerator(name: "MP_QSTR_hasattr", value: 151)
!324 = !DIEnumerator(name: "MP_QSTR_hash", value: 152)
!325 = !DIEnumerator(name: "MP_QSTR_heap_lock", value: 153)
!326 = !DIEnumerator(name: "MP_QSTR_heap_unlock", value: 154)
!327 = !DIEnumerator(name: "MP_QSTR_hex", value: 155)
!328 = !DIEnumerator(name: "MP_QSTR_id", value: 156)
!329 = !DIEnumerator(name: "MP_QSTR_index", value: 157)
!330 = !DIEnumerator(name: "MP_QSTR_insert", value: 158)
!331 = !DIEnumerator(name: "MP_QSTR_int", value: 159)
!332 = !DIEnumerator(name: "MP_QSTR_isalpha", value: 160)
!333 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!334 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!335 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!336 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!337 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!338 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!339 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!340 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!341 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!342 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!343 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!344 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!345 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!346 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!347 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!348 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!349 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!350 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!351 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!352 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!353 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!354 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!355 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!356 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!357 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!358 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!359 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!360 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!361 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!362 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!363 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!364 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!365 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!366 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!367 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!368 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!369 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!370 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!371 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!372 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!373 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!374 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!375 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!376 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!377 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!378 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!379 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!380 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!381 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!382 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!383 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!384 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!385 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!386 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!387 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!388 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!389 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!390 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!391 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!392 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!393 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!394 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!395 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!396 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!397 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!398 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!399 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!400 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!401 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!402 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!403 = !{!404, !406, !405, !528}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !6, line: 57, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !415)
!415 = !{!416, !417, !421, !422, !448, !472, !477, !483, !489, !496, !501, !515, !520, !545, !548, !549}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !414, file: !6, line: 476, baseType: !407, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !6, line: 479, baseType: !418, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !419, line: 31, baseType: !420)
!419 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!420 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !6, line: 482, baseType: !418, size: 16, offset: 80)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !414, file: !6, line: 485, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427, !404, !447}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !430, line: 53, baseType: !431)
!430 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !430, line: 50, size: 128, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !430, line: 51, baseType: !405, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !431, file: !430, line: 52, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !430, line: 48, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !405, !439, !442}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !443, line: 31, baseType: !444)
!443 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !445, line: 92, baseType: !446)
!445 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!446 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !414, file: !6, line: 488, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!404, !411, !442, !453, !455}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !457, file: !6, line: 366, baseType: !442, size: 1, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !457, file: !6, line: 367, baseType: !442, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !457, file: !6, line: 368, baseType: !442, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !457, file: !6, line: 369, baseType: !442, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !457, file: !6, line: 371, baseType: !442, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !457, file: !6, line: 372, baseType: !442, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !457, file: !6, line: 373, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !468, file: !6, line: 351, baseType: !404, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !468, file: !6, line: 352, baseType: !404, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !414, file: !6, line: 491, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!404, !404, !442, !442, !453}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !414, file: !6, line: 495, baseType: !478, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!404, !482, !404}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !414, file: !6, line: 496, baseType: !484, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!404, !488, !404, !404}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !414, file: !6, line: 509, baseType: !490, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !404, !494, !495}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !170, line: 48, baseType: !442)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !414, file: !6, line: 516, baseType: !497, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!404, !404, !404, !404}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !414, file: !6, line: 521, baseType: !502, size: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!404, !404, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !6, line: 433, baseType: !407, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !508, file: !6, line: 434, baseType: !512, size: 192, offset: 64)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 192, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !414, file: !6, line: 525, baseType: !516, size: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!404, !404}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !414, file: !6, line: 528, baseType: !521, size: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !522, file: !6, line: 469, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !404, !534, !542}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !529, line: 70, baseType: !530)
!529 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !531, line: 32, baseType: !532)
!531 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !445, line: 49, baseType: !533)
!533 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !536, file: !6, line: 457, baseType: !405, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !536, file: !6, line: 458, baseType: !442, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !536, file: !6, line: 459, baseType: !541, size: 32, offset: 128)
!541 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !529, line: 71, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !544, line: 30, baseType: !446)
!544 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !414, file: !6, line: 531, baseType: !546, size: 64, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !414, file: !6, line: 537, baseType: !546, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !414, file: !6, line: 540, baseType: !550, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !551, file: !6, line: 776, baseType: !407, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !551, file: !6, line: 777, baseType: !456, size: 192, offset: 64)
!555 = !{!0, !556}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "mp_builtin_exec_obj", scope: !2, file: !3, line: 159, type: !558, isLocal: false, isDefinition: true)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !561)
!561 = !{!562, !563, !565, !566, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !560, file: !6, line: 806, baseType: !407, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !560, file: !6, line: 807, baseType: !564, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!564 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !560, file: !6, line: 808, baseType: !542, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !560, file: !6, line: 809, baseType: !542, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !560, file: !6, line: 813, baseType: !568, size: 64, offset: 128)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !6, line: 810, size: 64, elements: !569)
!569 = !{!570, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !568, file: !6, line: 811, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!404, !442, !453}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !568, file: !6, line: 812, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!404, !442, !453, !455}
!580 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!581 = !{i32 2, !"Dwarf Version", i32 4}
!582 = !{i32 2, !"Debug Info Version", i32 3}
!583 = !{i32 1, !"wchar_size", i32 4}
!584 = !{i32 7, !"PIC Level", i32 2}
!585 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!586 = distinct !DISubprogram(name: "mp_builtin_eval", scope: !3, file: !3, line: 151, type: !573, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !587)
!587 = !{!588, !589}
!588 = !DILocalVariable(name: "n_args", arg: 1, scope: !586, file: !3, line: 151, type: !442)
!589 = !DILocalVariable(name: "args", arg: 2, scope: !586, file: !3, line: 151, type: !453)
!590 = !DILocation(line: 151, column: 40, scope: !586)
!591 = !DILocation(line: 151, column: 64, scope: !586)
!592 = !DILocation(line: 152, column: 12, scope: !586)
!593 = !DILocation(line: 152, column: 5, scope: !586)
!594 = distinct !DISubprogram(name: "mp_builtin_exec", scope: !3, file: !3, line: 156, type: !573, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !595)
!595 = !{!596, !597}
!596 = !DILocalVariable(name: "n_args", arg: 1, scope: !594, file: !3, line: 156, type: !442)
!597 = !DILocalVariable(name: "args", arg: 2, scope: !594, file: !3, line: 156, type: !453)
!598 = !DILocation(line: 156, column: 40, scope: !594)
!599 = !DILocation(line: 156, column: 64, scope: !594)
!600 = !DILocation(line: 157, column: 12, scope: !594)
!601 = !DILocation(line: 157, column: 5, scope: !594)
!602 = distinct !DISubprogram(name: "eval_exec_helper", scope: !3, file: !3, line: 113, type: !603, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !606)
!603 = !DISubroutineType(types: !604)
!604 = !{!404, !442, !453, !605}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !70, line: 95, baseType: !69)
!606 = !{!607, !608, !609, !610, !613, !614, !616, !617, !618}
!607 = !DILocalVariable(name: "n_args", arg: 1, scope: !602, file: !3, line: 113, type: !442)
!608 = !DILocalVariable(name: "args", arg: 2, scope: !602, file: !3, line: 113, type: !453)
!609 = !DILocalVariable(name: "parse_input_kind", arg: 3, scope: !602, file: !3, line: 113, type: !605)
!610 = !DILocalVariable(name: "globals", scope: !602, file: !3, line: 115, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !551)
!613 = !DILocalVariable(name: "locals", scope: !602, file: !3, line: 116, type: !611)
!614 = !DILocalVariable(name: "i", scope: !615, file: !3, line: 117, type: !442)
!615 = distinct !DILexicalBlock(scope: !602, file: !3, line: 117, column: 5)
!616 = !DILocalVariable(name: "str_len", scope: !602, file: !3, line: 135, type: !442)
!617 = !DILocalVariable(name: "str", scope: !602, file: !3, line: 136, type: !439)
!618 = !DILocalVariable(name: "lex", scope: !602, file: !3, line: 140, type: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !76, line: 168, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !76, line: 148, size: 1280, elements: !622)
!622 = !{!623, !624, !638, !643, !644, !645, !646, !647, !648, !649, !650, !651, !653, !654, !655, !657}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !621, file: !76, line: 149, baseType: !494, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !621, file: !76, line: 150, baseType: !625, size: 192, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !626, line: 40, baseType: !627)
!626 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !626, line: 36, size: 192, elements: !628)
!628 = !{!629, !630, !634}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !627, file: !626, line: 37, baseType: !405, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !627, file: !626, line: 38, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!542, !405}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !627, file: !626, line: 39, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !405}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !621, file: !76, line: 152, baseType: !639, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !640, line: 131, baseType: !641)
!640 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !640, line: 40, baseType: !642)
!642 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !621, file: !76, line: 152, baseType: !639, size: 32, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !621, file: !76, line: 152, baseType: !639, size: 32, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !621, file: !76, line: 154, baseType: !442, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !621, file: !76, line: 155, baseType: !442, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !621, file: !76, line: 157, baseType: !528, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !621, file: !76, line: 158, baseType: !528, size: 64, offset: 576)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !621, file: !76, line: 160, baseType: !442, size: 64, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !621, file: !76, line: 161, baseType: !442, size: 64, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !621, file: !76, line: 162, baseType: !652, size: 64, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !621, file: !76, line: 164, baseType: !442, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !621, file: !76, line: 165, baseType: !442, size: 64, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !621, file: !76, line: 166, baseType: !656, size: 32, offset: 960)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !76, line: 144, baseType: !75)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !621, file: !76, line: 167, baseType: !658, size: 256, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !640, line: 165, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !640, line: 160, size: 256, elements: !660)
!660 = !{!661, !662, !663, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !659, file: !640, line: 161, baseType: !442, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !659, file: !640, line: 162, baseType: !442, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !659, file: !640, line: 163, baseType: !664, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !659, file: !640, line: 164, baseType: !564, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!666 = !DILocation(line: 113, column: 41, scope: !602)
!667 = !DILocation(line: 113, column: 65, scope: !602)
!668 = !DILocation(line: 113, column: 93, scope: !602)
!669 = !DILocation(line: 115, column: 30, scope: !602)
!670 = !DILocation(line: 115, column: 20, scope: !602)
!671 = !DILocation(line: 116, column: 29, scope: !602)
!672 = !DILocation(line: 116, column: 20, scope: !602)
!673 = !DILocation(line: 117, column: 17, scope: !615)
!674 = !DILocation(line: 117, column: 35, scope: !675)
!675 = distinct !DILexicalBlock(scope: !615, file: !3, line: 117, column: 5)
!676 = !DILocation(line: 117, column: 30, scope: !675)
!677 = !DILocation(line: 0, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 118, column: 39)
!679 = distinct !DILexicalBlock(scope: !680, file: !3, line: 118, column: 13)
!680 = distinct !DILexicalBlock(scope: !675, file: !3, line: 117, column: 50)
!681 = !DILocation(line: 0, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !3, line: 123, column: 25)
!683 = distinct !DILexicalBlock(scope: !678, file: !3, line: 123, column: 17)
!684 = !DILocation(line: 135, column: 5, scope: !602)
!685 = !DILocation(line: 136, column: 43, scope: !602)
!686 = !{!687, !687, i64 0}
!687 = !{!"any pointer", !688, i64 0}
!688 = !{!"omnipotent char", !689, i64 0}
!689 = !{!"Simple C/C++ TBAA"}
!690 = !DILocation(line: 135, column: 12, scope: !602)
!691 = !DILocation(line: 136, column: 23, scope: !602)
!692 = !DILocation(line: 136, column: 17, scope: !602)
!693 = !DILocation(line: 145, column: 70, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 144, column: 12)
!695 = distinct !DILexicalBlock(scope: !602, file: !3, line: 141, column: 9)
!696 = !{!697, !697, i64 0}
!697 = !{!"long", !688, i64 0}
!698 = !DILocation(line: 145, column: 15, scope: !694)
!699 = !DILocation(line: 140, column: 17, scope: !602)
!700 = !DILocation(line: 148, column: 12, scope: !602)
!701 = !DILocation(line: 149, column: 1, scope: !602)
!702 = !DILocation(line: 148, column: 5, scope: !602)
!703 = !DILocation(line: 118, column: 13, scope: !679)
!704 = !DILocation(line: 118, column: 21, scope: !679)
!705 = !DILocation(line: 118, column: 13, scope: !680)
!706 = !DILocation(line: 119, column: 18, scope: !707)
!707 = distinct !DILexicalBlock(scope: !678, file: !3, line: 119, column: 17)
!708 = !{!709, !687, i64 0}
!709 = !{!"_mp_obj_base_t", !687, i64 0}
!710 = !DILocation(line: 119, column: 17, scope: !678)
!711 = !DILocation(line: 120, column: 17, scope: !712)
!712 = distinct !DILexicalBlock(scope: !707, file: !3, line: 119, column: 58)
!713 = !DILocation(line: 122, column: 22, scope: !678)
!714 = !DILocation(line: 123, column: 19, scope: !683)
!715 = !DILocation(line: 123, column: 17, scope: !678)
!716 = !DILocation(line: 0, scope: !602)
!717 = !DILocation(line: 117, column: 45, scope: !675)
!718 = !DILocation(line: 117, column: 26, scope: !675)
!719 = distinct !{!719, !720, !721}
!720 = !DILocation(line: 117, column: 5, scope: !615)
!721 = !DILocation(line: 127, column: 5, scope: !615)
!722 = distinct !DISubprogram(name: "mp_globals_get", scope: !723, file: !723, line: 89, type: !724, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !726)
!723 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!724 = !DISubroutineType(types: !725)
!725 = !{!611}
!726 = !{}
!727 = !DILocation(line: 89, column: 60, scope: !722)
!728 = !{!729, !687, i64 16}
!729 = !{!"_mp_state_ctx_t", !730, i64 0, !731, i64 32, !736, i64 336}
!730 = !{!"_mp_state_thread_t", !687, i64 0, !687, i64 8, !687, i64 16, !687, i64 24}
