; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/builtinimport.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/builtinimport.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!388 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_EQUAL", value: 64, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_TOKEN_OP_NOT_EQUAL", value: 65, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_OPEN", value: 66, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_CLOSE", value: 67, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_OPEN", value: 68, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_CLOSE", value: 69, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_OPEN", value: 70, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_CLOSE", value: 71, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_TOKEN_DEL_COMMA", value: 72, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_TOKEN_DEL_COLON", value: 73, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_TOKEN_DEL_PERIOD", value: 74, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_TOKEN_DEL_SEMICOLON", value: 75, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_TOKEN_DEL_AT", value: 76, isUnsigned: true)
!401 = !DIEnumerator(name: "MP_TOKEN_DEL_EQUAL", value: 77, isUnsigned: true)
!402 = !DIEnumerator(name: "MP_TOKEN_DEL_PLUS_EQUAL", value: 78, isUnsigned: true)
!403 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_EQUAL", value: 79, isUnsigned: true)
!404 = !DIEnumerator(name: "MP_TOKEN_DEL_STAR_EQUAL", value: 80, isUnsigned: true)
!405 = !DIEnumerator(name: "MP_TOKEN_DEL_SLASH_EQUAL", value: 81, isUnsigned: true)
!406 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_SLASH_EQUAL", value: 82, isUnsigned: true)
!407 = !DIEnumerator(name: "MP_TOKEN_DEL_PERCENT_EQUAL", value: 83, isUnsigned: true)
!408 = !DIEnumerator(name: "MP_TOKEN_DEL_AMPERSAND_EQUAL", value: 84, isUnsigned: true)
!409 = !DIEnumerator(name: "MP_TOKEN_DEL_PIPE_EQUAL", value: 85, isUnsigned: true)
!410 = !DIEnumerator(name: "MP_TOKEN_DEL_CARET_EQUAL", value: 86, isUnsigned: true)
!411 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_MORE_EQUAL", value: 87, isUnsigned: true)
!412 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88, isUnsigned: true)
!413 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89, isUnsigned: true)
!414 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90, isUnsigned: true)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !416, line: 91, baseType: !7, size: 32, elements: !417)
!416 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/parse.h", directory: "")
!417 = !{!418, !419, !420}
!418 = !DIEnumerator(name: "MP_PARSE_SINGLE_INPUT", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "MP_PARSE_FILE_INPUT", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "MP_PARSE_EVAL_INPUT", value: 2, isUnsigned: true)
!421 = !{!422, !423, !424, !431, !435}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !241, line: 46, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !425, line: 69, baseType: !426)
!425 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !427, line: 32, baseType: !428)
!427 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !429, line: 49, baseType: !430)
!429 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!430 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !425, line: 70, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !433, line: 30, baseType: !434)
!433 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!434 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !436, line: 31, baseType: !437)
!436 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !429, line: 92, baseType: !434)
!438 = !{!0}
!439 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/builtinimport.c", directory: "")
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !241, line: 814, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !241, line: 805, size: 192, elements: !443)
!443 = !{!444, !579, !581, !582, !583}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !241, line: 806, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !241, line: 59, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !241, line: 56, size: 64, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !241, line: 57, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !241, line: 52, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !241, line: 474, size: 960, elements: !453)
!453 = !{!454, !455, !459, !460, !481, !505, !510, !516, !522, !529, !534, !548, !553, !569, !572, !573}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !452, file: !241, line: 476, baseType: !445, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !452, file: !241, line: 479, baseType: !456, size: 16, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!458 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !241, line: 482, baseType: !456, size: 16, offset: 80)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !452, file: !241, line: 485, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !241, line: 441, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465, !422, !480}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !468, line: 53, baseType: !469)
!468 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !468, line: 50, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !468, line: 51, baseType: !423, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !469, file: !468, line: 52, baseType: !473, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !468, line: 48, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !423, !477, !435}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !241, line: 430, baseType: !253)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !452, file: !241, line: 488, baseType: !482, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !241, line: 442, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!422, !449, !435, !486, !488}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !241, line: 374, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !241, line: 365, size: 192, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !490, file: !241, line: 366, baseType: !435, size: 1, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !490, file: !241, line: 367, baseType: !435, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !490, file: !241, line: 368, baseType: !435, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !490, file: !241, line: 369, baseType: !435, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !490, file: !241, line: 371, baseType: !435, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !490, file: !241, line: 372, baseType: !435, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !490, file: !241, line: 373, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !241, line: 353, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !241, line: 350, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !501, file: !241, line: 351, baseType: !422, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !241, line: 352, baseType: !422, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !452, file: !241, line: 491, baseType: !506, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !241, line: 443, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!422, !422, !435, !435, !486}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !452, file: !241, line: 495, baseType: !511, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !241, line: 444, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!422, !515, !422}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !262, line: 65, baseType: !261)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !452, file: !241, line: 496, baseType: !517, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !241, line: 445, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!422, !521, !422, !422}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !262, line: 145, baseType: !275)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !452, file: !241, line: 509, baseType: !523, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !241, line: 446, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !422, !527, !528}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !6, line: 48, baseType: !435)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !452, file: !241, line: 516, baseType: !530, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !241, line: 447, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!422, !422, !422, !422}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !452, file: !241, line: 521, baseType: !535, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !241, line: 448, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!422, !422, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !241, line: 435, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !241, line: 432, size: 256, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !541, file: !241, line: 433, baseType: !445, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !541, file: !241, line: 434, baseType: !545, size: 192, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 192, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 3)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !452, file: !241, line: 525, baseType: !549, size: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !241, line: 415, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!422, !422}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !452, file: !241, line: 528, baseType: !554, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !241, line: 470, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !241, line: 468, size: 64, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !555, file: !241, line: 469, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!424, !422, !561, !431}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !241, line: 464, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !241, line: 451, size: 192, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !563, file: !241, line: 457, baseType: !423, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !563, file: !241, line: 458, baseType: !435, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !563, file: !241, line: 459, baseType: !568, size: 32, offset: 128)
!568 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !452, file: !241, line: 531, baseType: !570, size: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !452, file: !241, line: 537, baseType: !570, size: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !452, file: !241, line: 540, baseType: !574, size: 64, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !241, line: 775, size: 256, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !575, file: !241, line: 776, baseType: !445, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !575, file: !241, line: 777, baseType: !489, size: 192, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !442, file: !241, line: 807, baseType: !580, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!580 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !442, file: !241, line: 808, baseType: !431, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !442, file: !241, line: 809, baseType: !431, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !442, file: !241, line: 813, baseType: !584, size: 64, offset: 128)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !442, file: !241, line: 810, size: 64, elements: !585)
!585 = !{!586, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !584, file: !241, line: 811, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !241, line: 418, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!422, !435, !486}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !584, file: !241, line: 812, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !241, line: 421, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!422, !435, !486, !488}
!596 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!597 = !{i32 2, !"Dwarf Version", i32 4}
!598 = !{i32 2, !"Debug Info Version", i32 3}
!599 = !{i32 1, !"wchar_size", i32 4}
!600 = !{i32 7, !"PIC Level", i32 2}
!601 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!602 = distinct !DISubprogram(name: "mp_obj_is_package", scope: !439, file: !439, line: 55, type: !603, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!580, !422}
!605 = !{!606, !607}
!606 = !DILocalVariable(name: "module", arg: 1, scope: !602, file: !439, line: 55, type: !422)
!607 = !DILocalVariable(name: "dest", scope: !602, file: !439, line: 56, type: !608)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 128, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 2)
!611 = !DILocation(line: 55, column: 33, scope: !602)
!612 = !DILocation(line: 56, column: 5, scope: !602)
!613 = !DILocation(line: 56, column: 14, scope: !602)
!614 = !DILocation(line: 57, column: 52, scope: !602)
!615 = !DILocation(line: 57, column: 5, scope: !602)
!616 = !DILocation(line: 58, column: 12, scope: !602)
!617 = !{!618, !618, i64 0}
!618 = !{!"any pointer", !619, i64 0}
!619 = !{!"omnipotent char", !620, i64 0}
!620 = !{!"Simple C/C++ TBAA"}
!621 = !DILocation(line: 58, column: 20, scope: !602)
!622 = !DILocation(line: 59, column: 1, scope: !602)
!623 = !DILocation(line: 58, column: 5, scope: !602)
!624 = distinct !DISubprogram(name: "mp_builtin___import__", scope: !439, file: !439, line: 266, type: !589, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !636, !637, !638, !639, !640, !641, !642, !645, !647, !648, !649, !650, !653, !654, !655, !663, !667, !668, !669, !670, !676, !678, !691, !694}
!626 = !DILocalVariable(name: "n_args", arg: 1, scope: !624, file: !439, line: 266, type: !435)
!627 = !DILocalVariable(name: "args", arg: 2, scope: !624, file: !439, line: 266, type: !486)
!628 = !DILocalVariable(name: "module_name", scope: !624, file: !439, line: 276, type: !422)
!629 = !DILocalVariable(name: "fromtuple", scope: !624, file: !439, line: 277, type: !422)
!630 = !DILocalVariable(name: "level", scope: !624, file: !439, line: 278, type: !424)
!631 = !DILocalVariable(name: "mod_len", scope: !624, file: !439, line: 289, type: !435)
!632 = !DILocalVariable(name: "mod_str", scope: !624, file: !439, line: 290, type: !477)
!633 = !DILocalVariable(name: "this_name_q", scope: !634, file: !439, line: 301, type: !422)
!634 = distinct !DILexicalBlock(scope: !635, file: !439, line: 292, column: 21)
!635 = distinct !DILexicalBlock(scope: !624, file: !439, line: 292, column: 9)
!636 = !DILocalVariable(name: "globals_map", scope: !634, file: !439, line: 309, type: !488)
!637 = !DILocalVariable(name: "elem", scope: !634, file: !439, line: 310, type: !499)
!638 = !DILocalVariable(name: "is_pkg", scope: !634, file: !439, line: 311, type: !580)
!639 = !DILocalVariable(name: "this_name_l", scope: !634, file: !439, line: 320, type: !435)
!640 = !DILocalVariable(name: "this_name", scope: !634, file: !439, line: 321, type: !477)
!641 = !DILocalVariable(name: "p", scope: !634, file: !439, line: 323, type: !477)
!642 = !DILocalVariable(name: "new_mod_l", scope: !634, file: !439, line: 339, type: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !644, line: 40, baseType: !7)
!644 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!645 = !DILocalVariable(name: "new_mod", scope: !634, file: !439, line: 340, type: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!647 = !DILocalVariable(name: "new_mod_q", scope: !634, file: !439, line: 347, type: !527)
!648 = !DILocalVariable(name: "module_name_qstr", scope: !624, file: !439, line: 356, type: !527)
!649 = !DILocalVariable(name: "module_obj", scope: !624, file: !439, line: 357, type: !422)
!650 = !DILocalVariable(name: "p", scope: !651, file: !439, line: 361, type: !646)
!651 = distinct !DILexicalBlock(scope: !652, file: !439, line: 358, column: 36)
!652 = distinct !DILexicalBlock(scope: !624, file: !439, line: 358, column: 9)
!653 = !DILocalVariable(name: "pkg_name", scope: !651, file: !439, line: 370, type: !527)
!654 = !DILocalVariable(name: "last", scope: !624, file: !439, line: 375, type: !643)
!655 = !DILocalVariable(name: "path", scope: !624, file: !439, line: 376, type: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !644, line: 165, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !644, line: 160, size: 256, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !657, file: !644, line: 161, baseType: !435, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !657, file: !644, line: 162, baseType: !435, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !657, file: !644, line: 163, baseType: !646, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !657, file: !644, line: 164, baseType: !580, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!663 = !DILocalVariable(name: "path_buf", scope: !624, file: !439, line: 376, type: !664)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 2048, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 256)
!667 = !DILocalVariable(name: "top_module_obj", scope: !624, file: !439, line: 378, type: !422)
!668 = !DILocalVariable(name: "outer_module_obj", scope: !624, file: !439, line: 379, type: !422)
!669 = !DILocalVariable(name: "i", scope: !624, file: !439, line: 380, type: !643)
!670 = !DILocalVariable(name: "mod_name", scope: !671, file: !439, line: 384, type: !527)
!671 = distinct !DILexicalBlock(scope: !672, file: !439, line: 382, column: 48)
!672 = distinct !DILexicalBlock(scope: !673, file: !439, line: 382, column: 13)
!673 = distinct !DILexicalBlock(scope: !674, file: !439, line: 381, column: 36)
!674 = distinct !DILexicalBlock(scope: !675, file: !439, line: 381, column: 5)
!675 = distinct !DILexicalBlock(scope: !624, file: !439, line: 381, column: 5)
!676 = !DILocalVariable(name: "stat", scope: !671, file: !439, line: 389, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_import_stat_t", file: !248, line: 186, baseType: !247)
!678 = !DILocalVariable(name: "o", scope: !679, file: !439, line: 445, type: !683)
!679 = distinct !DILexicalBlock(scope: !680, file: !439, line: 444, column: 96)
!680 = distinct !DILexicalBlock(scope: !681, file: !439, line: 444, column: 21)
!681 = distinct !DILexicalBlock(scope: !682, file: !439, line: 431, column: 44)
!682 = distinct !DILexicalBlock(scope: !671, file: !439, line: 431, column: 17)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !241, line: 831, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !241, line: 828, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !685, file: !241, line: 829, baseType: !445, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !685, file: !241, line: 830, baseType: !689, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !241, line: 778, baseType: !575)
!691 = !DILocalVariable(name: "orig_path_len", scope: !692, file: !439, line: 460, type: !435)
!692 = distinct !DILexicalBlock(scope: !693, file: !439, line: 455, column: 49)
!693 = distinct !DILexicalBlock(scope: !681, file: !439, line: 455, column: 21)
!694 = !DILocalVariable(name: "s", scope: !695, file: !439, line: 482, type: !527)
!695 = distinct !DILexicalBlock(scope: !696, file: !439, line: 481, column: 50)
!696 = distinct !DILexicalBlock(scope: !671, file: !439, line: 481, column: 17)
!697 = !DILocation(line: 266, column: 39, scope: !624)
!698 = !DILocation(line: 266, column: 63, scope: !624)
!699 = !DILocation(line: 276, column: 28, scope: !624)
!700 = !DILocation(line: 276, column: 14, scope: !624)
!701 = !DILocation(line: 277, column: 14, scope: !624)
!702 = !DILocation(line: 278, column: 14, scope: !624)
!703 = !DILocation(line: 279, column: 16, scope: !704)
!704 = distinct !DILexicalBlock(scope: !624, file: !439, line: 279, column: 9)
!705 = !DILocation(line: 279, column: 9, scope: !624)
!706 = !DILocation(line: 280, column: 21, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !439, line: 279, column: 22)
!708 = !DILocation(line: 281, column: 20, scope: !709)
!709 = distinct !DILexicalBlock(scope: !707, file: !439, line: 281, column: 13)
!710 = !DILocation(line: 281, column: 13, scope: !707)
!711 = !DILocation(line: 282, column: 21, scope: !712)
!712 = distinct !DILexicalBlock(scope: !709, file: !439, line: 281, column: 26)
!713 = !DILocation(line: 283, column: 23, scope: !714)
!714 = distinct !DILexicalBlock(scope: !712, file: !439, line: 283, column: 17)
!715 = !DILocation(line: 283, column: 17, scope: !712)
!716 = !DILocation(line: 284, column: 17, scope: !717)
!717 = distinct !DILexicalBlock(scope: !714, file: !439, line: 283, column: 28)
!718 = !DILocation(line: 0, scope: !624)
!719 = !DILocation(line: 289, column: 5, scope: !624)
!720 = !DILocation(line: 289, column: 12, scope: !624)
!721 = !DILocation(line: 290, column: 27, scope: !624)
!722 = !DILocation(line: 290, column: 17, scope: !624)
!723 = !DILocation(line: 292, column: 15, scope: !635)
!724 = !DILocation(line: 292, column: 9, scope: !624)
!725 = !DILocation(line: 301, column: 48, scope: !634)
!726 = !DILocation(line: 301, column: 32, scope: !634)
!727 = !DILocation(line: 301, column: 18, scope: !634)
!728 = !DILocation(line: 309, column: 34, scope: !634)
!729 = !DILocation(line: 309, column: 52, scope: !634)
!730 = !DILocation(line: 309, column: 19, scope: !634)
!731 = !DILocation(line: 310, column: 31, scope: !634)
!732 = !DILocation(line: 310, column: 24, scope: !634)
!733 = !DILocation(line: 311, column: 29, scope: !634)
!734 = !DILocation(line: 320, column: 9, scope: !634)
!735 = !DILocation(line: 320, column: 16, scope: !634)
!736 = !DILocation(line: 321, column: 33, scope: !634)
!737 = !DILocation(line: 321, column: 21, scope: !634)
!738 = !DILocation(line: 323, column: 9, scope: !634)
!739 = !DILocation(line: 323, column: 37, scope: !634)
!740 = !{!741, !741, i64 0}
!741 = !{!"long", !619, i64 0}
!742 = !DILocation(line: 323, column: 35, scope: !634)
!743 = !DILocation(line: 323, column: 21, scope: !634)
!744 = !DILocation(line: 324, column: 13, scope: !634)
!745 = !DILocation(line: 327, column: 13, scope: !746)
!746 = distinct !DILexicalBlock(scope: !747, file: !439, line: 324, column: 22)
!747 = distinct !DILexicalBlock(scope: !634, file: !439, line: 324, column: 13)
!748 = !DILocation(line: 328, column: 9, scope: !746)
!749 = !DILocation(line: 0, scope: !634)
!750 = !DILocation(line: 330, column: 9, scope: !634)
!751 = !DILocation(line: 331, column: 13, scope: !752)
!752 = distinct !DILexicalBlock(scope: !634, file: !439, line: 330, column: 25)
!753 = distinct !{!753, !750, !754}
!754 = !DILocation(line: 332, column: 9, scope: !634)
!755 = !DILocation(line: 335, column: 13, scope: !756)
!756 = distinct !DILexicalBlock(scope: !634, file: !439, line: 335, column: 13)
!757 = !DILocation(line: 335, column: 15, scope: !756)
!758 = !DILocation(line: 335, column: 13, scope: !634)
!759 = !DILocation(line: 336, column: 33, scope: !760)
!760 = distinct !DILexicalBlock(scope: !756, file: !439, line: 335, column: 29)
!761 = !DILocation(line: 336, column: 13, scope: !760)
!762 = !DILocation(line: 339, column: 27, scope: !634)
!763 = !DILocation(line: 339, column: 35, scope: !634)
!764 = !DILocation(line: 340, column: 25, scope: !634)
!765 = !DILocation(line: 339, column: 14, scope: !634)
!766 = !DILocation(line: 340, column: 15, scope: !634)
!767 = !DILocation(line: 341, column: 9, scope: !634)
!768 = !DILocation(line: 342, column: 13, scope: !769)
!769 = distinct !DILexicalBlock(scope: !634, file: !439, line: 342, column: 13)
!770 = !DILocation(line: 342, column: 21, scope: !769)
!771 = !DILocation(line: 342, column: 13, scope: !634)
!772 = !DILocation(line: 343, column: 13, scope: !773)
!773 = distinct !DILexicalBlock(scope: !769, file: !439, line: 342, column: 27)
!774 = !DILocation(line: 343, column: 36, scope: !773)
!775 = !{!619, !619, i64 0}
!776 = !DILocation(line: 344, column: 13, scope: !773)
!777 = !DILocation(line: 345, column: 9, scope: !773)
!778 = !DILocation(line: 347, column: 26, scope: !634)
!779 = !DILocation(line: 347, column: 14, scope: !634)
!780 = !DILocation(line: 350, column: 23, scope: !634)
!781 = !DILocation(line: 351, column: 19, scope: !634)
!782 = !DILocation(line: 352, column: 17, scope: !634)
!783 = !DILocation(line: 353, column: 5, scope: !635)
!784 = !DILocation(line: 353, column: 5, scope: !634)
!785 = !DILocation(line: 356, column: 29, scope: !624)
!786 = !DILocation(line: 356, column: 10, scope: !624)
!787 = !DILocation(line: 357, column: 27, scope: !624)
!788 = !DILocation(line: 357, column: 14, scope: !624)
!789 = !DILocation(line: 358, column: 20, scope: !652)
!790 = !DILocation(line: 358, column: 9, scope: !624)
!791 = !DILocation(line: 361, column: 19, scope: !651)
!792 = !DILocation(line: 361, column: 15, scope: !651)
!793 = !DILocation(line: 362, column: 15, scope: !794)
!794 = distinct !DILexicalBlock(scope: !651, file: !439, line: 362, column: 13)
!795 = !DILocation(line: 366, column: 23, scope: !796)
!796 = distinct !DILexicalBlock(scope: !651, file: !439, line: 366, column: 13)
!797 = !DILocation(line: 362, column: 13, scope: !651)
!798 = !DILocation(line: 370, column: 51, scope: !651)
!799 = !DILocation(line: 370, column: 25, scope: !651)
!800 = !DILocation(line: 370, column: 14, scope: !651)
!801 = !DILocation(line: 371, column: 16, scope: !651)
!802 = !DILocation(line: 375, column: 10, scope: !624)
!803 = !DILocation(line: 376, column: 5, scope: !624)
!804 = !DILocation(line: 378, column: 14, scope: !624)
!805 = !DILocation(line: 379, column: 14, scope: !624)
!806 = !DILocation(line: 380, column: 10, scope: !624)
!807 = !DILocation(line: 381, column: 22, scope: !674)
!808 = !DILocation(line: 381, column: 19, scope: !674)
!809 = !DILocation(line: 381, column: 5, scope: !675)
!810 = !DILocation(line: 0, scope: !680)
!811 = !DILocation(line: 0, scope: !692)
!812 = !DILocation(line: 382, column: 15, scope: !672)
!813 = !DILocation(line: 382, column: 26, scope: !672)
!814 = !DILocation(line: 382, column: 29, scope: !672)
!815 = !DILocation(line: 382, column: 40, scope: !672)
!816 = !DILocation(line: 382, column: 13, scope: !673)
!817 = !DILocation(line: 384, column: 29, scope: !671)
!818 = !DILocation(line: 384, column: 18, scope: !671)
!819 = !DILocation(line: 390, column: 17, scope: !820)
!820 = distinct !DILexicalBlock(scope: !671, file: !439, line: 390, column: 17)
!821 = !DILocation(line: 390, column: 33, scope: !820)
!822 = !DILocation(line: 390, column: 17, scope: !671)
!823 = !DILocation(line: 393, column: 24, scope: !824)
!824 = distinct !DILexicalBlock(scope: !820, file: !439, line: 390, column: 39)
!825 = !DILocation(line: 389, column: 30, scope: !671)
!826 = !DILocation(line: 394, column: 13, scope: !824)
!827 = !DILocation(line: 396, column: 17, scope: !828)
!828 = distinct !DILexicalBlock(scope: !820, file: !439, line: 394, column: 20)
!829 = !DILocation(line: 397, column: 46, scope: !828)
!830 = !DILocation(line: 397, column: 56, scope: !828)
!831 = !DILocation(line: 397, column: 54, scope: !828)
!832 = !DILocation(line: 397, column: 17, scope: !828)
!833 = !DILocation(line: 398, column: 24, scope: !828)
!834 = !DILocation(line: 0, scope: !820)
!835 = !DILocation(line: 402, column: 22, scope: !836)
!836 = distinct !DILexicalBlock(scope: !671, file: !439, line: 402, column: 17)
!837 = !DILocation(line: 402, column: 17, scope: !671)
!838 = !DILocation(line: 420, column: 46, scope: !839)
!839 = distinct !DILexicalBlock(scope: !840, file: !439, line: 419, column: 83)
!840 = distinct !DILexicalBlock(scope: !841, file: !439, line: 419, column: 25)
!841 = distinct !DILexicalBlock(scope: !842, file: !439, line: 416, column: 17)
!842 = distinct !DILexicalBlock(scope: !836, file: !439, line: 402, column: 50)
!843 = !DILocation(line: 420, column: 25, scope: !839)
!844 = !DILocation(line: 428, column: 30, scope: !845)
!845 = distinct !DILexicalBlock(scope: !836, file: !439, line: 426, column: 20)
!846 = !DILocation(line: 431, column: 28, scope: !682)
!847 = !DILocation(line: 431, column: 17, scope: !671)
!848 = !DILocation(line: 434, column: 30, scope: !681)
!849 = !DILocation(line: 444, column: 26, scope: !680)
!850 = !DILocation(line: 444, column: 23, scope: !680)
!851 = !DILocation(line: 444, column: 34, scope: !680)
!852 = !DILocation(line: 444, column: 73, scope: !680)
!853 = !DILocation(line: 445, column: 38, scope: !679)
!854 = !DILocation(line: 446, column: 39, scope: !679)
!855 = !{!856, !618, i64 8}
!856 = !{!"_mp_obj_module_t", !857, i64 0, !618, i64 8}
!857 = !{!"_mp_obj_base_t", !618, i64 0}
!858 = !DILocation(line: 446, column: 21, scope: !679)
!859 = !DILocation(line: 455, column: 21, scope: !681)
!860 = !DILocation(line: 455, column: 26, scope: !693)
!861 = !DILocation(line: 459, column: 80, scope: !692)
!862 = !DILocation(line: 459, column: 97, scope: !692)
!863 = !DILocation(line: 459, column: 65, scope: !692)
!864 = !DILocation(line: 459, column: 21, scope: !692)
!865 = !DILocation(line: 460, column: 49, scope: !692)
!866 = !{!867, !741, i64 8}
!867 = !{!"_vstr_t", !741, i64 0, !741, i64 8, !618, i64 16, !868, i64 24}
!868 = !{!"_Bool", !619, i64 0}
!869 = !DILocation(line: 460, column: 28, scope: !692)
!870 = !DILocation(line: 461, column: 21, scope: !692)
!871 = !DILocation(line: 462, column: 21, scope: !692)
!872 = !DILocation(line: 463, column: 25, scope: !873)
!873 = distinct !DILexicalBlock(scope: !692, file: !439, line: 463, column: 25)
!874 = !DILocation(line: 463, column: 52, scope: !873)
!875 = !DILocation(line: 463, column: 25, scope: !692)
!876 = !DILocation(line: 466, column: 25, scope: !877)
!877 = distinct !DILexicalBlock(scope: !873, file: !439, line: 465, column: 28)
!878 = !DILocation(line: 468, column: 30, scope: !692)
!879 = !DILocation(line: 469, column: 17, scope: !692)
!880 = !DILocation(line: 470, column: 21, scope: !881)
!881 = distinct !DILexicalBlock(scope: !693, file: !439, line: 469, column: 24)
!882 = !DILocation(line: 479, column: 17, scope: !681)
!883 = !DILocation(line: 480, column: 13, scope: !681)
!884 = !DILocation(line: 0, scope: !671)
!885 = !DILocation(line: 481, column: 34, scope: !696)
!886 = !DILocation(line: 481, column: 17, scope: !671)
!887 = !DILocation(line: 482, column: 49, scope: !695)
!888 = !DILocation(line: 482, column: 59, scope: !695)
!889 = !DILocation(line: 482, column: 57, scope: !695)
!890 = !DILocation(line: 482, column: 26, scope: !695)
!891 = !DILocation(line: 482, column: 22, scope: !695)
!892 = !DILocation(line: 483, column: 17, scope: !695)
!893 = !DILocation(line: 487, column: 42, scope: !695)
!894 = !DILocation(line: 487, column: 21, scope: !695)
!895 = !DILocation(line: 486, column: 17, scope: !695)
!896 = !DILocation(line: 488, column: 13, scope: !695)
!897 = !DILocation(line: 490, column: 32, scope: !898)
!898 = distinct !DILexicalBlock(scope: !671, file: !439, line: 490, column: 17)
!899 = !DILocation(line: 490, column: 17, scope: !671)
!900 = !DILocation(line: 493, column: 22, scope: !671)
!901 = !DILocation(line: 494, column: 9, scope: !671)
!902 = !DILocation(line: 381, column: 32, scope: !674)
!903 = !DILocation(line: 381, column: 17, scope: !674)
!904 = distinct !{!904, !809, !905}
!905 = !DILocation(line: 495, column: 5, scope: !675)
!906 = !DILocation(line: 498, column: 19, scope: !907)
!907 = distinct !DILexicalBlock(scope: !624, file: !439, line: 498, column: 9)
!908 = !DILocation(line: 503, column: 1, scope: !624)
!909 = distinct !DISubprogram(name: "mp_globals_get", scope: !910, file: !910, line: 89, type: !911, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !913)
!910 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime.h", directory: "")
!911 = !DISubroutineType(types: !912)
!912 = !{!689}
!913 = !{}
!914 = !DILocation(line: 89, column: 60, scope: !909)
!915 = !{!916, !618, i64 16}
!916 = !{!"_mp_state_ctx_t", !917, i64 0, !918, i64 32, !923, i64 336}
!917 = !{!"_mp_state_thread_t", !618, i64 0, !618, i64 8, !618, i64 16, !618, i64 24}
!918 = !{!"_mp_state_vm_t", !618, i64 0, !919, i64 8, !919, i64 40, !920, i64 72, !618, i64 104, !920, i64 112, !922, i64 144, !922, i64 176, !619, i64 208, !618, i64 272, !741, i64 280, !741, i64 288, !741, i64 296}
!919 = !{!"_mp_obj_exception_t", !857, i64 0, !741, i64 8, !741, i64 12, !618, i64 16, !618, i64 24}
!920 = !{!"_mp_obj_dict_t", !857, i64 0, !921, i64 8}
!921 = !{!"_mp_map_t", !741, i64 0, !741, i64 0, !741, i64 0, !741, i64 0, !741, i64 0, !741, i64 8, !618, i64 16}
!922 = !{!"_mp_obj_list_t", !857, i64 0, !741, i64 8, !741, i64 16, !618, i64 24}
!923 = !{!"_mp_state_mem_t", !618, i64 0, !741, i64 8, !618, i64 16, !618, i64 24, !618, i64 32, !924, i64 40, !619, i64 48, !925, i64 560, !868, i64 562, !741, i64 568, !741, i64 576, !618, i64 584}
!924 = !{!"int", !619, i64 0}
!925 = !{!"short", !619, i64 0}
!926 = !DILocation(line: 89, column: 53, scope: !909)
!927 = distinct !DISubprogram(name: "chop_component", scope: !439, file: !439, line: 255, type: !928, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !931)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !477, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!931 = !{!932, !933, !934}
!932 = !DILocalVariable(name: "start", arg: 1, scope: !927, file: !439, line: 255, type: !477)
!933 = !DILocalVariable(name: "end", arg: 2, scope: !927, file: !439, line: 255, type: !930)
!934 = !DILocalVariable(name: "p", scope: !927, file: !439, line: 256, type: !477)
!935 = !DILocation(line: 255, column: 40, scope: !927)
!936 = !DILocation(line: 255, column: 60, scope: !927)
!937 = !DILocation(line: 256, column: 21, scope: !927)
!938 = !DILocation(line: 256, column: 17, scope: !927)
!939 = !DILocation(line: 257, column: 5, scope: !927)
!940 = !DILocation(line: 0, scope: !927)
!941 = !DILocation(line: 257, column: 14, scope: !927)
!942 = !DILocation(line: 258, column: 14, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !439, line: 258, column: 13)
!944 = distinct !DILexicalBlock(scope: !927, file: !439, line: 257, column: 23)
!945 = !DILocation(line: 258, column: 13, scope: !943)
!946 = !DILocation(line: 258, column: 18, scope: !943)
!947 = !DILocation(line: 258, column: 13, scope: !944)
!948 = distinct !{!948, !939, !949}
!949 = !DILocation(line: 262, column: 5, scope: !927)
!950 = !DILocation(line: 264, column: 1, scope: !927)
!951 = distinct !DISubprogram(name: "vstr_len", scope: !644, file: !644, line: 180, type: !952, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!952 = !DISubroutineType(types: !953)
!953 = !{!435, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!955 = !{!956}
!956 = !DILocalVariable(name: "vstr", arg: 1, scope: !951, file: !644, line: 180, type: !954)
!957 = !DILocation(line: 180, column: 39, scope: !951)
!958 = !DILocation(line: 180, column: 60, scope: !951)
!959 = !DILocation(line: 180, column: 47, scope: !951)
!960 = distinct !DISubprogram(name: "find_file", scope: !439, file: !439, line: 106, type: !961, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !963)
!961 = !DISubroutineType(types: !962)
!962 = !{!677, !477, !643, !954}
!963 = !{!964, !965, !966}
!964 = !DILocalVariable(name: "file_str", arg: 1, scope: !960, file: !439, line: 106, type: !477)
!965 = !DILocalVariable(name: "file_len", arg: 2, scope: !960, file: !439, line: 106, type: !643)
!966 = !DILocalVariable(name: "dest", arg: 3, scope: !960, file: !439, line: 106, type: !954)
!967 = !DILocation(line: 106, column: 47, scope: !960)
!968 = !DILocation(line: 106, column: 62, scope: !960)
!969 = !DILocation(line: 106, column: 80, scope: !960)
!970 = !DILocation(line: 116, column: 39, scope: !960)
!971 = !DILocation(line: 116, column: 9, scope: !960)
!972 = !DILocation(line: 117, column: 16, scope: !960)
!973 = !DILocation(line: 117, column: 9, scope: !960)
!974 = distinct !DISubprogram(name: "stat_dir_or_file", scope: !439, file: !439, line: 94, type: !975, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{!677, !954}
!977 = !{!978, !979}
!978 = !DILocalVariable(name: "path", arg: 1, scope: !974, file: !439, line: 94, type: !954)
!979 = !DILocalVariable(name: "stat", scope: !974, file: !439, line: 95, type: !677)
!980 = !DILocation(line: 94, column: 50, scope: !974)
!981 = !DILocation(line: 95, column: 48, scope: !974)
!982 = !DILocation(line: 95, column: 29, scope: !974)
!983 = !DILocation(line: 95, column: 22, scope: !974)
!984 = !DILocation(line: 97, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !974, file: !439, line: 97, column: 9)
!986 = !DILocation(line: 97, column: 9, scope: !974)
!987 = !DILocation(line: 102, column: 5, scope: !974)
!988 = !DILocation(line: 103, column: 12, scope: !974)
!989 = !DILocation(line: 103, column: 5, scope: !974)
!990 = !DILocation(line: 0, scope: !974)
!991 = !DILocation(line: 104, column: 1, scope: !974)
!992 = distinct !DISubprogram(name: "vstr_str", scope: !644, file: !644, line: 179, type: !993, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{!646, !954}
!995 = !{!996}
!996 = !DILocalVariable(name: "vstr", arg: 1, scope: !992, file: !644, line: 179, type: !954)
!997 = !DILocation(line: 179, column: 38, scope: !992)
!998 = !DILocation(line: 179, column: 59, scope: !992)
!999 = !{!867, !618, i64 16}
!1000 = !DILocation(line: 179, column: 46, scope: !992)
!1001 = distinct !DISubprogram(name: "stat_file_py_or_mpy", scope: !439, file: !439, line: 77, type: !975, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1002 = !{!1003, !1004}
!1003 = !DILocalVariable(name: "path", arg: 1, scope: !1001, file: !439, line: 77, type: !954)
!1004 = !DILocalVariable(name: "stat", scope: !1001, file: !439, line: 78, type: !677)
!1005 = !DILocation(line: 77, column: 53, scope: !1001)
!1006 = !DILocation(line: 78, column: 48, scope: !1001)
!1007 = !DILocation(line: 78, column: 29, scope: !1001)
!1008 = !DILocation(line: 78, column: 22, scope: !1001)
!1009 = !DILocation(line: 79, column: 14, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1001, file: !439, line: 79, column: 9)
!1011 = !DILocation(line: 92, column: 1, scope: !1001)
!1012 = distinct !DISubprogram(name: "do_load", scope: !439, file: !439, line: 194, type: !1013, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1015)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !422, !954}
!1015 = !{!1016, !1017, !1018, !1019, !1022, !1023}
!1016 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1012, file: !439, line: 194, type: !422)
!1017 = !DILocalVariable(name: "file", arg: 2, scope: !1012, file: !439, line: 194, type: !954)
!1018 = !DILocalVariable(name: "file_str", scope: !1012, file: !439, line: 196, type: !646)
!1019 = !DILocalVariable(name: "modref", scope: !1020, file: !439, line: 206, type: !423)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !439, line: 202, column: 56)
!1021 = distinct !DILexicalBlock(scope: !1012, file: !439, line: 200, column: 9)
!1022 = !DILocalVariable(name: "frozen_type", scope: !1020, file: !439, line: 207, type: !568)
!1023 = !DILocalVariable(name: "lex", scope: !1024, file: !439, line: 244, type: !1025)
!1024 = distinct !DILexicalBlock(scope: !1012, file: !439, line: 243, column: 5)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !248, line: 168, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !248, line: 148, size: 1280, elements: !1028)
!1028 = !{!1029, !1030, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1056, !1057, !1058, !1060}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !1027, file: !248, line: 149, baseType: !527, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !1027, file: !248, line: 150, baseType: !1031, size: 192, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !1032, line: 40, baseType: !1033)
!1032 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !1032, line: 36, size: 192, elements: !1034)
!1034 = !{!1035, !1036, !1040}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1033, file: !1032, line: 37, baseType: !423, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !1033, file: !1032, line: 38, baseType: !1037, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!431, !423}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1033, file: !1032, line: 39, baseType: !1041, size: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{null, !423}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !1027, file: !248, line: 152, baseType: !1045, size: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !644, line: 131, baseType: !643)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !1027, file: !248, line: 152, baseType: !1045, size: 32, offset: 288)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !1027, file: !248, line: 152, baseType: !1045, size: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1027, file: !248, line: 154, baseType: !435, size: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !1027, file: !248, line: 155, baseType: !435, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !1027, file: !248, line: 157, baseType: !424, size: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !1027, file: !248, line: 158, baseType: !424, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !1027, file: !248, line: 160, baseType: !435, size: 64, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !1027, file: !248, line: 161, baseType: !435, size: 64, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !1027, file: !248, line: 162, baseType: !1055, size: 64, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !1027, file: !248, line: 164, baseType: !435, size: 64, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !1027, file: !248, line: 165, baseType: !435, size: 64, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !1027, file: !248, line: 166, baseType: !1059, size: 32, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !248, line: 144, baseType: !322)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !1027, file: !248, line: 167, baseType: !656, size: 256, offset: 1024)
!1061 = !DILocation(line: 194, column: 30, scope: !1012)
!1062 = !DILocation(line: 194, column: 50, scope: !1012)
!1063 = !DILocation(line: 196, column: 22, scope: !1012)
!1064 = !DILocation(line: 196, column: 11, scope: !1012)
!1065 = !DILocation(line: 200, column: 9, scope: !1021)
!1066 = !DILocation(line: 202, column: 50, scope: !1021)
!1067 = !DILocation(line: 200, column: 9, scope: !1012)
!1068 = !DILocation(line: 206, column: 9, scope: !1020)
!1069 = !DILocation(line: 207, column: 58, scope: !1020)
!1070 = !DILocation(line: 207, column: 99, scope: !1020)
!1071 = !DILocation(line: 207, column: 103, scope: !1020)
!1072 = !DILocation(line: 206, column: 15, scope: !1020)
!1073 = !DILocation(line: 207, column: 27, scope: !1020)
!1074 = !DILocation(line: 207, column: 13, scope: !1020)
!1075 = !DILocation(line: 222, column: 25, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1020, file: !439, line: 222, column: 13)
!1077 = !DILocation(line: 222, column: 13, scope: !1020)
!1078 = !DILocation(line: 223, column: 45, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1076, file: !439, line: 222, column: 43)
!1080 = !DILocation(line: 223, column: 13, scope: !1079)
!1081 = !DILocation(line: 228, column: 5, scope: !1021)
!1082 = !DILocation(line: 244, column: 27, scope: !1024)
!1083 = !DILocation(line: 244, column: 21, scope: !1024)
!1084 = !DILocation(line: 245, column: 9, scope: !1024)
!1085 = !DILocation(line: 253, column: 1, scope: !1012)
!1086 = distinct !DISubprogram(name: "mp_import_stat_any", scope: !439, file: !439, line: 63, type: !1087, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!677, !477}
!1089 = !{!1090, !1091}
!1090 = !DILocalVariable(name: "path", arg: 1, scope: !1086, file: !439, line: 63, type: !477)
!1091 = !DILocalVariable(name: "st", scope: !1092, file: !439, line: 68, type: !677)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !439, line: 67, column: 56)
!1093 = distinct !DILexicalBlock(scope: !1086, file: !439, line: 65, column: 9)
!1094 = !DILocation(line: 63, column: 56, scope: !1086)
!1095 = !DILocation(line: 65, column: 9, scope: !1093)
!1096 = !DILocation(line: 67, column: 50, scope: !1093)
!1097 = !DILocation(line: 65, column: 9, scope: !1086)
!1098 = !DILocation(line: 68, column: 51, scope: !1092)
!1099 = !DILocation(line: 68, column: 31, scope: !1092)
!1100 = !DILocation(line: 68, column: 26, scope: !1092)
!1101 = !DILocation(line: 69, column: 16, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1092, file: !439, line: 69, column: 13)
!1103 = !DILocation(line: 74, column: 12, scope: !1086)
!1104 = !DILocation(line: 74, column: 5, scope: !1086)
!1105 = !DILocation(line: 0, scope: !1086)
!1106 = !DILocation(line: 75, column: 1, scope: !1086)
!1107 = distinct !DISubprogram(name: "do_execute_raw_code", scope: !439, file: !439, line: 158, type: !1108, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1138)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !422, !1110, !477}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !1112, line: 62, baseType: !1113)
!1112 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/emitglue.h", directory: "")
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !1112, line: 42, size: 256, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1113, file: !1112, line: 43, baseType: !431, size: 3, flags: DIFlagBitField, extraData: i64 0)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !1113, file: !1112, line: 44, baseType: !431, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !1113, file: !1112, line: 45, baseType: !431, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !1112, line: 61, baseType: !1119, size: 192, offset: 64)
!1119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1113, file: !1112, line: 46, size: 192, elements: !1120)
!1120 = !{!1121, !1132}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !1119, file: !1112, line: 55, baseType: !1122, size: 128)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1119, file: !1112, line: 47, size: 128, elements: !1123)
!1123 = !{!1124, !1129}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !1122, file: !1112, line: 48, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !644, line: 39, baseType: !1128)
!1128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !1122, file: !1112, line: 49, baseType: !1130, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !1119, file: !1112, line: 60, baseType: !1133, size: 192)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1119, file: !1112, line: 56, size: 192, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !1133, file: !1112, line: 57, baseType: !423, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !1133, file: !1112, line: 58, baseType: !1130, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !1133, file: !1112, line: 59, baseType: !431, size: 64, offset: 128)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1145, !1146, !1160}
!1139 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1107, file: !439, line: 158, type: !422)
!1140 = !DILocalVariable(name: "raw_code", arg: 2, scope: !1107, file: !439, line: 158, type: !1110)
!1141 = !DILocalVariable(name: "filename", arg: 3, scope: !1107, file: !439, line: 158, type: !477)
!1142 = !DILocalVariable(name: "mod_globals", scope: !1107, file: !439, line: 164, type: !689)
!1143 = !DILocalVariable(name: "old_globals", scope: !1107, file: !439, line: 167, type: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!1145 = !DILocalVariable(name: "old_locals", scope: !1107, file: !439, line: 168, type: !1144)
!1146 = !DILocalVariable(name: "nlr", scope: !1107, file: !439, line: 174, type: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !1148, line: 72, baseType: !1149)
!1148 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/nlr.h", directory: "")
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !1148, line: 73, size: 1344, elements: !1150)
!1150 = !{!1151, !1153, !1154}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1149, file: !1148, line: 75, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !1149, file: !1148, line: 76, baseType: !423, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !1149, file: !1148, line: 79, baseType: !1155, size: 1184, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !1156, line: 37, baseType: !1157)
!1156 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/setjmp.h", directory: "")
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 1184, elements: !1158)
!1158 = !{!1159}
!1159 = !DISubrange(count: 37)
!1160 = !DILocalVariable(name: "module_fun", scope: !1161, file: !439, line: 176, type: !422)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !439, line: 175, column: 30)
!1162 = distinct !DILexicalBlock(scope: !1107, file: !439, line: 175, column: 9)
!1163 = !DILocation(line: 158, column: 42, scope: !1107)
!1164 = !DILocation(line: 158, column: 69, scope: !1107)
!1165 = !DILocation(line: 158, column: 91, scope: !1107)
!1166 = !DILocation(line: 160, column: 49, scope: !1107)
!1167 = !DILocation(line: 160, column: 5, scope: !1107)
!1168 = !DILocation(line: 164, column: 34, scope: !1107)
!1169 = !DILocation(line: 164, column: 20, scope: !1107)
!1170 = !DILocation(line: 167, column: 5, scope: !1107)
!1171 = !DILocation(line: 167, column: 29, scope: !1107)
!1172 = !DILocation(line: 167, column: 43, scope: !1107)
!1173 = !DILocation(line: 168, column: 5, scope: !1107)
!1174 = !DILocation(line: 168, column: 29, scope: !1107)
!1175 = !DILocation(line: 168, column: 42, scope: !1107)
!1176 = !DILocation(line: 171, column: 5, scope: !1107)
!1177 = !DILocation(line: 172, column: 5, scope: !1107)
!1178 = !DILocation(line: 174, column: 5, scope: !1107)
!1179 = !DILocation(line: 174, column: 15, scope: !1107)
!1180 = !DILocation(line: 175, column: 9, scope: !1162)
!1181 = !DILocation(line: 175, column: 24, scope: !1162)
!1182 = !DILocation(line: 175, column: 9, scope: !1107)
!1183 = !DILocation(line: 176, column: 31, scope: !1161)
!1184 = !DILocation(line: 176, column: 18, scope: !1161)
!1185 = !DILocation(line: 177, column: 9, scope: !1161)
!1186 = !DILocation(line: 180, column: 9, scope: !1161)
!1187 = !DILocation(line: 182, column: 34, scope: !1161)
!1188 = !DILocation(line: 182, column: 13, scope: !1161)
!1189 = !DILocation(line: 181, column: 9, scope: !1161)
!1190 = !DILocation(line: 183, column: 24, scope: !1161)
!1191 = !DILocation(line: 183, column: 9, scope: !1161)
!1192 = !DILocation(line: 184, column: 23, scope: !1161)
!1193 = !DILocation(line: 184, column: 9, scope: !1161)
!1194 = !DILocation(line: 191, column: 1, scope: !1107)
!1195 = !DILocation(line: 187, column: 24, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1162, file: !439, line: 185, column: 12)
!1197 = !DILocation(line: 187, column: 9, scope: !1196)
!1198 = !DILocation(line: 188, column: 23, scope: !1196)
!1199 = !DILocation(line: 188, column: 9, scope: !1196)
!1200 = !DILocation(line: 189, column: 22, scope: !1196)
!1201 = !{!1202, !618, i64 8}
!1202 = !{!"_nlr_buf_t", !618, i64 0, !618, i64 8, !619, i64 16}
!1203 = !DILocation(line: 189, column: 9, scope: !1196)
!1204 = distinct !DISubprogram(name: "do_load_from_lexer", scope: !439, file: !439, line: 144, type: !1205, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1207)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !422, !1025}
!1207 = !{!1208, !1209, !1210, !1211}
!1208 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1204, file: !439, line: 144, type: !422)
!1209 = !DILocalVariable(name: "lex", arg: 2, scope: !1204, file: !439, line: 144, type: !1025)
!1210 = !DILocalVariable(name: "source_name", scope: !1204, file: !439, line: 146, type: !527)
!1211 = !DILocalVariable(name: "mod_globals", scope: !1204, file: !439, line: 151, type: !689)
!1212 = !DILocation(line: 144, column: 41, scope: !1204)
!1213 = !DILocation(line: 144, column: 65, scope: !1204)
!1214 = !DILocation(line: 146, column: 29, scope: !1204)
