; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/builtinevex.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/builtinevex.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!340 = !DIEnumerator(name: "MP_QSTR_items", value: 167, isUnsigned: true)
!341 = !DIEnumerator(name: "MP_QSTR_iter", value: 168, isUnsigned: true)
!342 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169, isUnsigned: true)
!343 = !DIEnumerator(name: "MP_QSTR_join", value: 170, isUnsigned: true)
!344 = !DIEnumerator(name: "MP_QSTR_key", value: 171, isUnsigned: true)
!345 = !DIEnumerator(name: "MP_QSTR_keys", value: 172, isUnsigned: true)
!346 = !DIEnumerator(name: "MP_QSTR_len", value: 173, isUnsigned: true)
!347 = !DIEnumerator(name: "MP_QSTR_list", value: 174, isUnsigned: true)
!348 = !DIEnumerator(name: "MP_QSTR_little", value: 175, isUnsigned: true)
!349 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!350 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!351 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!352 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!353 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!354 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!355 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!356 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!357 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!358 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!359 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!360 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!361 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!362 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!363 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!364 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!365 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!366 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!367 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!368 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!369 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!370 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!371 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!372 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!373 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!374 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!375 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!376 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!377 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!378 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!379 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!380 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!381 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!382 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!383 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!384 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!385 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!386 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!387 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!388 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!401 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!402 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!403 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!404 = !{!405, !407, !406, !529}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !409, file: !6, line: 57, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !416)
!416 = !{!417, !418, !422, !423, !449, !473, !478, !484, !490, !497, !502, !516, !521, !546, !549, !550}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !415, file: !6, line: 476, baseType: !408, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !415, file: !6, line: 479, baseType: !419, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !420, line: 31, baseType: !421)
!420 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!421 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !6, line: 482, baseType: !419, size: 16, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !415, file: !6, line: 485, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !405, !448}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !431, line: 53, baseType: !432)
!431 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !431, line: 50, size: 128, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !432, file: !431, line: 51, baseType: !406, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !432, file: !431, line: 52, baseType: !436, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !431, line: 48, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !406, !440, !443}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !444, line: 31, baseType: !445)
!444 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !446, line: 92, baseType: !447)
!446 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!447 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !415, file: !6, line: 488, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!405, !412, !443, !454, !456}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !458, file: !6, line: 366, baseType: !443, size: 1, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !458, file: !6, line: 367, baseType: !443, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !458, file: !6, line: 368, baseType: !443, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !458, file: !6, line: 369, baseType: !443, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !458, file: !6, line: 371, baseType: !443, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !458, file: !6, line: 372, baseType: !443, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !458, file: !6, line: 373, baseType: !467, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !469, file: !6, line: 351, baseType: !405, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !469, file: !6, line: 352, baseType: !405, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !415, file: !6, line: 491, baseType: !474, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!405, !405, !443, !443, !454}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !415, file: !6, line: 495, baseType: !479, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!405, !483, !405}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !415, file: !6, line: 496, baseType: !485, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!405, !489, !405, !405}
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !415, file: !6, line: 509, baseType: !491, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !405, !495, !496}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !171, line: 48, baseType: !443)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !415, file: !6, line: 516, baseType: !498, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!405, !405, !405, !405}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !415, file: !6, line: 521, baseType: !503, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!405, !405, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !6, line: 433, baseType: !408, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !509, file: !6, line: 434, baseType: !513, size: 192, offset: 64)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 3)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !415, file: !6, line: 525, baseType: !517, size: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!405, !405}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !415, file: !6, line: 528, baseType: !522, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !523, file: !6, line: 469, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !405, !535, !543}
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !530, line: 69, baseType: !531)
!530 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !532, line: 32, baseType: !533)
!532 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !446, line: 49, baseType: !534)
!534 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !538)
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !537, file: !6, line: 457, baseType: !406, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !537, file: !6, line: 458, baseType: !443, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !537, file: !6, line: 459, baseType: !542, size: 32, offset: 128)
!542 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !530, line: 70, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !545, line: 30, baseType: !447)
!545 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!546 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !415, file: !6, line: 531, baseType: !547, size: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !415, file: !6, line: 537, baseType: !547, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !415, file: !6, line: 540, baseType: !551, size: 64, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !552, file: !6, line: 776, baseType: !408, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !552, file: !6, line: 777, baseType: !457, size: 192, offset: 64)
!556 = !{!0, !557}
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "mp_builtin_exec_obj", scope: !2, file: !559, line: 159, type: !560, isLocal: false, isDefinition: true)
!559 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/builtinevex.c", directory: "")
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !563)
!563 = !{!564, !565, !567, !568, !569}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !562, file: !6, line: 806, baseType: !408, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !562, file: !6, line: 807, baseType: !566, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!566 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !562, file: !6, line: 808, baseType: !543, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !562, file: !6, line: 809, baseType: !543, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !562, file: !6, line: 813, baseType: !570, size: 64, offset: 128)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !562, file: !6, line: 810, size: 64, elements: !571)
!571 = !{!572, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !570, file: !6, line: 811, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!405, !443, !454}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !570, file: !6, line: 812, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!405, !443, !454, !456}
!582 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!583 = !{i32 2, !"Dwarf Version", i32 4}
!584 = !{i32 2, !"Debug Info Version", i32 3}
!585 = !{i32 1, !"wchar_size", i32 4}
!586 = !{i32 7, !"PIC Level", i32 2}
!587 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!588 = distinct !DISubprogram(name: "mp_builtin_eval", scope: !559, file: !559, line: 151, type: !575, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !589)
!589 = !{!590, !591}
!590 = !DILocalVariable(name: "n_args", arg: 1, scope: !588, file: !559, line: 151, type: !443)
!591 = !DILocalVariable(name: "args", arg: 2, scope: !588, file: !559, line: 151, type: !454)
!592 = !DILocation(line: 151, column: 40, scope: !588)
!593 = !DILocation(line: 151, column: 64, scope: !588)
!594 = !DILocation(line: 152, column: 12, scope: !588)
!595 = !DILocation(line: 152, column: 5, scope: !588)
!596 = distinct !DISubprogram(name: "mp_builtin_exec", scope: !559, file: !559, line: 156, type: !575, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !597)
!597 = !{!598, !599}
!598 = !DILocalVariable(name: "n_args", arg: 1, scope: !596, file: !559, line: 156, type: !443)
!599 = !DILocalVariable(name: "args", arg: 2, scope: !596, file: !559, line: 156, type: !454)
!600 = !DILocation(line: 156, column: 40, scope: !596)
!601 = !DILocation(line: 156, column: 64, scope: !596)
!602 = !DILocation(line: 157, column: 12, scope: !596)
!603 = !DILocation(line: 157, column: 5, scope: !596)
!604 = distinct !DISubprogram(name: "eval_exec_helper", scope: !559, file: !559, line: 113, type: !605, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!605 = !DISubroutineType(types: !606)
!606 = !{!405, !443, !454, !607}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !71, line: 95, baseType: !70)
!608 = !{!609, !610, !611, !612, !615, !616, !618, !619, !620}
!609 = !DILocalVariable(name: "n_args", arg: 1, scope: !604, file: !559, line: 113, type: !443)
!610 = !DILocalVariable(name: "args", arg: 2, scope: !604, file: !559, line: 113, type: !454)
!611 = !DILocalVariable(name: "parse_input_kind", arg: 3, scope: !604, file: !559, line: 113, type: !607)
!612 = !DILocalVariable(name: "globals", scope: !604, file: !559, line: 115, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !552)
!615 = !DILocalVariable(name: "locals", scope: !604, file: !559, line: 116, type: !613)
!616 = !DILocalVariable(name: "i", scope: !617, file: !559, line: 117, type: !443)
!617 = distinct !DILexicalBlock(scope: !604, file: !559, line: 117, column: 5)
!618 = !DILocalVariable(name: "str_len", scope: !604, file: !559, line: 135, type: !443)
!619 = !DILocalVariable(name: "str", scope: !604, file: !559, line: 136, type: !440)
!620 = !DILocalVariable(name: "lex", scope: !604, file: !559, line: 140, type: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !77, line: 168, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !77, line: 148, size: 1280, elements: !624)
!624 = !{!625, !626, !640, !644, !645, !646, !647, !648, !649, !650, !651, !652, !654, !655, !656, !658}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !623, file: !77, line: 149, baseType: !495, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !623, file: !77, line: 150, baseType: !627, size: 192, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !628, line: 40, baseType: !629)
!628 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !628, line: 36, size: 192, elements: !630)
!630 = !{!631, !632, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !629, file: !628, line: 37, baseType: !406, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !629, file: !628, line: 38, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!543, !406}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !629, file: !628, line: 39, baseType: !637, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !406}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !623, file: !77, line: 152, baseType: !641, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !642, line: 131, baseType: !643)
!642 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !642, line: 40, baseType: !7)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !623, file: !77, line: 152, baseType: !641, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !623, file: !77, line: 152, baseType: !641, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !623, file: !77, line: 154, baseType: !443, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !623, file: !77, line: 155, baseType: !443, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !623, file: !77, line: 157, baseType: !529, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !623, file: !77, line: 158, baseType: !529, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !623, file: !77, line: 160, baseType: !443, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !623, file: !77, line: 161, baseType: !443, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !623, file: !77, line: 162, baseType: !653, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !623, file: !77, line: 164, baseType: !443, size: 64, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !623, file: !77, line: 165, baseType: !443, size: 64, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !623, file: !77, line: 166, baseType: !657, size: 32, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !77, line: 144, baseType: !76)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !623, file: !77, line: 167, baseType: !659, size: 256, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !642, line: 165, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !642, line: 160, size: 256, elements: !661)
!661 = !{!662, !663, !664, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !660, file: !642, line: 161, baseType: !443, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !660, file: !642, line: 162, baseType: !443, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !660, file: !642, line: 163, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !660, file: !642, line: 164, baseType: !566, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!667 = !DILocation(line: 113, column: 41, scope: !604)
!668 = !DILocation(line: 113, column: 65, scope: !604)
!669 = !DILocation(line: 113, column: 93, scope: !604)
!670 = !DILocation(line: 115, column: 30, scope: !604)
!671 = !DILocation(line: 115, column: 20, scope: !604)
!672 = !DILocation(line: 116, column: 29, scope: !604)
!673 = !DILocation(line: 116, column: 20, scope: !604)
!674 = !DILocation(line: 117, column: 17, scope: !617)
!675 = !DILocation(line: 117, column: 35, scope: !676)
!676 = distinct !DILexicalBlock(scope: !617, file: !559, line: 117, column: 5)
!677 = !DILocation(line: 117, column: 30, scope: !676)
!678 = !DILocation(line: 0, scope: !604)
!679 = !DILocation(line: 135, column: 5, scope: !604)
!680 = !DILocation(line: 136, column: 43, scope: !604)
!681 = !{!682, !682, i64 0}
!682 = !{!"any pointer", !683, i64 0}
!683 = !{!"omnipotent char", !684, i64 0}
!684 = !{!"Simple C/C++ TBAA"}
!685 = !DILocation(line: 135, column: 12, scope: !604)
!686 = !DILocation(line: 136, column: 23, scope: !604)
!687 = !DILocation(line: 136, column: 17, scope: !604)
!688 = !DILocation(line: 145, column: 70, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !559, line: 144, column: 12)
!690 = distinct !DILexicalBlock(scope: !604, file: !559, line: 141, column: 9)
!691 = !{!692, !692, i64 0}
!692 = !{!"long", !683, i64 0}
!693 = !DILocation(line: 145, column: 15, scope: !689)
!694 = !DILocation(line: 140, column: 17, scope: !604)
!695 = !DILocation(line: 148, column: 12, scope: !604)
!696 = !DILocation(line: 149, column: 1, scope: !604)
!697 = !DILocation(line: 148, column: 5, scope: !604)
!698 = !DILocation(line: 118, column: 13, scope: !699)
!699 = distinct !DILexicalBlock(scope: !700, file: !559, line: 118, column: 13)
!700 = distinct !DILexicalBlock(scope: !676, file: !559, line: 117, column: 50)
!701 = !DILocation(line: 118, column: 21, scope: !699)
!702 = !DILocation(line: 118, column: 13, scope: !700)
!703 = !DILocation(line: 119, column: 18, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !559, line: 119, column: 17)
!705 = distinct !DILexicalBlock(scope: !699, file: !559, line: 118, column: 39)
!706 = !{!707, !682, i64 0}
!707 = !{!"_mp_obj_base_t", !682, i64 0}
!708 = !DILocation(line: 119, column: 17, scope: !705)
!709 = !DILocation(line: 120, column: 17, scope: !710)
!710 = distinct !DILexicalBlock(scope: !704, file: !559, line: 119, column: 58)
!711 = !DILocation(line: 122, column: 22, scope: !705)
!712 = !DILocation(line: 123, column: 19, scope: !713)
!713 = distinct !DILexicalBlock(scope: !705, file: !559, line: 123, column: 17)
!714 = !DILocation(line: 123, column: 17, scope: !705)
!715 = !DILocation(line: 117, column: 45, scope: !676)
!716 = !DILocation(line: 117, column: 26, scope: !676)
!717 = distinct !{!717, !718, !719}
!718 = !DILocation(line: 117, column: 5, scope: !617)
!719 = !DILocation(line: 127, column: 5, scope: !617)
!720 = distinct !DISubprogram(name: "mp_globals_get", scope: !721, file: !721, line: 89, type: !722, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !724)
!721 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime.h", directory: "")
!722 = !DISubroutineType(types: !723)
!723 = !{!613}
!724 = !{}
!725 = !DILocation(line: 89, column: 60, scope: !720)
!726 = !{!727, !682, i64 16}
!727 = !{!"_mp_state_ctx_t", !728, i64 0, !729, i64 32, !734, i64 336}
!728 = !{!"_mp_state_thread_t", !682, i64 0, !682, i64 8, !682, i64 16, !682, i64 24}
!729 = !{!"_mp_state_vm_t", !682, i64 0, !730, i64 8, !730, i64 40, !731, i64 72, !682, i64 104, !731, i64 112, !733, i64 144, !733, i64 176, !683, i64 208, !682, i64 272, !692, i64 280, !692, i64 288, !692, i64 296}
