; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/builtinimport.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/builtinimport.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!383 = !DIEnumerator(name: "MP_TOKEN_OP_CARET", value: 60)
!384 = !DIEnumerator(name: "MP_TOKEN_OP_TILDE", value: 61)
!385 = !DIEnumerator(name: "MP_TOKEN_OP_LESS_EQUAL", value: 62)
!386 = !DIEnumerator(name: "MP_TOKEN_OP_MORE_EQUAL", value: 63)
!387 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_EQUAL", value: 64)
!388 = !DIEnumerator(name: "MP_TOKEN_OP_NOT_EQUAL", value: 65)
!389 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_OPEN", value: 66)
!390 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_CLOSE", value: 67)
!391 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_OPEN", value: 68)
!392 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_CLOSE", value: 69)
!393 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_OPEN", value: 70)
!394 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_CLOSE", value: 71)
!395 = !DIEnumerator(name: "MP_TOKEN_DEL_COMMA", value: 72)
!396 = !DIEnumerator(name: "MP_TOKEN_DEL_COLON", value: 73)
!397 = !DIEnumerator(name: "MP_TOKEN_DEL_PERIOD", value: 74)
!398 = !DIEnumerator(name: "MP_TOKEN_DEL_SEMICOLON", value: 75)
!399 = !DIEnumerator(name: "MP_TOKEN_DEL_AT", value: 76)
!400 = !DIEnumerator(name: "MP_TOKEN_DEL_EQUAL", value: 77)
!401 = !DIEnumerator(name: "MP_TOKEN_DEL_PLUS_EQUAL", value: 78)
!402 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_EQUAL", value: 79)
!403 = !DIEnumerator(name: "MP_TOKEN_DEL_STAR_EQUAL", value: 80)
!404 = !DIEnumerator(name: "MP_TOKEN_DEL_SLASH_EQUAL", value: 81)
!405 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_SLASH_EQUAL", value: 82)
!406 = !DIEnumerator(name: "MP_TOKEN_DEL_PERCENT_EQUAL", value: 83)
!407 = !DIEnumerator(name: "MP_TOKEN_DEL_AMPERSAND_EQUAL", value: 84)
!408 = !DIEnumerator(name: "MP_TOKEN_DEL_PIPE_EQUAL", value: 85)
!409 = !DIEnumerator(name: "MP_TOKEN_DEL_CARET_EQUAL", value: 86)
!410 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_MORE_EQUAL", value: 87)
!411 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88)
!412 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89)
!413 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 91, size: 32, elements: !416)
!415 = !DIFile(filename: "../../py/parse.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!416 = !{!417, !418, !419}
!417 = !DIEnumerator(name: "MP_PARSE_SINGLE_INPUT", value: 0)
!418 = !DIEnumerator(name: "MP_PARSE_FILE_INPUT", value: 1)
!419 = !DIEnumerator(name: "MP_PARSE_EVAL_INPUT", value: 2)
!420 = !{!421, !422, !423, !430, !434}
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !240, line: 46, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !424, line: 70, baseType: !425)
!424 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !426, line: 32, baseType: !427)
!426 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !428, line: 49, baseType: !429)
!428 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!429 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !424, line: 71, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !432, line: 30, baseType: !433)
!432 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!433 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !435, line: 31, baseType: !436)
!435 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !428, line: 92, baseType: !433)
!437 = !{!0}
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !240, line: 814, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !240, line: 805, size: 192, elements: !441)
!441 = !{!442, !577, !579, !580, !581}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !440, file: !240, line: 806, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !240, line: 59, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !240, line: 56, size: 64, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !240, line: 57, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !240, line: 52, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !240, line: 474, size: 960, elements: !451)
!451 = !{!452, !453, !457, !458, !479, !503, !508, !514, !520, !527, !532, !546, !551, !567, !570, !571}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !450, file: !240, line: 476, baseType: !443, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !240, line: 479, baseType: !454, size: 16, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !455, line: 31, baseType: !456)
!455 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !240, line: 482, baseType: !454, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !450, file: !240, line: 485, baseType: !459, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !240, line: 441, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !463, !421, !478}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !466, line: 53, baseType: !467)
!466 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !466, line: 50, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !467, file: !466, line: 51, baseType: !422, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !467, file: !466, line: 52, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !466, line: 48, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !422, !475, !434}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !240, line: 430, baseType: !252)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !450, file: !240, line: 488, baseType: !480, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !240, line: 442, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!421, !447, !434, !484, !486}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !240, line: 374, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !240, line: 365, size: 192, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !488, file: !240, line: 366, baseType: !434, size: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !488, file: !240, line: 367, baseType: !434, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !488, file: !240, line: 368, baseType: !434, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !488, file: !240, line: 369, baseType: !434, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !488, file: !240, line: 371, baseType: !434, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !488, file: !240, line: 372, baseType: !434, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !488, file: !240, line: 373, baseType: !497, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !240, line: 353, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !240, line: 350, size: 128, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !499, file: !240, line: 351, baseType: !421, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !499, file: !240, line: 352, baseType: !421, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !450, file: !240, line: 491, baseType: !504, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !240, line: 443, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!421, !421, !434, !434, !484}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !450, file: !240, line: 495, baseType: !509, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !240, line: 444, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!421, !513, !421}
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !261, line: 65, baseType: !260)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !450, file: !240, line: 496, baseType: !515, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !240, line: 445, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!421, !519, !421, !421}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !261, line: 145, baseType: !274)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !450, file: !240, line: 509, baseType: !521, size: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !240, line: 446, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !421, !525, !526}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !6, line: 48, baseType: !434)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !450, file: !240, line: 516, baseType: !528, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !240, line: 447, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!421, !421, !421, !421}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !450, file: !240, line: 521, baseType: !533, size: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !240, line: 448, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!421, !421, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !240, line: 435, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !240, line: 432, size: 256, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !539, file: !240, line: 433, baseType: !443, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !539, file: !240, line: 434, baseType: !543, size: 192, offset: 64)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 192, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 3)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !450, file: !240, line: 525, baseType: !547, size: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !240, line: 415, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!421, !421}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !450, file: !240, line: 528, baseType: !552, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !240, line: 470, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !240, line: 468, size: 64, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !553, file: !240, line: 469, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!423, !421, !559, !430}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !240, line: 464, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !240, line: 451, size: 192, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !561, file: !240, line: 457, baseType: !422, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !561, file: !240, line: 458, baseType: !434, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !561, file: !240, line: 459, baseType: !566, size: 32, offset: 128)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !450, file: !240, line: 531, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !450, file: !240, line: 537, baseType: !568, size: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !450, file: !240, line: 540, baseType: !572, size: 64, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !240, line: 775, size: 256, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !573, file: !240, line: 776, baseType: !443, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !573, file: !240, line: 777, baseType: !487, size: 192, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !440, file: !240, line: 807, baseType: !578, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!578 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !440, file: !240, line: 808, baseType: !430, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !440, file: !240, line: 809, baseType: !430, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !440, file: !240, line: 813, baseType: !582, size: 64, offset: 128)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !240, line: 810, size: 64, elements: !583)
!583 = !{!584, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !582, file: !240, line: 811, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !240, line: 418, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!421, !434, !484}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !582, file: !240, line: 812, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !240, line: 421, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!421, !434, !484, !486}
!594 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!595 = !{i32 2, !"Dwarf Version", i32 4}
!596 = !{i32 2, !"Debug Info Version", i32 3}
!597 = !{i32 1, !"wchar_size", i32 4}
!598 = !{i32 7, !"PIC Level", i32 2}
!599 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!600 = distinct !DISubprogram(name: "mp_obj_is_package", scope: !3, file: !3, line: 55, type: !601, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!578, !421}
!603 = !{!604, !605}
!604 = !DILocalVariable(name: "module", arg: 1, scope: !600, file: !3, line: 55, type: !421)
!605 = !DILocalVariable(name: "dest", scope: !600, file: !3, line: 56, type: !606)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 128, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 2)
!609 = !DILocation(line: 55, column: 33, scope: !600)
!610 = !DILocation(line: 56, column: 5, scope: !600)
!611 = !DILocation(line: 56, column: 14, scope: !600)
!612 = !DILocation(line: 57, column: 52, scope: !600)
!613 = !DILocation(line: 57, column: 5, scope: !600)
!614 = !DILocation(line: 58, column: 12, scope: !600)
!615 = !{!616, !616, i64 0}
!616 = !{!"any pointer", !617, i64 0}
!617 = !{!"omnipotent char", !618, i64 0}
!618 = !{!"Simple C/C++ TBAA"}
!619 = !DILocation(line: 58, column: 20, scope: !600)
!620 = !DILocation(line: 59, column: 1, scope: !600)
!621 = !DILocation(line: 58, column: 5, scope: !600)
!622 = distinct !DISubprogram(name: "mp_builtin___import__", scope: !3, file: !3, line: 266, type: !587, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !634, !635, !636, !637, !638, !639, !640, !644, !646, !647, !648, !649, !652, !653, !654, !662, !666, !667, !668, !669, !675, !677, !690, !693}
!624 = !DILocalVariable(name: "n_args", arg: 1, scope: !622, file: !3, line: 266, type: !434)
!625 = !DILocalVariable(name: "args", arg: 2, scope: !622, file: !3, line: 266, type: !484)
!626 = !DILocalVariable(name: "module_name", scope: !622, file: !3, line: 276, type: !421)
!627 = !DILocalVariable(name: "fromtuple", scope: !622, file: !3, line: 277, type: !421)
!628 = !DILocalVariable(name: "level", scope: !622, file: !3, line: 278, type: !423)
!629 = !DILocalVariable(name: "mod_len", scope: !622, file: !3, line: 289, type: !434)
!630 = !DILocalVariable(name: "mod_str", scope: !622, file: !3, line: 290, type: !475)
!631 = !DILocalVariable(name: "this_name_q", scope: !632, file: !3, line: 301, type: !421)
!632 = distinct !DILexicalBlock(scope: !633, file: !3, line: 292, column: 21)
!633 = distinct !DILexicalBlock(scope: !622, file: !3, line: 292, column: 9)
!634 = !DILocalVariable(name: "globals_map", scope: !632, file: !3, line: 309, type: !486)
!635 = !DILocalVariable(name: "elem", scope: !632, file: !3, line: 310, type: !497)
!636 = !DILocalVariable(name: "is_pkg", scope: !632, file: !3, line: 311, type: !578)
!637 = !DILocalVariable(name: "this_name_l", scope: !632, file: !3, line: 320, type: !434)
!638 = !DILocalVariable(name: "this_name", scope: !632, file: !3, line: 321, type: !475)
!639 = !DILocalVariable(name: "p", scope: !632, file: !3, line: 323, type: !475)
!640 = !DILocalVariable(name: "new_mod_l", scope: !632, file: !3, line: 339, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !642, line: 40, baseType: !643)
!642 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!643 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!644 = !DILocalVariable(name: "new_mod", scope: !632, file: !3, line: 340, type: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!646 = !DILocalVariable(name: "new_mod_q", scope: !632, file: !3, line: 347, type: !525)
!647 = !DILocalVariable(name: "module_name_qstr", scope: !622, file: !3, line: 356, type: !525)
!648 = !DILocalVariable(name: "module_obj", scope: !622, file: !3, line: 357, type: !421)
!649 = !DILocalVariable(name: "p", scope: !650, file: !3, line: 361, type: !645)
!650 = distinct !DILexicalBlock(scope: !651, file: !3, line: 358, column: 36)
!651 = distinct !DILexicalBlock(scope: !622, file: !3, line: 358, column: 9)
!652 = !DILocalVariable(name: "pkg_name", scope: !650, file: !3, line: 370, type: !525)
!653 = !DILocalVariable(name: "last", scope: !622, file: !3, line: 375, type: !641)
!654 = !DILocalVariable(name: "path", scope: !622, file: !3, line: 376, type: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !642, line: 165, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !642, line: 160, size: 256, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !656, file: !642, line: 161, baseType: !434, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !656, file: !642, line: 162, baseType: !434, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !656, file: !642, line: 163, baseType: !645, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !656, file: !642, line: 164, baseType: !578, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!662 = !DILocalVariable(name: "path_buf", scope: !622, file: !3, line: 376, type: !663)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2048, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 256)
!666 = !DILocalVariable(name: "top_module_obj", scope: !622, file: !3, line: 378, type: !421)
!667 = !DILocalVariable(name: "outer_module_obj", scope: !622, file: !3, line: 379, type: !421)
!668 = !DILocalVariable(name: "i", scope: !622, file: !3, line: 380, type: !641)
!669 = !DILocalVariable(name: "mod_name", scope: !670, file: !3, line: 384, type: !525)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 382, column: 48)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 382, column: 13)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 381, column: 36)
!673 = distinct !DILexicalBlock(scope: !674, file: !3, line: 381, column: 5)
!674 = distinct !DILexicalBlock(scope: !622, file: !3, line: 381, column: 5)
!675 = !DILocalVariable(name: "stat", scope: !670, file: !3, line: 389, type: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_import_stat_t", file: !247, line: 186, baseType: !246)
!677 = !DILocalVariable(name: "o", scope: !678, file: !3, line: 445, type: !682)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 444, column: 96)
!679 = distinct !DILexicalBlock(scope: !680, file: !3, line: 444, column: 21)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 431, column: 44)
!681 = distinct !DILexicalBlock(scope: !670, file: !3, line: 431, column: 17)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !240, line: 831, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !240, line: 828, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !684, file: !240, line: 829, baseType: !443, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !684, file: !240, line: 830, baseType: !688, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !240, line: 778, baseType: !573)
!690 = !DILocalVariable(name: "orig_path_len", scope: !691, file: !3, line: 460, type: !434)
!691 = distinct !DILexicalBlock(scope: !692, file: !3, line: 455, column: 49)
!692 = distinct !DILexicalBlock(scope: !680, file: !3, line: 455, column: 21)
!693 = !DILocalVariable(name: "s", scope: !694, file: !3, line: 482, type: !525)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 481, column: 50)
!695 = distinct !DILexicalBlock(scope: !670, file: !3, line: 481, column: 17)
!696 = !DILocation(line: 266, column: 39, scope: !622)
!697 = !DILocation(line: 266, column: 63, scope: !622)
!698 = !DILocation(line: 276, column: 28, scope: !622)
!699 = !DILocation(line: 276, column: 14, scope: !622)
!700 = !DILocation(line: 277, column: 14, scope: !622)
!701 = !DILocation(line: 278, column: 14, scope: !622)
!702 = !DILocation(line: 279, column: 16, scope: !703)
!703 = distinct !DILexicalBlock(scope: !622, file: !3, line: 279, column: 9)
!704 = !DILocation(line: 279, column: 9, scope: !622)
!705 = !DILocation(line: 280, column: 21, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !3, line: 279, column: 22)
!707 = !DILocation(line: 281, column: 20, scope: !708)
!708 = distinct !DILexicalBlock(scope: !706, file: !3, line: 281, column: 13)
!709 = !DILocation(line: 281, column: 13, scope: !706)
!710 = !DILocation(line: 282, column: 21, scope: !711)
!711 = distinct !DILexicalBlock(scope: !708, file: !3, line: 281, column: 26)
!712 = !DILocation(line: 283, column: 23, scope: !713)
!713 = distinct !DILexicalBlock(scope: !711, file: !3, line: 283, column: 17)
!714 = !DILocation(line: 283, column: 17, scope: !711)
!715 = !DILocation(line: 284, column: 17, scope: !716)
!716 = distinct !DILexicalBlock(scope: !713, file: !3, line: 283, column: 28)
!717 = !DILocation(line: 0, scope: !622)
!718 = !DILocation(line: 289, column: 5, scope: !622)
!719 = !DILocation(line: 289, column: 12, scope: !622)
!720 = !DILocation(line: 290, column: 27, scope: !622)
!721 = !DILocation(line: 290, column: 17, scope: !622)
!722 = !DILocation(line: 292, column: 15, scope: !633)
!723 = !DILocation(line: 292, column: 9, scope: !622)
!724 = !DILocation(line: 301, column: 48, scope: !632)
!725 = !DILocation(line: 301, column: 32, scope: !632)
!726 = !DILocation(line: 301, column: 18, scope: !632)
!727 = !DILocation(line: 309, column: 34, scope: !632)
!728 = !DILocation(line: 309, column: 52, scope: !632)
!729 = !DILocation(line: 309, column: 19, scope: !632)
!730 = !DILocation(line: 310, column: 31, scope: !632)
!731 = !DILocation(line: 310, column: 24, scope: !632)
!732 = !DILocation(line: 311, column: 29, scope: !632)
!733 = !DILocation(line: 320, column: 9, scope: !632)
!734 = !DILocation(line: 320, column: 16, scope: !632)
!735 = !DILocation(line: 321, column: 33, scope: !632)
!736 = !DILocation(line: 321, column: 21, scope: !632)
!737 = !DILocation(line: 323, column: 9, scope: !632)
!738 = !DILocation(line: 323, column: 37, scope: !632)
!739 = !{!740, !740, i64 0}
!740 = !{!"long", !617, i64 0}
!741 = !DILocation(line: 323, column: 35, scope: !632)
!742 = !DILocation(line: 323, column: 21, scope: !632)
!743 = !DILocation(line: 324, column: 13, scope: !632)
!744 = !DILocation(line: 327, column: 13, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 324, column: 22)
!746 = distinct !DILexicalBlock(scope: !632, file: !3, line: 324, column: 13)
!747 = !DILocation(line: 328, column: 9, scope: !745)
!748 = !DILocation(line: 0, scope: !632)
!749 = !DILocation(line: 330, column: 9, scope: !632)
!750 = !DILocation(line: 331, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !632, file: !3, line: 330, column: 25)
!752 = distinct !{!752, !749, !753}
!753 = !DILocation(line: 332, column: 9, scope: !632)
!754 = !DILocation(line: 335, column: 13, scope: !755)
!755 = distinct !DILexicalBlock(scope: !632, file: !3, line: 335, column: 13)
!756 = !DILocation(line: 335, column: 15, scope: !755)
!757 = !DILocation(line: 335, column: 13, scope: !632)
!758 = !DILocation(line: 336, column: 33, scope: !759)
!759 = distinct !DILexicalBlock(scope: !755, file: !3, line: 335, column: 29)
!760 = !DILocation(line: 336, column: 13, scope: !759)
!761 = !DILocation(line: 339, column: 27, scope: !632)
!762 = !DILocation(line: 339, column: 35, scope: !632)
!763 = !DILocation(line: 339, column: 92, scope: !632)
!764 = !DILocation(line: 339, column: 96, scope: !632)
!765 = !DILocation(line: 340, column: 25, scope: !632)
!766 = !DILocation(line: 339, column: 14, scope: !632)
!767 = !DILocation(line: 340, column: 15, scope: !632)
!768 = !DILocation(line: 341, column: 9, scope: !632)
!769 = !DILocation(line: 342, column: 13, scope: !770)
!770 = distinct !DILexicalBlock(scope: !632, file: !3, line: 342, column: 13)
!771 = !DILocation(line: 342, column: 21, scope: !770)
!772 = !DILocation(line: 342, column: 13, scope: !632)
!773 = !DILocation(line: 343, column: 13, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !3, line: 342, column: 27)
!775 = !DILocation(line: 343, column: 36, scope: !774)
!776 = !{!617, !617, i64 0}
!777 = !DILocation(line: 344, column: 13, scope: !774)
!778 = !DILocation(line: 345, column: 9, scope: !774)
!779 = !DILocation(line: 347, column: 26, scope: !632)
!780 = !DILocation(line: 347, column: 14, scope: !632)
!781 = !DILocation(line: 350, column: 23, scope: !632)
!782 = !DILocation(line: 351, column: 19, scope: !632)
!783 = !DILocation(line: 352, column: 17, scope: !632)
!784 = !DILocation(line: 353, column: 5, scope: !633)
!785 = !DILocation(line: 353, column: 5, scope: !632)
!786 = !DILocation(line: 356, column: 29, scope: !622)
!787 = !DILocation(line: 356, column: 10, scope: !622)
!788 = !DILocation(line: 357, column: 27, scope: !622)
!789 = !DILocation(line: 357, column: 14, scope: !622)
!790 = !DILocation(line: 358, column: 20, scope: !651)
!791 = !DILocation(line: 358, column: 9, scope: !622)
!792 = !DILocation(line: 361, column: 19, scope: !650)
!793 = !DILocation(line: 361, column: 15, scope: !650)
!794 = !DILocation(line: 362, column: 15, scope: !795)
!795 = distinct !DILexicalBlock(scope: !650, file: !3, line: 362, column: 13)
!796 = !DILocation(line: 366, column: 23, scope: !797)
!797 = distinct !DILexicalBlock(scope: !650, file: !3, line: 366, column: 13)
!798 = !DILocation(line: 362, column: 13, scope: !650)
!799 = !DILocation(line: 370, column: 51, scope: !650)
!800 = !DILocation(line: 370, column: 25, scope: !650)
!801 = !DILocation(line: 370, column: 14, scope: !650)
!802 = !DILocation(line: 371, column: 16, scope: !650)
!803 = !DILocation(line: 375, column: 10, scope: !622)
!804 = !DILocation(line: 376, column: 5, scope: !622)
!805 = !DILocation(line: 378, column: 14, scope: !622)
!806 = !DILocation(line: 379, column: 14, scope: !622)
!807 = !DILocation(line: 380, column: 10, scope: !622)
!808 = !DILocation(line: 381, column: 22, scope: !673)
!809 = !DILocation(line: 381, column: 19, scope: !673)
!810 = !DILocation(line: 381, column: 5, scope: !674)
!811 = !DILocation(line: 382, column: 15, scope: !671)
!812 = !DILocation(line: 382, column: 26, scope: !671)
!813 = !DILocation(line: 382, column: 29, scope: !671)
!814 = !DILocation(line: 382, column: 40, scope: !671)
!815 = !DILocation(line: 382, column: 13, scope: !672)
!816 = !DILocation(line: 384, column: 29, scope: !670)
!817 = !DILocation(line: 384, column: 18, scope: !670)
!818 = !DILocation(line: 390, column: 17, scope: !819)
!819 = distinct !DILexicalBlock(scope: !670, file: !3, line: 390, column: 17)
!820 = !DILocation(line: 390, column: 33, scope: !819)
!821 = !DILocation(line: 390, column: 17, scope: !670)
!822 = !DILocation(line: 393, column: 24, scope: !823)
!823 = distinct !DILexicalBlock(scope: !819, file: !3, line: 390, column: 39)
!824 = !DILocation(line: 389, column: 30, scope: !670)
!825 = !DILocation(line: 394, column: 13, scope: !823)
!826 = !DILocation(line: 396, column: 17, scope: !827)
!827 = distinct !DILexicalBlock(scope: !819, file: !3, line: 394, column: 20)
!828 = !DILocation(line: 397, column: 46, scope: !827)
!829 = !DILocation(line: 397, column: 56, scope: !827)
!830 = !DILocation(line: 397, column: 54, scope: !827)
!831 = !DILocation(line: 397, column: 17, scope: !827)
!832 = !DILocation(line: 398, column: 24, scope: !827)
!833 = !DILocation(line: 0, scope: !827)
!834 = !DILocation(line: 402, column: 22, scope: !835)
!835 = distinct !DILexicalBlock(scope: !670, file: !3, line: 402, column: 17)
!836 = !DILocation(line: 402, column: 17, scope: !670)
!837 = !DILocation(line: 420, column: 46, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !3, line: 419, column: 83)
!839 = distinct !DILexicalBlock(scope: !840, file: !3, line: 419, column: 25)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 416, column: 17)
!841 = distinct !DILexicalBlock(scope: !835, file: !3, line: 402, column: 50)
!842 = !DILocation(line: 420, column: 25, scope: !838)
!843 = !DILocation(line: 428, column: 30, scope: !844)
!844 = distinct !DILexicalBlock(scope: !835, file: !3, line: 426, column: 20)
!845 = !DILocation(line: 431, column: 28, scope: !681)
!846 = !DILocation(line: 431, column: 17, scope: !670)
!847 = !DILocation(line: 434, column: 30, scope: !680)
!848 = !DILocation(line: 444, column: 26, scope: !679)
!849 = !DILocation(line: 444, column: 23, scope: !679)
!850 = !DILocation(line: 444, column: 34, scope: !679)
!851 = !DILocation(line: 444, column: 73, scope: !679)
!852 = !DILocation(line: 445, column: 38, scope: !678)
!853 = !DILocation(line: 446, column: 39, scope: !678)
!854 = !{!855, !616, i64 8}
!855 = !{!"_mp_obj_module_t", !856, i64 0, !616, i64 8}
!856 = !{!"_mp_obj_base_t", !616, i64 0}
!857 = !DILocation(line: 446, column: 21, scope: !678)
!858 = !DILocation(line: 455, column: 21, scope: !680)
!859 = !DILocation(line: 455, column: 26, scope: !692)
!860 = !DILocation(line: 459, column: 80, scope: !691)
!861 = !DILocation(line: 459, column: 97, scope: !691)
!862 = !DILocation(line: 459, column: 65, scope: !691)
!863 = !DILocation(line: 459, column: 21, scope: !691)
!864 = !DILocation(line: 460, column: 49, scope: !691)
!865 = !{!866, !740, i64 8}
!866 = !{!"_vstr_t", !740, i64 0, !740, i64 8, !616, i64 16, !867, i64 24}
!867 = !{!"_Bool", !617, i64 0}
!868 = !DILocation(line: 460, column: 28, scope: !691)
!869 = !DILocation(line: 461, column: 21, scope: !691)
!870 = !DILocation(line: 462, column: 21, scope: !691)
!871 = !DILocation(line: 463, column: 25, scope: !872)
!872 = distinct !DILexicalBlock(scope: !691, file: !3, line: 463, column: 25)
!873 = !DILocation(line: 463, column: 52, scope: !872)
!874 = !DILocation(line: 463, column: 25, scope: !691)
!875 = !DILocation(line: 466, column: 25, scope: !876)
!876 = distinct !DILexicalBlock(scope: !872, file: !3, line: 465, column: 28)
!877 = !DILocation(line: 468, column: 30, scope: !691)
!878 = !DILocation(line: 469, column: 17, scope: !691)
!879 = !DILocation(line: 470, column: 21, scope: !880)
!880 = distinct !DILexicalBlock(scope: !692, file: !3, line: 469, column: 24)
!881 = !DILocation(line: 479, column: 17, scope: !680)
!882 = !DILocation(line: 480, column: 13, scope: !680)
!883 = !DILocation(line: 0, scope: !844)
!884 = !DILocation(line: 481, column: 34, scope: !695)
!885 = !DILocation(line: 481, column: 17, scope: !670)
!886 = !DILocation(line: 482, column: 49, scope: !694)
!887 = !DILocation(line: 482, column: 59, scope: !694)
!888 = !DILocation(line: 482, column: 57, scope: !694)
!889 = !DILocation(line: 482, column: 26, scope: !694)
!890 = !DILocation(line: 482, column: 22, scope: !694)
!891 = !DILocation(line: 483, column: 17, scope: !694)
!892 = !DILocation(line: 487, column: 42, scope: !694)
!893 = !DILocation(line: 487, column: 21, scope: !694)
!894 = !DILocation(line: 486, column: 17, scope: !694)
!895 = !DILocation(line: 488, column: 13, scope: !694)
!896 = !DILocation(line: 490, column: 32, scope: !897)
!897 = distinct !DILexicalBlock(scope: !670, file: !3, line: 490, column: 17)
!898 = !DILocation(line: 490, column: 17, scope: !670)
!899 = !DILocation(line: 493, column: 22, scope: !670)
!900 = !DILocation(line: 494, column: 9, scope: !670)
!901 = !DILocation(line: 381, column: 32, scope: !673)
!902 = !DILocation(line: 381, column: 17, scope: !673)
!903 = distinct !{!903, !810, !904}
!904 = !DILocation(line: 495, column: 5, scope: !674)
!905 = !DILocation(line: 0, scope: !680)
!906 = !DILocation(line: 0, scope: !907)
!907 = distinct !DILexicalBlock(scope: !897, file: !3, line: 490, column: 48)
!908 = !DILocation(line: 498, column: 19, scope: !909)
!909 = distinct !DILexicalBlock(scope: !622, file: !3, line: 498, column: 9)
!910 = !DILocation(line: 502, column: 5, scope: !622)
!911 = !DILocation(line: 503, column: 1, scope: !622)
!912 = !DILocation(line: 0, scope: !913)
!913 = distinct !DILexicalBlock(scope: !909, file: !3, line: 498, column: 37)
!914 = distinct !DISubprogram(name: "mp_globals_get", scope: !915, file: !915, line: 89, type: !916, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !918)
!915 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!916 = !DISubroutineType(types: !917)
!917 = !{!688}
!918 = !{}
!919 = !DILocation(line: 89, column: 60, scope: !914)
!920 = !{!921, !616, i64 16}
!921 = !{!"_mp_state_ctx_t", !922, i64 0, !923, i64 32, !928, i64 336}
!922 = !{!"_mp_state_thread_t", !616, i64 0, !616, i64 8, !616, i64 16, !616, i64 24}
!923 = !{!"_mp_state_vm_t", !616, i64 0, !924, i64 8, !924, i64 40, !925, i64 72, !616, i64 104, !925, i64 112, !927, i64 144, !927, i64 176, !617, i64 208, !616, i64 272, !740, i64 280, !740, i64 288, !740, i64 296}
!924 = !{!"_mp_obj_exception_t", !856, i64 0, !740, i64 8, !740, i64 12, !616, i64 16, !616, i64 24}
!925 = !{!"_mp_obj_dict_t", !856, i64 0, !926, i64 8}
!926 = !{!"_mp_map_t", !740, i64 0, !740, i64 0, !740, i64 0, !740, i64 0, !740, i64 0, !740, i64 8, !616, i64 16}
!927 = !{!"_mp_obj_list_t", !856, i64 0, !740, i64 8, !740, i64 16, !616, i64 24}
!928 = !{!"_mp_state_mem_t", !616, i64 0, !740, i64 8, !616, i64 16, !616, i64 24, !616, i64 32, !929, i64 40, !617, i64 48, !930, i64 560, !867, i64 562, !740, i64 568, !740, i64 576, !616, i64 584}
!929 = !{!"int", !617, i64 0}
!930 = !{!"short", !617, i64 0}
!931 = !DILocation(line: 89, column: 53, scope: !914)
!932 = distinct !DISubprogram(name: "chop_component", scope: !3, file: !3, line: 255, type: !933, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !936)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !475, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!936 = !{!937, !938, !939}
!937 = !DILocalVariable(name: "start", arg: 1, scope: !932, file: !3, line: 255, type: !475)
!938 = !DILocalVariable(name: "end", arg: 2, scope: !932, file: !3, line: 255, type: !935)
!939 = !DILocalVariable(name: "p", scope: !932, file: !3, line: 256, type: !475)
!940 = !DILocation(line: 255, column: 40, scope: !932)
!941 = !DILocation(line: 255, column: 60, scope: !932)
!942 = !DILocation(line: 256, column: 21, scope: !932)
!943 = !DILocation(line: 256, column: 17, scope: !932)
!944 = !DILocation(line: 257, column: 5, scope: !932)
!945 = !DILocation(line: 0, scope: !946)
!946 = distinct !DILexicalBlock(scope: !947, file: !3, line: 258, column: 13)
!947 = distinct !DILexicalBlock(scope: !932, file: !3, line: 257, column: 23)
!948 = !DILocation(line: 257, column: 14, scope: !932)
!949 = !DILocation(line: 258, column: 14, scope: !946)
!950 = !DILocation(line: 258, column: 13, scope: !946)
!951 = !DILocation(line: 258, column: 18, scope: !946)
!952 = !DILocation(line: 258, column: 13, scope: !947)
!953 = distinct !{!953, !944, !954}
!954 = !DILocation(line: 262, column: 5, scope: !932)
!955 = !DILocation(line: 0, scope: !956)
!956 = distinct !DILexicalBlock(scope: !946, file: !3, line: 258, column: 26)
!957 = !DILocation(line: 264, column: 1, scope: !932)
!958 = distinct !DISubprogram(name: "vstr_len", scope: !642, file: !642, line: 180, type: !959, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{!434, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!962 = !{!963}
!963 = !DILocalVariable(name: "vstr", arg: 1, scope: !958, file: !642, line: 180, type: !961)
!964 = !DILocation(line: 180, column: 39, scope: !958)
!965 = !DILocation(line: 180, column: 60, scope: !958)
!966 = !DILocation(line: 180, column: 47, scope: !958)
!967 = distinct !DISubprogram(name: "find_file", scope: !3, file: !3, line: 106, type: !968, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!676, !475, !641, !961}
!970 = !{!971, !972, !973}
!971 = !DILocalVariable(name: "file_str", arg: 1, scope: !967, file: !3, line: 106, type: !475)
!972 = !DILocalVariable(name: "file_len", arg: 2, scope: !967, file: !3, line: 106, type: !641)
!973 = !DILocalVariable(name: "dest", arg: 3, scope: !967, file: !3, line: 106, type: !961)
!974 = !DILocation(line: 106, column: 47, scope: !967)
!975 = !DILocation(line: 106, column: 62, scope: !967)
!976 = !DILocation(line: 106, column: 80, scope: !967)
!977 = !DILocation(line: 116, column: 39, scope: !967)
!978 = !DILocation(line: 116, column: 9, scope: !967)
!979 = !DILocation(line: 117, column: 16, scope: !967)
!980 = !DILocation(line: 117, column: 9, scope: !967)
!981 = distinct !DISubprogram(name: "stat_dir_or_file", scope: !3, file: !3, line: 94, type: !982, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{!676, !961}
!984 = !{!985, !986}
!985 = !DILocalVariable(name: "path", arg: 1, scope: !981, file: !3, line: 94, type: !961)
!986 = !DILocalVariable(name: "stat", scope: !981, file: !3, line: 95, type: !676)
!987 = !DILocation(line: 94, column: 50, scope: !981)
!988 = !DILocation(line: 95, column: 48, scope: !981)
!989 = !DILocation(line: 95, column: 29, scope: !981)
!990 = !DILocation(line: 95, column: 22, scope: !981)
!991 = !DILocation(line: 97, column: 14, scope: !992)
!992 = distinct !DILexicalBlock(scope: !981, file: !3, line: 97, column: 9)
!993 = !DILocation(line: 97, column: 9, scope: !981)
!994 = !DILocation(line: 102, column: 5, scope: !981)
!995 = !DILocation(line: 103, column: 12, scope: !981)
!996 = !DILocation(line: 103, column: 5, scope: !981)
!997 = !DILocation(line: 0, scope: !981)
!998 = !DILocation(line: 104, column: 1, scope: !981)
!999 = distinct !DISubprogram(name: "vstr_str", scope: !642, file: !642, line: 179, type: !1000, isLocal: true, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1002)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!645, !961}
!1002 = !{!1003}
!1003 = !DILocalVariable(name: "vstr", arg: 1, scope: !999, file: !642, line: 179, type: !961)
!1004 = !DILocation(line: 179, column: 38, scope: !999)
!1005 = !DILocation(line: 179, column: 59, scope: !999)
!1006 = !{!866, !616, i64 16}
!1007 = !DILocation(line: 179, column: 46, scope: !999)
!1008 = distinct !DISubprogram(name: "stat_file_py_or_mpy", scope: !3, file: !3, line: 77, type: !982, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1009)
!1009 = !{!1010, !1011}
!1010 = !DILocalVariable(name: "path", arg: 1, scope: !1008, file: !3, line: 77, type: !961)
!1011 = !DILocalVariable(name: "stat", scope: !1008, file: !3, line: 78, type: !676)
!1012 = !DILocation(line: 77, column: 53, scope: !1008)
!1013 = !DILocation(line: 78, column: 48, scope: !1008)
!1014 = !DILocation(line: 78, column: 29, scope: !1008)
!1015 = !DILocation(line: 78, column: 22, scope: !1008)
!1016 = !DILocation(line: 79, column: 14, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 79, column: 9)
!1018 = !DILocation(line: 80, column: 9, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 79, column: 38)
!1020 = !DILocation(line: 92, column: 1, scope: !1008)
!1021 = distinct !DISubprogram(name: "do_load", scope: !3, file: !3, line: 194, type: !1022, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1024)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{null, !421, !961}
!1024 = !{!1025, !1026, !1027, !1028, !1031, !1032}
!1025 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1021, file: !3, line: 194, type: !421)
!1026 = !DILocalVariable(name: "file", arg: 2, scope: !1021, file: !3, line: 194, type: !961)
!1027 = !DILocalVariable(name: "file_str", scope: !1021, file: !3, line: 196, type: !645)
!1028 = !DILocalVariable(name: "modref", scope: !1029, file: !3, line: 206, type: !422)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 202, column: 56)
!1030 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 200, column: 9)
!1031 = !DILocalVariable(name: "frozen_type", scope: !1029, file: !3, line: 207, type: !566)
!1032 = !DILocalVariable(name: "lex", scope: !1033, file: !3, line: 244, type: !1034)
!1033 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 243, column: 5)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !247, line: 168, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !247, line: 148, size: 1280, elements: !1037)
!1037 = !{!1038, !1039, !1053, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1069}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !1036, file: !247, line: 149, baseType: !525, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !1036, file: !247, line: 150, baseType: !1040, size: 192, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !1041, line: 40, baseType: !1042)
!1041 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !1041, line: 36, size: 192, elements: !1043)
!1043 = !{!1044, !1045, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1042, file: !1041, line: 37, baseType: !422, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !1042, file: !1041, line: 38, baseType: !1046, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!430, !422}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1042, file: !1041, line: 39, baseType: !1050, size: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !422}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !1036, file: !247, line: 152, baseType: !1054, size: 32, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !642, line: 131, baseType: !641)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !1036, file: !247, line: 152, baseType: !1054, size: 32, offset: 288)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !1036, file: !247, line: 152, baseType: !1054, size: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1036, file: !247, line: 154, baseType: !434, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !1036, file: !247, line: 155, baseType: !434, size: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !1036, file: !247, line: 157, baseType: !423, size: 64, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !1036, file: !247, line: 158, baseType: !423, size: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !1036, file: !247, line: 160, baseType: !434, size: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !1036, file: !247, line: 161, baseType: !434, size: 64, offset: 704)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !1036, file: !247, line: 162, baseType: !1064, size: 64, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !1036, file: !247, line: 164, baseType: !434, size: 64, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !1036, file: !247, line: 165, baseType: !434, size: 64, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !1036, file: !247, line: 166, baseType: !1068, size: 32, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !247, line: 144, baseType: !321)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !1036, file: !247, line: 167, baseType: !655, size: 256, offset: 1024)
!1070 = !DILocation(line: 194, column: 30, scope: !1021)
!1071 = !DILocation(line: 194, column: 50, scope: !1021)
!1072 = !DILocation(line: 196, column: 22, scope: !1021)
!1073 = !DILocation(line: 196, column: 11, scope: !1021)
!1074 = !DILocation(line: 200, column: 9, scope: !1030)
!1075 = !DILocation(line: 202, column: 50, scope: !1030)
!1076 = !DILocation(line: 200, column: 9, scope: !1021)
!1077 = !DILocation(line: 206, column: 9, scope: !1029)
!1078 = !DILocation(line: 207, column: 58, scope: !1029)
!1079 = !DILocation(line: 207, column: 99, scope: !1029)
!1080 = !DILocation(line: 207, column: 103, scope: !1029)
!1081 = !DILocation(line: 206, column: 15, scope: !1029)
!1082 = !DILocation(line: 207, column: 27, scope: !1029)
!1083 = !DILocation(line: 207, column: 13, scope: !1029)
!1084 = !DILocation(line: 222, column: 25, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 222, column: 13)
!1086 = !DILocation(line: 222, column: 13, scope: !1029)
!1087 = !DILocation(line: 223, column: 45, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 222, column: 43)
!1089 = !DILocation(line: 223, column: 13, scope: !1088)
!1090 = !DILocation(line: 228, column: 5, scope: !1030)
!1091 = !DILocation(line: 244, column: 27, scope: !1033)
!1092 = !DILocation(line: 244, column: 21, scope: !1033)
!1093 = !DILocation(line: 245, column: 9, scope: !1033)
!1094 = !DILocation(line: 253, column: 1, scope: !1021)
!1095 = distinct !DISubprogram(name: "mp_import_stat_any", scope: !3, file: !3, line: 63, type: !1096, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1098)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!676, !475}
!1098 = !{!1099, !1100}
!1099 = !DILocalVariable(name: "path", arg: 1, scope: !1095, file: !3, line: 63, type: !475)
!1100 = !DILocalVariable(name: "st", scope: !1101, file: !3, line: 68, type: !676)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 67, column: 56)
!1102 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 65, column: 9)
!1103 = !DILocation(line: 63, column: 56, scope: !1095)
!1104 = !DILocation(line: 65, column: 9, scope: !1102)
!1105 = !DILocation(line: 67, column: 50, scope: !1102)
!1106 = !DILocation(line: 65, column: 9, scope: !1095)
!1107 = !DILocation(line: 68, column: 51, scope: !1101)
!1108 = !DILocation(line: 68, column: 31, scope: !1101)
!1109 = !DILocation(line: 68, column: 26, scope: !1101)
!1110 = !DILocation(line: 69, column: 16, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 69, column: 13)
!1112 = !DILocation(line: 74, column: 12, scope: !1095)
!1113 = !DILocation(line: 74, column: 5, scope: !1095)
!1114 = !DILocation(line: 0, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 69, column: 44)
!1116 = !DILocation(line: 75, column: 1, scope: !1095)
!1117 = distinct !DISubprogram(name: "do_execute_raw_code", scope: !3, file: !3, line: 158, type: !1118, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1148)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !421, !1120, !475}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !1122, line: 62, baseType: !1123)
!1122 = !DIFile(filename: "../../py/emitglue.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !1122, line: 42, size: 256, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1123, file: !1122, line: 43, baseType: !430, size: 3, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !1123, file: !1122, line: 44, baseType: !430, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !1123, file: !1122, line: 45, baseType: !430, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !1122, line: 61, baseType: !1129, size: 192, offset: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1123, file: !1122, line: 46, size: 192, elements: !1130)
!1130 = !{!1131, !1142}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !1129, file: !1122, line: 55, baseType: !1132, size: 128)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1129, file: !1122, line: 47, size: 128, elements: !1133)
!1133 = !{!1134, !1139}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !1132, file: !1122, line: 48, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !642, line: 39, baseType: !1138)
!1138 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !1132, file: !1122, line: 49, baseType: !1140, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !1129, file: !1122, line: 60, baseType: !1143, size: 192)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1129, file: !1122, line: 56, size: 192, elements: !1144)
!1144 = !{!1145, !1146, !1147}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !1143, file: !1122, line: 57, baseType: !422, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !1143, file: !1122, line: 58, baseType: !1140, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !1143, file: !1122, line: 59, baseType: !430, size: 64, offset: 128)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1155, !1156, !1170}
!1149 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1117, file: !3, line: 158, type: !421)
!1150 = !DILocalVariable(name: "raw_code", arg: 2, scope: !1117, file: !3, line: 158, type: !1120)
!1151 = !DILocalVariable(name: "filename", arg: 3, scope: !1117, file: !3, line: 158, type: !475)
!1152 = !DILocalVariable(name: "mod_globals", scope: !1117, file: !3, line: 164, type: !688)
!1153 = !DILocalVariable(name: "old_globals", scope: !1117, file: !3, line: 167, type: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !688)
!1155 = !DILocalVariable(name: "old_locals", scope: !1117, file: !3, line: 168, type: !1154)
!1156 = !DILocalVariable(name: "nlr", scope: !1117, file: !3, line: 174, type: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !1158, line: 72, baseType: !1159)
!1158 = !DIFile(filename: "../../py/nlr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !1158, line: 73, size: 1344, elements: !1160)
!1160 = !{!1161, !1163, !1164}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1159, file: !1158, line: 75, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !1159, file: !1158, line: 76, baseType: !422, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !1159, file: !1158, line: 79, baseType: !1165, size: 1184, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !1166, line: 37, baseType: !1167)
!1166 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/setjmp.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 1184, elements: !1168)
!1168 = !{!1169}
!1169 = !DISubrange(count: 37)
!1170 = !DILocalVariable(name: "module_fun", scope: !1171, file: !3, line: 176, type: !421)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 175, column: 30)
!1172 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 175, column: 9)
!1173 = !DILocation(line: 158, column: 42, scope: !1117)
!1174 = !DILocation(line: 158, column: 69, scope: !1117)
!1175 = !DILocation(line: 158, column: 91, scope: !1117)
!1176 = !DILocation(line: 160, column: 49, scope: !1117)
!1177 = !DILocation(line: 160, column: 5, scope: !1117)
!1178 = !DILocation(line: 164, column: 34, scope: !1117)
!1179 = !DILocation(line: 164, column: 20, scope: !1117)
!1180 = !DILocation(line: 167, column: 5, scope: !1117)
!1181 = !DILocation(line: 167, column: 29, scope: !1117)
!1182 = !DILocation(line: 167, column: 43, scope: !1117)
!1183 = !DILocation(line: 168, column: 5, scope: !1117)
!1184 = !DILocation(line: 168, column: 29, scope: !1117)
!1185 = !DILocation(line: 168, column: 42, scope: !1117)
!1186 = !DILocation(line: 171, column: 5, scope: !1117)
!1187 = !DILocation(line: 172, column: 5, scope: !1117)
!1188 = !DILocation(line: 174, column: 5, scope: !1117)
!1189 = !DILocation(line: 174, column: 15, scope: !1117)
!1190 = !DILocation(line: 175, column: 9, scope: !1172)
!1191 = !DILocation(line: 175, column: 24, scope: !1172)
!1192 = !DILocation(line: 175, column: 9, scope: !1117)
!1193 = !DILocation(line: 176, column: 31, scope: !1171)
!1194 = !DILocation(line: 176, column: 18, scope: !1171)
!1195 = !DILocation(line: 177, column: 9, scope: !1171)
!1196 = !DILocation(line: 180, column: 9, scope: !1171)
!1197 = !DILocation(line: 182, column: 34, scope: !1171)
!1198 = !DILocation(line: 182, column: 13, scope: !1171)
!1199 = !DILocation(line: 181, column: 9, scope: !1171)
!1200 = !DILocation(line: 183, column: 24, scope: !1171)
!1201 = !DILocation(line: 183, column: 9, scope: !1171)
!1202 = !DILocation(line: 184, column: 23, scope: !1171)
!1203 = !DILocation(line: 184, column: 9, scope: !1171)
!1204 = !DILocation(line: 191, column: 1, scope: !1117)
!1205 = !DILocation(line: 187, column: 24, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 185, column: 12)
!1207 = !DILocation(line: 187, column: 9, scope: !1206)
!1208 = !DILocation(line: 188, column: 23, scope: !1206)
!1209 = !DILocation(line: 188, column: 9, scope: !1206)
!1210 = !DILocation(line: 189, column: 22, scope: !1206)
!1211 = !{!1212, !616, i64 8}
!1212 = !{!"_nlr_buf_t", !616, i64 0, !616, i64 8, !617, i64 16}
!1213 = !DILocation(line: 189, column: 9, scope: !1206)
!1214 = distinct !DISubprogram(name: "do_load_from_lexer", scope: !3, file: !3, line: 144, type: !1215, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1217)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{null, !421, !1034}
!1217 = !{!1218, !1219, !1220, !1221}
!1218 = !DILocalVariable(name: "module_obj", arg: 1, scope: !1214, file: !3, line: 144, type: !421)
!1219 = !DILocalVariable(name: "lex", arg: 2, scope: !1214, file: !3, line: 144, type: !1034)
!1220 = !DILocalVariable(name: "source_name", scope: !1214, file: !3, line: 146, type: !525)
!1221 = !DILocalVariable(name: "mod_globals", scope: !1214, file: !3, line: 151, type: !688)
!1222 = !DILocation(line: 144, column: 41, scope: !1214)
