; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/emitbc.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/emitbc.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_singleton_t = type opaque
%struct._mp_emit_method_table_id_ops_t = type { void (%struct._emit_t*, i64, i64, i32)*, void (%struct._emit_t*, i64, i32)* }
%struct._emit_t = type { [10 x i8], i16, i32, %struct._scope_t*, i64, i64, i64, i64*, i64, i64, i64, i64, i8*, i16, i16, i16, i64* }
%struct._scope_t = type { i32, %struct._scope_t*, %struct._scope_t*, i64, i16, i16, %struct._mp_raw_code_t*, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, %struct._id_info_t* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._id_info_t = type { i8, i8, i16, i64 }

@mp_const_ellipsis_obj = external constant %struct._mp_obj_singleton_t, align 1
@mp_emit_bc_method_table_load_id_ops = local_unnamed_addr constant %struct._mp_emit_method_table_id_ops_t { void (%struct._emit_t*, i64, i64, i32)* @mp_emit_bc_load_local, void (%struct._emit_t*, i64, i32)* @mp_emit_bc_load_global }, align 8, !dbg !0
@mp_emit_bc_method_table_store_id_ops = local_unnamed_addr constant %struct._mp_emit_method_table_id_ops_t { void (%struct._emit_t*, i64, i64, i32)* @mp_emit_bc_store_local, void (%struct._emit_t*, i64, i32)* @mp_emit_bc_store_global }, align 8, !dbg !535

!344 = !DIEnumerator(name: "MP_TOKEN_DEL_COMMA", value: 72)
!345 = !DIEnumerator(name: "MP_TOKEN_DEL_COLON", value: 73)
!346 = !DIEnumerator(name: "MP_TOKEN_DEL_PERIOD", value: 74)
!347 = !DIEnumerator(name: "MP_TOKEN_DEL_SEMICOLON", value: 75)
!348 = !DIEnumerator(name: "MP_TOKEN_DEL_AT", value: 76)
!349 = !DIEnumerator(name: "MP_TOKEN_DEL_EQUAL", value: 77)
!350 = !DIEnumerator(name: "MP_TOKEN_DEL_PLUS_EQUAL", value: 78)
!351 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_EQUAL", value: 79)
!352 = !DIEnumerator(name: "MP_TOKEN_DEL_STAR_EQUAL", value: 80)
!353 = !DIEnumerator(name: "MP_TOKEN_DEL_SLASH_EQUAL", value: 81)
!354 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_SLASH_EQUAL", value: 82)
!355 = !DIEnumerator(name: "MP_TOKEN_DEL_PERCENT_EQUAL", value: 83)
!356 = !DIEnumerator(name: "MP_TOKEN_DEL_AMPERSAND_EQUAL", value: 84)
!357 = !DIEnumerator(name: "MP_TOKEN_DEL_PIPE_EQUAL", value: 85)
!358 = !DIEnumerator(name: "MP_TOKEN_DEL_CARET_EQUAL", value: 86)
!359 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_MORE_EQUAL", value: 87)
!360 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88)
!361 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89)
!362 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 47, size: 32, elements: !365)
!364 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!366 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!367 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!368 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!369 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!370 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!371 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!372 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!373 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!374 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!375 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!376 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !364, line: 69, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!379 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!380 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!381 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!382 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!383 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!384 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!385 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!386 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!387 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!388 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!389 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!390 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!391 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!392 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!393 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!394 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!395 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!396 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!397 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!398 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!399 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!400 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!401 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!402 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!403 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!404 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!405 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!406 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!407 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!408 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!409 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!410 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!411 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!412 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!413 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!414 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!415 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!416 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!417 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!418 = !{!419, !516, !433, !527, !522, !529, !435}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "emit_t", file: !6, line: 97, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_emit_t", file: !3, line: 42, size: 896, elements: !422)
!422 = !{!423, !430, !432, !438, !440, !512, !513, !514, !515, !517, !518, !519, !520, !521, !523, !524, !525, !526}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_data", scope: !421, file: !3, line: 46, baseType: !424, size: 80)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 80, elements: !428)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !426, line: 39, baseType: !427)
!426 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!427 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!428 = !{!429}
!429 = !DISubrange(count: 10)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !421, file: !3, line: 48, baseType: !431, size: 8, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "pass_kind_t", file: !6, line: 47, baseType: !5)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_emit_was_return_value", scope: !421, file: !3, line: 49, baseType: !433, size: 8, offset: 88, flags: DIFlagBitField, extraData: i64 80)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !434, line: 71, baseType: !435)
!434 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !436, line: 30, baseType: !437)
!436 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!437 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !421, file: !3, line: 51, baseType: !439, size: 32, offset: 96)
!439 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !421, file: !3, line: 53, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_t", file: !13, line: 88, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_scope_t", file: !13, line: 69, size: 640, elements: !444)
!444 = !{!445, !447, !449, !450, !453, !457, !458, !486, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !443, file: !13, line: 70, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_kind_t", file: !13, line: 67, baseType: !12)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !443, file: !13, line: 71, baseType: !448, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !13, line: 72, baseType: !448, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !443, file: !13, line: 73, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !452, line: 52, baseType: !435)
!452 = !DIFile(filename: "../../py/parse.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!453 = !DIDerivedType(tag: DW_TAG_member, name: "source_file", scope: !443, file: !13, line: 74, baseType: !454, size: 16, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !455, line: 31, baseType: !456)
!455 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "simple_name", scope: !443, file: !13, line: 75, baseType: !454, size: 16, offset: 272)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "raw_code", scope: !443, file: !13, line: 76, baseType: !459, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !461, line: 62, baseType: !462)
!461 = !DIFile(filename: "../../py/emitglue.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !461, line: 42, size: 256, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !462, file: !461, line: 43, baseType: !433, size: 3, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !462, file: !461, line: 44, baseType: !433, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !462, file: !461, line: 45, baseType: !433, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !462, file: !461, line: 61, baseType: !468, size: 192, offset: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !461, line: 46, size: 192, elements: !469)
!469 = !{!470, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !468, file: !461, line: 55, baseType: !471, size: 128)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !461, line: 47, size: 128, elements: !472)
!472 = !{!473, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !471, file: !461, line: 48, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !471, file: !461, line: 49, baseType: !477, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !468, file: !461, line: 60, baseType: !480, size: 192)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !461, line: 56, size: 192, elements: !481)
!481 = !{!482, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !480, file: !461, line: 57, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !480, file: !461, line: 58, baseType: !477, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !480, file: !461, line: 59, baseType: !433, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !443, file: !13, line: 77, baseType: !487, size: 8, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !488, line: 31, baseType: !427)
!488 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "emit_options", scope: !443, file: !13, line: 78, baseType: !487, size: 8, offset: 392)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "num_pos_args", scope: !443, file: !13, line: 79, baseType: !454, size: 16, offset: 400)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_kwonly_args", scope: !443, file: !13, line: 80, baseType: !454, size: 16, offset: 416)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "num_def_pos_args", scope: !443, file: !13, line: 81, baseType: !454, size: 16, offset: 432)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_locals", scope: !443, file: !13, line: 82, baseType: !454, size: 16, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !443, file: !13, line: 83, baseType: !454, size: 16, offset: 464)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "exc_stack_size", scope: !443, file: !13, line: 84, baseType: !454, size: 16, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_alloc", scope: !443, file: !13, line: 85, baseType: !454, size: 16, offset: 496)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_len", scope: !443, file: !13, line: 86, baseType: !454, size: 16, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "id_info", scope: !443, file: !13, line: 87, baseType: !499, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_info_t", file: !13, line: 53, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_id_info_t", file: !13, line: 46, size: 128, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !501, file: !13, line: 47, baseType: !487, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !501, file: !13, line: 48, baseType: !487, size: 8, offset: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "local_num", scope: !501, file: !13, line: 51, baseType: !454, size: 16, offset: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !501, file: !13, line: 52, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !31, line: 48, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !511, line: 92, baseType: !437)
!511 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!512 = !DIDerivedType(tag: DW_TAG_member, name: "last_source_line_offset", scope: !421, file: !3, line: 55, baseType: !433, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "last_source_line", scope: !421, file: !3, line: 56, baseType: !433, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_labels", scope: !421, file: !3, line: 58, baseType: !433, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "label_offsets", scope: !421, file: !3, line: 59, baseType: !516, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "code_info_offset", scope: !421, file: !3, line: 61, baseType: !508, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "code_info_size", scope: !421, file: !3, line: 62, baseType: !508, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode_offset", scope: !421, file: !3, line: 63, baseType: !508, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode_size", scope: !421, file: !3, line: 64, baseType: !508, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "code_base", scope: !421, file: !3, line: 65, baseType: !522, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ct_cur_obj", scope: !421, file: !3, line: 68, baseType: !454, size: 16, offset: 768)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ct_num_obj", scope: !421, file: !3, line: 69, baseType: !454, size: 16, offset: 784)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ct_cur_raw_code", scope: !421, file: !3, line: 70, baseType: !454, size: 16, offset: 800)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !421, file: !3, line: 72, baseType: !516, size: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !528, line: 46, baseType: !483)
!528 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !434, line: 70, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !531, line: 32, baseType: !532)
!531 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !511, line: 49, baseType: !533)
!533 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!534 = !{!0, !535, !549}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "mp_emit_bc_method_table_store_id_ops", scope: !2, file: !3, line: 985, type: !537, isLocal: false, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_emit_method_table_id_ops_t", file: !6, line: 102, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_emit_method_table_id_ops_t", file: !6, line: 99, size: 128, elements: !540)
!540 = !{!541, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !539, file: !6, line: 100, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !419, !507, !433, !439}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !539, file: !6, line: 101, baseType: !546, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !419, !507, !439}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "mp_emit_bc_method_table_delete_id_ops", scope: !2, file: !3, line: 990, type: !537, isLocal: false, isDefinition: true)
!551 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!552 = !{i32 2, !"Dwarf Version", i32 4}
!553 = !{i32 2, !"Debug Info Version", i32 3}
!554 = !{i32 1, !"wchar_size", i32 4}
!555 = !{i32 7, !"PIC Level", i32 2}
!556 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!557 = distinct !DISubprogram(name: "emit_bc_new", scope: !3, file: !3, line: 75, type: !558, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{!419}
!560 = !{!561}
!561 = !DILocalVariable(name: "emit", scope: !557, file: !3, line: 76, type: !419)
!562 = !DILocation(line: 76, column: 20, scope: !557)
!563 = !DILocation(line: 76, column: 13, scope: !557)
!564 = !DILocation(line: 77, column: 5, scope: !557)
!565 = distinct !DISubprogram(name: "emit_bc_set_max_num_labels", scope: !3, file: !3, line: 80, type: !566, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !419, !433}
!568 = !{!569, !570}
!569 = !DILocalVariable(name: "emit", arg: 1, scope: !565, file: !3, line: 80, type: !419)
!570 = !DILocalVariable(name: "max_num_labels", arg: 2, scope: !565, file: !3, line: 80, type: !433)
!571 = !DILocation(line: 80, column: 41, scope: !565)
!572 = !DILocation(line: 80, column: 57, scope: !565)
!573 = !DILocation(line: 81, column: 11, scope: !565)
!574 = !DILocation(line: 81, column: 26, scope: !565)
!575 = !{!576, !579, i64 40}
!576 = !{!"_emit_t", !577, i64 0, !577, i64 10, !579, i64 11, !580, i64 12, !581, i64 16, !579, i64 24, !579, i64 32, !579, i64 40, !581, i64 48, !579, i64 56, !579, i64 64, !579, i64 72, !579, i64 80, !581, i64 88, !582, i64 96, !582, i64 98, !582, i64 100, !581, i64 104}
!577 = !{!"omnipotent char", !578, i64 0}
!578 = !{!"Simple C/C++ TBAA"}
!579 = !{!"long", !577, i64 0}
!580 = !{!"int", !577, i64 0}
!581 = !{!"any pointer", !577, i64 0}
!582 = !{!"short", !577, i64 0}
!583 = !DILocation(line: 82, column: 27, scope: !565)
!584 = !DILocation(line: 82, column: 11, scope: !565)
!585 = !DILocation(line: 82, column: 25, scope: !565)
!586 = !{!576, !581, i64 48}
!587 = !DILocation(line: 83, column: 1, scope: !565)
!588 = distinct !DISubprogram(name: "emit_bc_free", scope: !3, file: !3, line: 85, type: !589, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !419}
!591 = !{!592}
!592 = !DILocalVariable(name: "emit", arg: 1, scope: !588, file: !3, line: 85, type: !419)
!593 = !DILocation(line: 85, column: 27, scope: !588)
!594 = !DILocation(line: 86, column: 5, scope: !588)
!595 = !DILocation(line: 87, column: 5, scope: !588)
!596 = !DILocation(line: 88, column: 1, scope: !588)
!597 = distinct !DISubprogram(name: "mp_emit_bc_start_pass", scope: !3, file: !3, line: 309, type: !598, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !419, !431, !441}
!600 = !{!601, !602, !603, !604, !606, !608, !611, !615, !618, !620}
!601 = !DILocalVariable(name: "emit", arg: 1, scope: !597, file: !3, line: 309, type: !419)
