; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/emitbc.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/emitbc.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_singleton_t = type opaque
%struct._mp_emit_method_table_id_ops_t = type { void (%struct._emit_t*, i64, i64, i32)*, void (%struct._emit_t*, i64, i32)* }
%struct._emit_t = type { [10 x i8], i16, i32, %struct._scope_t*, i64, i64, i64, i64*, i64, i64, i64, i64, i8*, i16, i16, i16, i64* }
%struct._scope_t = type { i32, %struct._scope_t*, %struct._scope_t*, i64, i16, i16, %struct._mp_raw_code_t*, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, %struct._id_info_t* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._id_info_t = type { i8, i8, i16, i64 }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@mp_const_ellipsis_obj = external constant %struct._mp_obj_singleton_t, align 1

!361 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88, isUnsigned: true)
!362 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89, isUnsigned: true)
!363 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90, isUnsigned: true)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 47, baseType: !7, size: 32, elements: !366)
!365 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime0.h", directory: "")
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!367 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0, isUnsigned: true)
!368 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2, isUnsigned: true)
!370 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3, isUnsigned: true)
!371 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!372 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!373 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!374 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!375 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!376 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 69, baseType: !7, size: 32, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!380 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!383 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!384 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!385 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!386 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!387 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!388 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!401 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!402 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!403 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!404 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!405 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!406 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!407 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!408 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!409 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!410 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!411 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!412 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!413 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!414 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!415 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!416 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!417 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!418 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!419 = !{!420, !518, !435, !529, !524, !531, !441, !437}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "emit_t", file: !6, line: 97, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_emit_t", file: !423, line: 42, size: 896, elements: !424)
!423 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/emitbc.c", directory: "")
!424 = !{!425, !432, !434, !440, !442, !514, !515, !516, !517, !519, !520, !521, !522, !523, !525, !526, !527, !528}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dummy_data", scope: !422, file: !423, line: 46, baseType: !426, size: 80)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 80, elements: !430)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !428, line: 39, baseType: !429)
!428 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!429 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!430 = !{!431}
!431 = !DISubrange(count: 10)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !422, file: !423, line: 48, baseType: !433, size: 8, offset: 80, flags: DIFlagBitField, extraData: i64 80)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "pass_kind_t", file: !6, line: 47, baseType: !5)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "last_emit_was_return_value", scope: !422, file: !423, line: 49, baseType: !435, size: 8, offset: 88, flags: DIFlagBitField, extraData: i64 80)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !436, line: 70, baseType: !437)
!436 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !438, line: 30, baseType: !439)
!438 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!439 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !422, file: !423, line: 51, baseType: !441, size: 32, offset: 96)
!441 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !422, file: !423, line: 53, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_t", file: !14, line: 88, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_scope_t", file: !14, line: 69, size: 640, elements: !446)
!446 = !{!447, !449, !451, !452, !455, !459, !460, !488, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !445, file: !14, line: 70, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_kind_t", file: !14, line: 67, baseType: !13)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !14, line: 71, baseType: !450, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !14, line: 72, baseType: !450, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !445, file: !14, line: 73, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !454, line: 52, baseType: !437)
!454 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/parse.h", directory: "")
!455 = !DIDerivedType(tag: DW_TAG_member, name: "source_file", scope: !445, file: !14, line: 74, baseType: !456, size: 16, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !457, line: 31, baseType: !458)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!458 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "simple_name", scope: !445, file: !14, line: 75, baseType: !456, size: 16, offset: 272)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "raw_code", scope: !445, file: !14, line: 76, baseType: !461, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !463, line: 62, baseType: !464)
!463 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/emitglue.h", directory: "")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !463, line: 42, size: 256, elements: !465)
!465 = !{!466, !467, !468, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !464, file: !463, line: 43, baseType: !435, size: 3, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !464, file: !463, line: 44, baseType: !435, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !464, file: !463, line: 45, baseType: !435, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !463, line: 61, baseType: !470, size: 192, offset: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !464, file: !463, line: 46, size: 192, elements: !471)
!471 = !{!472, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !470, file: !463, line: 55, baseType: !473, size: 128)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !463, line: 47, size: 128, elements: !474)
!474 = !{!475, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !473, file: !463, line: 48, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !473, file: !463, line: 49, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !470, file: !463, line: 60, baseType: !482, size: 192)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !463, line: 56, size: 192, elements: !483)
!483 = !{!484, !486, !487}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !482, file: !463, line: 57, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !482, file: !463, line: 58, baseType: !479, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !482, file: !463, line: 59, baseType: !435, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !445, file: !14, line: 77, baseType: !489, size: 8, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !490, line: 31, baseType: !429)
!490 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "emit_options", scope: !445, file: !14, line: 78, baseType: !489, size: 8, offset: 392)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "num_pos_args", scope: !445, file: !14, line: 79, baseType: !456, size: 16, offset: 400)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_kwonly_args", scope: !445, file: !14, line: 80, baseType: !456, size: 16, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "num_def_pos_args", scope: !445, file: !14, line: 81, baseType: !456, size: 16, offset: 432)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_locals", scope: !445, file: !14, line: 82, baseType: !456, size: 16, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !445, file: !14, line: 83, baseType: !456, size: 16, offset: 464)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exc_stack_size", scope: !445, file: !14, line: 84, baseType: !456, size: 16, offset: 480)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_alloc", scope: !445, file: !14, line: 85, baseType: !456, size: 16, offset: 496)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_len", scope: !445, file: !14, line: 86, baseType: !456, size: 16, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id_info", scope: !445, file: !14, line: 87, baseType: !501, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_info_t", file: !14, line: 53, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_id_info_t", file: !14, line: 46, size: 128, elements: !504)
!504 = !{!505, !506, !507, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !503, file: !14, line: 47, baseType: !489, size: 8)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !14, line: 48, baseType: !489, size: 8, offset: 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "local_num", scope: !503, file: !14, line: 51, baseType: !456, size: 16, offset: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !503, file: !14, line: 52, baseType: !509, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !32, line: 48, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !511, line: 31, baseType: !512)
!511 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !513, line: 92, baseType: !439)
!513 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "last_source_line_offset", scope: !422, file: !423, line: 55, baseType: !435, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_source_line", scope: !422, file: !423, line: 56, baseType: !435, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_num_labels", scope: !422, file: !423, line: 58, baseType: !435, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "label_offsets", scope: !422, file: !423, line: 59, baseType: !518, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "code_info_offset", scope: !422, file: !423, line: 61, baseType: !510, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "code_info_size", scope: !422, file: !423, line: 62, baseType: !510, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode_offset", scope: !422, file: !423, line: 63, baseType: !510, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode_size", scope: !422, file: !423, line: 64, baseType: !510, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "code_base", scope: !422, file: !423, line: 65, baseType: !524, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ct_cur_obj", scope: !422, file: !423, line: 68, baseType: !456, size: 16, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ct_num_obj", scope: !422, file: !423, line: 69, baseType: !456, size: 16, offset: 784)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ct_cur_raw_code", scope: !422, file: !423, line: 70, baseType: !456, size: 16, offset: 800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !422, file: !423, line: 72, baseType: !518, size: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !530, line: 46, baseType: !485)
!530 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/obj.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !436, line: 69, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !533, line: 32, baseType: !534)
!533 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !513, line: 49, baseType: !535)
!535 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!536 = !{!0, !537, !551}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "mp_emit_bc_method_table_store_id_ops", scope: !2, file: !423, line: 995, type: !539, isLocal: false, isDefinition: true)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_emit_method_table_id_ops_t", file: !6, line: 102, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_emit_method_table_id_ops_t", file: !6, line: 99, size: 128, elements: !542)
!542 = !{!543, !547}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !541, file: !6, line: 100, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !420, !509, !435, !441}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !541, file: !6, line: 101, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !420, !509, !441}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "mp_emit_bc_method_table_delete_id_ops", scope: !2, file: !423, line: 1000, type: !539, isLocal: false, isDefinition: true)
!553 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!554 = !{i32 2, !"Dwarf Version", i32 4}
!555 = !{i32 2, !"Debug Info Version", i32 3}
!556 = !{i32 1, !"wchar_size", i32 4}
!557 = !{i32 7, !"PIC Level", i32 2}
!558 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!559 = distinct !DISubprogram(name: "emit_bc_new", scope: !423, file: !423, line: 75, type: !560, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{!420}
!562 = !{!563}
!563 = !DILocalVariable(name: "emit", scope: !559, file: !423, line: 76, type: !420)
!564 = !DILocation(line: 76, column: 20, scope: !559)
!565 = !DILocation(line: 76, column: 13, scope: !559)
!566 = !DILocation(line: 77, column: 5, scope: !559)
!567 = distinct !DISubprogram(name: "emit_bc_set_max_num_labels", scope: !423, file: !423, line: 80, type: !568, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !420, !435}
!570 = !{!571, !572}
!571 = !DILocalVariable(name: "emit", arg: 1, scope: !567, file: !423, line: 80, type: !420)
!572 = !DILocalVariable(name: "max_num_labels", arg: 2, scope: !567, file: !423, line: 80, type: !435)
!573 = !DILocation(line: 80, column: 41, scope: !567)
!574 = !DILocation(line: 80, column: 57, scope: !567)
!575 = !DILocation(line: 81, column: 11, scope: !567)
!576 = !DILocation(line: 81, column: 26, scope: !567)
!577 = !{!578, !581, i64 40}
!578 = !{!"_emit_t", !579, i64 0, !579, i64 10, !581, i64 11, !582, i64 12, !583, i64 16, !581, i64 24, !581, i64 32, !581, i64 40, !583, i64 48, !581, i64 56, !581, i64 64, !581, i64 72, !581, i64 80, !583, i64 88, !584, i64 96, !584, i64 98, !584, i64 100, !583, i64 104}
!579 = !{!"omnipotent char", !580, i64 0}
!580 = !{!"Simple C/C++ TBAA"}
!581 = !{!"long", !579, i64 0}
!582 = !{!"int", !579, i64 0}
!583 = !{!"any pointer", !579, i64 0}
!584 = !{!"short", !579, i64 0}
!585 = !DILocation(line: 82, column: 27, scope: !567)
!586 = !DILocation(line: 82, column: 11, scope: !567)
!587 = !DILocation(line: 82, column: 25, scope: !567)
!588 = !{!578, !583, i64 48}
!589 = !DILocation(line: 83, column: 1, scope: !567)
!590 = distinct !DISubprogram(name: "emit_bc_free", scope: !423, file: !423, line: 85, type: !591, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !420}
!593 = !{!594}
!594 = !DILocalVariable(name: "emit", arg: 1, scope: !590, file: !423, line: 85, type: !420)
!595 = !DILocation(line: 85, column: 27, scope: !590)
!596 = !DILocation(line: 86, column: 5, scope: !590)
!597 = !DILocation(line: 87, column: 5, scope: !590)
!598 = !DILocation(line: 88, column: 1, scope: !590)
!599 = distinct !DISubprogram(name: "mp_emit_bc_start_pass", scope: !423, file: !423, line: 319, type: !600, scopeLine: 319, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !420, !433, !443}
!602 = !{!603, !604, !605, !606, !608, !610, !613, !617, !620, !622}
!603 = !DILocalVariable(name: "emit", arg: 1, scope: !599, file: !423, line: 319, type: !420)
