; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/lexer.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/lexer.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!40 = !DIEnumerator(name: "MP_TOKEN_KW_GLOBAL", value: 31, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_TOKEN_KW_IF", value: 32, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_TOKEN_KW_IMPORT", value: 33, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_TOKEN_KW_IN", value: 34, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_TOKEN_KW_IS", value: 35, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_TOKEN_KW_LAMBDA", value: 36, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_TOKEN_KW_NONLOCAL", value: 37, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_TOKEN_KW_NOT", value: 38, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_TOKEN_KW_OR", value: 39, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_TOKEN_KW_PASS", value: 40, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_TOKEN_KW_RAISE", value: 41, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_TOKEN_KW_RETURN", value: 42, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_TOKEN_KW_TRY", value: 43, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_TOKEN_KW_WHILE", value: 44, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_TOKEN_KW_WITH", value: 45, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_TOKEN_KW_YIELD", value: 46, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_TOKEN_OP_PLUS", value: 47, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_TOKEN_OP_MINUS", value: 48, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_TOKEN_OP_STAR", value: 49, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_STAR", value: 50, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_TOKEN_OP_SLASH", value: 51, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_SLASH", value: 52, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_TOKEN_OP_PERCENT", value: 53, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_TOKEN_OP_LESS", value: 54, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_LESS", value: 55, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_TOKEN_OP_MORE", value: 56, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_MORE", value: 57, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_TOKEN_OP_AMPERSAND", value: 58, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_TOKEN_OP_PIPE", value: 59, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_TOKEN_OP_CARET", value: 60, isUnsigned: true)
!70 = !DIEnumerator(name: "MP_TOKEN_OP_TILDE", value: 61, isUnsigned: true)
!71 = !DIEnumerator(name: "MP_TOKEN_OP_LESS_EQUAL", value: 62, isUnsigned: true)
!72 = !DIEnumerator(name: "MP_TOKEN_OP_MORE_EQUAL", value: 63, isUnsigned: true)
!73 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_EQUAL", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "MP_TOKEN_OP_NOT_EQUAL", value: 65, isUnsigned: true)
!75 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_OPEN", value: 66, isUnsigned: true)
!76 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_CLOSE", value: 67, isUnsigned: true)
!77 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_OPEN", value: 68, isUnsigned: true)
!78 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_CLOSE", value: 69, isUnsigned: true)
!79 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_OPEN", value: 70, isUnsigned: true)
!80 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_CLOSE", value: 71, isUnsigned: true)
!81 = !DIEnumerator(name: "MP_TOKEN_DEL_COMMA", value: 72, isUnsigned: true)
!82 = !DIEnumerator(name: "MP_TOKEN_DEL_COLON", value: 73, isUnsigned: true)
!83 = !DIEnumerator(name: "MP_TOKEN_DEL_PERIOD", value: 74, isUnsigned: true)
!84 = !DIEnumerator(name: "MP_TOKEN_DEL_SEMICOLON", value: 75, isUnsigned: true)
!85 = !DIEnumerator(name: "MP_TOKEN_DEL_AT", value: 76, isUnsigned: true)
!86 = !DIEnumerator(name: "MP_TOKEN_DEL_EQUAL", value: 77, isUnsigned: true)
!87 = !DIEnumerator(name: "MP_TOKEN_DEL_PLUS_EQUAL", value: 78, isUnsigned: true)
!88 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_EQUAL", value: 79, isUnsigned: true)
!89 = !DIEnumerator(name: "MP_TOKEN_DEL_STAR_EQUAL", value: 80, isUnsigned: true)
!90 = !DIEnumerator(name: "MP_TOKEN_DEL_SLASH_EQUAL", value: 81, isUnsigned: true)
!91 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_SLASH_EQUAL", value: 82, isUnsigned: true)
!92 = !DIEnumerator(name: "MP_TOKEN_DEL_PERCENT_EQUAL", value: 83, isUnsigned: true)
!93 = !DIEnumerator(name: "MP_TOKEN_DEL_AMPERSAND_EQUAL", value: 84, isUnsigned: true)
!94 = !DIEnumerator(name: "MP_TOKEN_DEL_PIPE_EQUAL", value: 85, isUnsigned: true)
!95 = !DIEnumerator(name: "MP_TOKEN_DEL_CARET_EQUAL", value: 86, isUnsigned: true)
!96 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_MORE_EQUAL", value: 87, isUnsigned: true)
!97 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88, isUnsigned: true)
!98 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89, isUnsigned: true)
!99 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90, isUnsigned: true)
!100 = !{!101, !108, !150, !169, !133, !124}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !6, line: 168, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !6, line: 148, size: 1280, elements: !104)
!104 = !{!105, !113, !132, !136, !137, !138, !139, !140, !146, !147, !148, !149, !154, !155, !156, !158}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !103, file: !6, line: 149, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !107, line: 48, baseType: !108)
!107 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 31, baseType: !110)
!109 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !111, line: 92, baseType: !112)
!111 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !103, file: !6, line: 150, baseType: !114, size: 192, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !115, line: 40, baseType: !116)
!115 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !115, line: 36, size: 192, elements: !117)
!117 = !{!118, !120, !128}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !115, line: 37, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !116, file: !115, line: 38, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !119}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !125, line: 70, baseType: !126)
!125 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !127, line: 30, baseType: !112)
!127 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !116, file: !115, line: 39, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !119}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !103, file: !6, line: 152, baseType: !133, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !134, line: 131, baseType: !135)
!134 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !134, line: 40, baseType: !7)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !103, file: !6, line: 152, baseType: !133, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !103, file: !6, line: 152, baseType: !133, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !103, file: !6, line: 154, baseType: !108, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !103, file: !6, line: 155, baseType: !108, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !103, file: !6, line: 157, baseType: !141, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !125, line: 69, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !143, line: 32, baseType: !144)
!143 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !111, line: 49, baseType: !145)
!145 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !103, file: !6, line: 158, baseType: !141, size: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !103, file: !6, line: 160, baseType: !108, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !103, file: !6, line: 161, baseType: !108, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !103, file: !6, line: 162, baseType: !150, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !152, line: 31, baseType: !153)
!152 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!153 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !103, file: !6, line: 164, baseType: !108, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !103, file: !6, line: 165, baseType: !108, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !103, file: !6, line: 166, baseType: !157, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !6, line: 144, baseType: !5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !103, file: !6, line: 167, baseType: !159, size: 256, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !134, line: 165, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !134, line: 160, size: 256, elements: !161)
!161 = !{!162, !163, !164, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !160, file: !134, line: 161, baseType: !108, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !134, line: 162, baseType: !108, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !160, file: !134, line: 163, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !160, file: !134, line: 164, baseType: !168, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!168 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !134, line: 39, baseType: !172)
!172 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !{!174, !0, !180}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "tok_enc", scope: !2, file: !176, line: 178, type: !177, isLocal: true, isDefinition: true)
!176 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/lexer.c", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "tok_enc_kind", scope: !2, file: !176, line: 194, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 336, elements: !186)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !185, line: 31, baseType: !172)
!185 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!186 = !{!187}
!187 = !DISubrange(count: 42)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2176, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 34)
!191 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!192 = !{i32 2, !"Dwarf Version", i32 4}
!193 = !{i32 2, !"Debug Info Version", i32 3}
!194 = !{i32 1, !"wchar_size", i32 4}
!195 = !{i32 7, !"PIC Level", i32 2}
!196 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!197 = distinct !DISubprogram(name: "mp_lexer_to_next", scope: !176, file: !176, line: 432, type: !198, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !101}
!200 = !{!201, !202, !203, !208, !213, !214, !216, !219, !221, !224, !227, !229, !230}
!201 = !DILocalVariable(name: "lex", arg: 1, scope: !197, file: !176, line: 432, type: !101)
!202 = !DILocalVariable(name: "had_physical_newline", scope: !197, file: !176, line: 437, type: !168)
!203 = !DILocalVariable(name: "num_spaces", scope: !204, file: !176, line: 454, type: !108)
!204 = distinct !DILexicalBlock(scope: !205, file: !176, line: 451, column: 72)
!205 = distinct !DILexicalBlock(scope: !206, file: !176, line: 451, column: 16)
!206 = distinct !DILexicalBlock(scope: !207, file: !176, line: 447, column: 16)
!207 = distinct !DILexicalBlock(scope: !197, file: !176, line: 443, column: 9)
!208 = !DILocalVariable(name: "is_raw", scope: !209, file: !176, line: 487, type: !168)
!209 = distinct !DILexicalBlock(scope: !210, file: !176, line: 485, column: 12)
!210 = distinct !DILexicalBlock(scope: !211, file: !176, line: 472, column: 41)
!211 = distinct !DILexicalBlock(scope: !212, file: !176, line: 472, column: 16)
!212 = distinct !DILexicalBlock(scope: !205, file: !176, line: 469, column: 16)
!213 = !DILocalVariable(name: "kind", scope: !209, file: !176, line: 488, type: !157)
!214 = !DILocalVariable(name: "n_char", scope: !209, file: !176, line: 489, type: !215)
!215 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!216 = !DILocalVariable(name: "s", scope: !217, file: !176, line: 549, type: !178)
!217 = distinct !DILexicalBlock(scope: !218, file: !176, line: 532, column: 44)
!218 = distinct !DILexicalBlock(scope: !211, file: !176, line: 532, column: 16)
