; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/lexer.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/lexer.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!25 = !DIEnumerator(name: "MP_TOKEN_KW_AND", value: 17)
!26 = !DIEnumerator(name: "MP_TOKEN_KW_AS", value: 18)
!27 = !DIEnumerator(name: "MP_TOKEN_KW_ASSERT", value: 19)
!28 = !DIEnumerator(name: "MP_TOKEN_KW_BREAK", value: 20)
!29 = !DIEnumerator(name: "MP_TOKEN_KW_CLASS", value: 21)
!30 = !DIEnumerator(name: "MP_TOKEN_KW_CONTINUE", value: 22)
!31 = !DIEnumerator(name: "MP_TOKEN_KW_DEF", value: 23)
!32 = !DIEnumerator(name: "MP_TOKEN_KW_DEL", value: 24)
!33 = !DIEnumerator(name: "MP_TOKEN_KW_ELIF", value: 25)
!34 = !DIEnumerator(name: "MP_TOKEN_KW_ELSE", value: 26)
!35 = !DIEnumerator(name: "MP_TOKEN_KW_EXCEPT", value: 27)
!36 = !DIEnumerator(name: "MP_TOKEN_KW_FINALLY", value: 28)
!37 = !DIEnumerator(name: "MP_TOKEN_KW_FOR", value: 29)
!38 = !DIEnumerator(name: "MP_TOKEN_KW_FROM", value: 30)
!39 = !DIEnumerator(name: "MP_TOKEN_KW_GLOBAL", value: 31)
!40 = !DIEnumerator(name: "MP_TOKEN_KW_IF", value: 32)
!41 = !DIEnumerator(name: "MP_TOKEN_KW_IMPORT", value: 33)
!42 = !DIEnumerator(name: "MP_TOKEN_KW_IN", value: 34)
!43 = !DIEnumerator(name: "MP_TOKEN_KW_IS", value: 35)
!44 = !DIEnumerator(name: "MP_TOKEN_KW_LAMBDA", value: 36)
!45 = !DIEnumerator(name: "MP_TOKEN_KW_NONLOCAL", value: 37)
!46 = !DIEnumerator(name: "MP_TOKEN_KW_NOT", value: 38)
!47 = !DIEnumerator(name: "MP_TOKEN_KW_OR", value: 39)
!48 = !DIEnumerator(name: "MP_TOKEN_KW_PASS", value: 40)
!49 = !DIEnumerator(name: "MP_TOKEN_KW_RAISE", value: 41)
!50 = !DIEnumerator(name: "MP_TOKEN_KW_RETURN", value: 42)
!51 = !DIEnumerator(name: "MP_TOKEN_KW_TRY", value: 43)
!52 = !DIEnumerator(name: "MP_TOKEN_KW_WHILE", value: 44)
!53 = !DIEnumerator(name: "MP_TOKEN_KW_WITH", value: 45)
!54 = !DIEnumerator(name: "MP_TOKEN_KW_YIELD", value: 46)
!55 = !DIEnumerator(name: "MP_TOKEN_OP_PLUS", value: 47)
!56 = !DIEnumerator(name: "MP_TOKEN_OP_MINUS", value: 48)
!57 = !DIEnumerator(name: "MP_TOKEN_OP_STAR", value: 49)
!58 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_STAR", value: 50)
!59 = !DIEnumerator(name: "MP_TOKEN_OP_SLASH", value: 51)
!60 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_SLASH", value: 52)
!61 = !DIEnumerator(name: "MP_TOKEN_OP_PERCENT", value: 53)
!62 = !DIEnumerator(name: "MP_TOKEN_OP_LESS", value: 54)
!63 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_LESS", value: 55)
!64 = !DIEnumerator(name: "MP_TOKEN_OP_MORE", value: 56)
!65 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_MORE", value: 57)
!66 = !DIEnumerator(name: "MP_TOKEN_OP_AMPERSAND", value: 58)
!67 = !DIEnumerator(name: "MP_TOKEN_OP_PIPE", value: 59)
!68 = !DIEnumerator(name: "MP_TOKEN_OP_CARET", value: 60)
!69 = !DIEnumerator(name: "MP_TOKEN_OP_TILDE", value: 61)
!70 = !DIEnumerator(name: "MP_TOKEN_OP_LESS_EQUAL", value: 62)
!71 = !DIEnumerator(name: "MP_TOKEN_OP_MORE_EQUAL", value: 63)
!72 = !DIEnumerator(name: "MP_TOKEN_OP_DBL_EQUAL", value: 64)
!73 = !DIEnumerator(name: "MP_TOKEN_OP_NOT_EQUAL", value: 65)
!74 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_OPEN", value: 66)
!75 = !DIEnumerator(name: "MP_TOKEN_DEL_PAREN_CLOSE", value: 67)
!76 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_OPEN", value: 68)
!77 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACKET_CLOSE", value: 69)
!78 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_OPEN", value: 70)
!79 = !DIEnumerator(name: "MP_TOKEN_DEL_BRACE_CLOSE", value: 71)
!80 = !DIEnumerator(name: "MP_TOKEN_DEL_COMMA", value: 72)
!81 = !DIEnumerator(name: "MP_TOKEN_DEL_COLON", value: 73)
!82 = !DIEnumerator(name: "MP_TOKEN_DEL_PERIOD", value: 74)
!83 = !DIEnumerator(name: "MP_TOKEN_DEL_SEMICOLON", value: 75)
!84 = !DIEnumerator(name: "MP_TOKEN_DEL_AT", value: 76)
!85 = !DIEnumerator(name: "MP_TOKEN_DEL_EQUAL", value: 77)
!86 = !DIEnumerator(name: "MP_TOKEN_DEL_PLUS_EQUAL", value: 78)
!87 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_EQUAL", value: 79)
!88 = !DIEnumerator(name: "MP_TOKEN_DEL_STAR_EQUAL", value: 80)
!89 = !DIEnumerator(name: "MP_TOKEN_DEL_SLASH_EQUAL", value: 81)
!90 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_SLASH_EQUAL", value: 82)
!91 = !DIEnumerator(name: "MP_TOKEN_DEL_PERCENT_EQUAL", value: 83)
!92 = !DIEnumerator(name: "MP_TOKEN_DEL_AMPERSAND_EQUAL", value: 84)
!93 = !DIEnumerator(name: "MP_TOKEN_DEL_PIPE_EQUAL", value: 85)
!94 = !DIEnumerator(name: "MP_TOKEN_DEL_CARET_EQUAL", value: 86)
!95 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_MORE_EQUAL", value: 87)
!96 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_LESS_EQUAL", value: 88)
!97 = !DIEnumerator(name: "MP_TOKEN_DEL_DBL_STAR_EQUAL", value: 89)
!98 = !DIEnumerator(name: "MP_TOKEN_DEL_MINUS_MORE", value: 90)
!99 = !{!100, !107, !150, !169, !132, !123}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !6, line: 168, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !6, line: 148, size: 1280, elements: !103)
!103 = !{!104, !112, !131, !136, !137, !138, !139, !140, !146, !147, !148, !149, !154, !155, !156, !158}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !102, file: !6, line: 149, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !106, line: 48, baseType: !107)
!106 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 31, baseType: !109)
!108 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !110, line: 92, baseType: !111)
!110 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !102, file: !6, line: 150, baseType: !113, size: 192, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !114, line: 40, baseType: !115)
!114 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !114, line: 36, size: 192, elements: !116)
!116 = !{!117, !119, !127}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !114, line: 37, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !115, file: !114, line: 38, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !118}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !126, line: 30, baseType: !111)
!126 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!127 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !115, file: !114, line: 39, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !118}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !102, file: !6, line: 152, baseType: !132, size: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !133, line: 131, baseType: !134)
!133 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !133, line: 40, baseType: !135)
!135 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !102, file: !6, line: 152, baseType: !132, size: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !102, file: !6, line: 152, baseType: !132, size: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !102, file: !6, line: 154, baseType: !107, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !102, file: !6, line: 155, baseType: !107, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !102, file: !6, line: 157, baseType: !141, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !124, line: 70, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !143, line: 32, baseType: !144)
!143 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !110, line: 49, baseType: !145)
!145 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !102, file: !6, line: 158, baseType: !141, size: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !102, file: !6, line: 160, baseType: !107, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !102, file: !6, line: 161, baseType: !107, size: 64, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !102, file: !6, line: 162, baseType: !150, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !152, line: 31, baseType: !153)
!152 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!153 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !102, file: !6, line: 164, baseType: !107, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !102, file: !6, line: 165, baseType: !107, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !102, file: !6, line: 166, baseType: !157, size: 32, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !6, line: 144, baseType: !5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !102, file: !6, line: 167, baseType: !159, size: 256, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !133, line: 165, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !133, line: 160, size: 256, elements: !161)
!161 = !{!162, !163, !164, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !160, file: !133, line: 161, baseType: !107, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !160, file: !133, line: 162, baseType: !107, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !160, file: !133, line: 163, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !160, file: !133, line: 164, baseType: !168, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!168 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !133, line: 39, baseType: !172)
!172 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !{!174, !0, !179}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "tok_enc", scope: !2, file: !3, line: 178, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "tok_enc_kind", scope: !2, file: !3, line: 194, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 336, elements: !185)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !184, line: 31, baseType: !172)
!184 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!185 = !{!186}
!186 = !DISubrange(count: 42)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 2176, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 34)
!190 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!191 = !{i32 2, !"Dwarf Version", i32 4}
!192 = !{i32 2, !"Debug Info Version", i32 3}
!193 = !{i32 1, !"wchar_size", i32 4}
!194 = !{i32 7, !"PIC Level", i32 2}
!195 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!196 = distinct !DISubprogram(name: "mp_lexer_to_next", scope: !3, file: !3, line: 432, type: !197, isLocal: false, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !100}
!199 = !{!200, !201, !202, !207, !212, !213, !215, !218, !220, !223, !226, !228, !229}
!200 = !DILocalVariable(name: "lex", arg: 1, scope: !196, file: !3, line: 432, type: !100)
!201 = !DILocalVariable(name: "had_physical_newline", scope: !196, file: !3, line: 437, type: !168)
!202 = !DILocalVariable(name: "num_spaces", scope: !203, file: !3, line: 454, type: !107)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 451, column: 72)
!204 = distinct !DILexicalBlock(scope: !205, file: !3, line: 451, column: 16)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 447, column: 16)
!206 = distinct !DILexicalBlock(scope: !196, file: !3, line: 443, column: 9)
!207 = !DILocalVariable(name: "is_raw", scope: !208, file: !3, line: 487, type: !168)
!208 = distinct !DILexicalBlock(scope: !209, file: !3, line: 485, column: 12)
!209 = distinct !DILexicalBlock(scope: !210, file: !3, line: 472, column: 41)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 472, column: 16)
!211 = distinct !DILexicalBlock(scope: !204, file: !3, line: 469, column: 16)
!212 = !DILocalVariable(name: "kind", scope: !208, file: !3, line: 488, type: !157)
!213 = !DILocalVariable(name: "n_char", scope: !208, file: !3, line: 489, type: !214)
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DILocalVariable(name: "s", scope: !216, file: !3, line: 549, type: !177)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 532, column: 44)
!217 = distinct !DILexicalBlock(scope: !210, file: !3, line: 532, column: 16)
