; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }
%struct._mp_parse_t = type { i64, %struct._mp_parse_chunk_t* }
%struct._mp_parse_chunk_t = type opaque

!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!378 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!382 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!384 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!385 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!386 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!387 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!388 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!401 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!402 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!413 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!414 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!415 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!416 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!417 = !{!418, !420, !422}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !354, line: 46, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !423, line: 70, baseType: !424)
!423 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !425, line: 30, baseType: !426)
!425 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!426 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!427 = !{!428, !0, !595}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "mp_builtin_open_obj", scope: !2, file: !430, line: 86, type: !431, isLocal: false, isDefinition: true)
!430 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c", directory: "")
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !354, line: 814, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !354, line: 805, size: 192, elements: !434)
!434 = !{!435, !578, !580, !581, !582}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !433, file: !354, line: 806, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !354, line: 59, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !354, line: 56, size: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !354, line: 57, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !354, line: 52, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !354, line: 474, size: 960, elements: !444)
!444 = !{!445, !446, !450, !451, !475, !499, !504, !510, !516, !523, !528, !542, !547, !568, !571, !572}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !443, file: !354, line: 476, baseType: !436, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !354, line: 479, baseType: !447, size: 16, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !448, line: 31, baseType: !449)
!448 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!449 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !443, file: !354, line: 482, baseType: !447, size: 16, offset: 80)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !443, file: !354, line: 485, baseType: !452, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !354, line: 441, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456, !418, !474}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !459, line: 53, baseType: !460)
!459 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !459, line: 50, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !459, line: 51, baseType: !419, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !460, file: !459, line: 52, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !459, line: 48, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !419, !468, !470}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !471, line: 31, baseType: !472)
!471 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !473, line: 92, baseType: !426)
!473 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !354, line: 430, baseType: !353)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !443, file: !354, line: 488, baseType: !476, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !354, line: 442, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!418, !440, !470, !480, !482}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !354, line: 374, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !354, line: 365, size: 192, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !484, file: !354, line: 366, baseType: !470, size: 1, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !484, file: !354, line: 367, baseType: !470, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !484, file: !354, line: 368, baseType: !470, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !484, file: !354, line: 369, baseType: !470, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !484, file: !354, line: 371, baseType: !470, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !484, file: !354, line: 372, baseType: !470, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !484, file: !354, line: 373, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !354, line: 353, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !354, line: 350, size: 128, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !495, file: !354, line: 351, baseType: !418, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !495, file: !354, line: 352, baseType: !418, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !443, file: !354, line: 491, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !354, line: 443, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!418, !418, !470, !470, !480}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !443, file: !354, line: 495, baseType: !505, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !354, line: 444, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!418, !509, !418}
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !363, line: 65, baseType: !362)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !443, file: !354, line: 496, baseType: !511, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !354, line: 445, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!418, !515, !418, !418}
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !363, line: 145, baseType: !376)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !443, file: !354, line: 509, baseType: !517, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !354, line: 446, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !418, !521, !522}
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !107, line: 48, baseType: !470)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !443, file: !354, line: 516, baseType: !524, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !354, line: 447, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!418, !418, !418, !418}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !443, file: !354, line: 521, baseType: !529, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !354, line: 448, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!418, !418, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !354, line: 435, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !354, line: 432, size: 256, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !535, file: !354, line: 433, baseType: !436, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !535, file: !354, line: 434, baseType: !539, size: 192, offset: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 192, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 3)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !443, file: !354, line: 525, baseType: !543, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !354, line: 415, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!418, !418}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !443, file: !354, line: 528, baseType: !548, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !354, line: 470, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !354, line: 468, size: 64, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !549, file: !354, line: 469, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !418, !560, !422}
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !423, line: 69, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !557, line: 32, baseType: !558)
!557 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !473, line: 49, baseType: !559)
!559 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !354, line: 464, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !354, line: 451, size: 192, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !562, file: !354, line: 457, baseType: !419, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !562, file: !354, line: 458, baseType: !470, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !562, file: !354, line: 459, baseType: !567, size: 32, offset: 128)
!567 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !443, file: !354, line: 531, baseType: !569, size: 64, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !443, file: !354, line: 537, baseType: !569, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !443, file: !354, line: 540, baseType: !573, size: 64, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !354, line: 775, size: 256, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !574, file: !354, line: 776, baseType: !436, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !574, file: !354, line: 777, baseType: !483, size: 192, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !433, file: !354, line: 807, baseType: !579, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!579 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !433, file: !354, line: 808, baseType: !422, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !433, file: !354, line: 809, baseType: !422, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !433, file: !354, line: 813, baseType: !583, size: 64, offset: 128)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !354, line: 810, size: 64, elements: !584)
!584 = !{!585, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !583, file: !354, line: 811, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !354, line: 418, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!418, !470, !480}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !583, file: !354, line: 812, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !354, line: 421, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!418, !470, !480, !482}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "heap", scope: !2, file: !430, line: 31, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 131072, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 16384)
!600 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!601 = !{i32 2, !"Dwarf Version", i32 4}
!602 = !{i32 2, !"Debug Info Version", i32 3}
!603 = !{i32 1, !"wchar_size", i32 4}
!604 = !{i32 7, !"PIC Level", i32 2}
!605 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!606 = distinct !DISubprogram(name: "do_str", scope: !430, file: !430, line: 13, type: !607, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !610)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !468, !609}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !6, line: 95, baseType: !5)
!610 = !{!611, !612, !613, !627, !675, !676, !685}
!611 = !DILocalVariable(name: "src", arg: 1, scope: !606, file: !430, line: 13, type: !468)
!612 = !DILocalVariable(name: "input_kind", arg: 2, scope: !606, file: !430, line: 13, type: !609)
!613 = !DILocalVariable(name: "nlr", scope: !606, file: !430, line: 14, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !615, line: 72, baseType: !616)
!615 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/nlr.h", directory: "")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !615, line: 73, size: 1344, elements: !617)
!617 = !{!618, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !616, file: !615, line: 75, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !616, file: !615, line: 76, baseType: !419, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !616, file: !615, line: 79, baseType: !622, size: 1184, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !623, line: 37, baseType: !624)
!623 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/setjmp.h", directory: "")
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1184, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 37)
!627 = !DILocalVariable(name: "lex", scope: !628, file: !430, line: 16, type: !630)
!628 = distinct !DILexicalBlock(scope: !629, file: !430, line: 15, column: 30)
!629 = distinct !DILexicalBlock(scope: !606, file: !430, line: 15, column: 9)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !13, line: 168, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !13, line: 148, size: 1280, elements: !633)
!633 = !{!634, !635, !649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !663, !664, !665, !667}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !632, file: !13, line: 149, baseType: !521, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !632, file: !13, line: 150, baseType: !636, size: 192, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !637, line: 40, baseType: !638)
!637 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !637, line: 36, size: 192, elements: !639)
!639 = !{!640, !641, !645}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !638, file: !637, line: 37, baseType: !419, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !638, file: !637, line: 38, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!422, !419}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !638, file: !637, line: 39, baseType: !646, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !419}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !632, file: !13, line: 152, baseType: !650, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !651, line: 131, baseType: !652)
!651 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !651, line: 40, baseType: !7)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !632, file: !13, line: 152, baseType: !650, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !632, file: !13, line: 152, baseType: !650, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !632, file: !13, line: 154, baseType: !470, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !632, file: !13, line: 155, baseType: !470, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !632, file: !13, line: 157, baseType: !555, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !632, file: !13, line: 158, baseType: !555, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !632, file: !13, line: 160, baseType: !470, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !632, file: !13, line: 161, baseType: !470, size: 64, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !632, file: !13, line: 162, baseType: !662, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !632, file: !13, line: 164, baseType: !470, size: 64, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !632, file: !13, line: 165, baseType: !470, size: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !632, file: !13, line: 166, baseType: !666, size: 32, offset: 960)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !13, line: 144, baseType: !12)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !632, file: !13, line: 167, baseType: !668, size: 256, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !651, line: 165, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !651, line: 160, size: 256, elements: !670)
!670 = !{!671, !672, !673, !674}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !669, file: !651, line: 161, baseType: !470, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !669, file: !651, line: 162, baseType: !470, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !669, file: !651, line: 163, baseType: !420, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !669, file: !651, line: 164, baseType: !579, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!675 = !DILocalVariable(name: "source_name", scope: !628, file: !430, line: 17, type: !521)
!676 = !DILocalVariable(name: "parse_tree", scope: !628, file: !430, line: 18, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !6, line: 100, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !6, line: 97, size: 128, elements: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !678, file: !6, line: 98, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !6, line: 52, baseType: !424)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !678, file: !6, line: 99, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !6, line: 99, flags: DIFlagFwdDecl)
!685 = !DILocalVariable(name: "module_fun", scope: !628, file: !430, line: 19, type: !418)
!686 = !DILocation(line: 13, column: 25, scope: !606)
!687 = !DILocation(line: 13, column: 52, scope: !606)
!688 = !DILocation(line: 14, column: 5, scope: !606)
!689 = !DILocation(line: 14, column: 15, scope: !606)
!690 = !DILocation(line: 15, column: 9, scope: !629)
!691 = !DILocation(line: 15, column: 24, scope: !629)
!692 = !DILocation(line: 15, column: 9, scope: !606)
!693 = !DILocation(line: 16, column: 81, scope: !628)
!694 = !DILocation(line: 16, column: 27, scope: !628)
!695 = !DILocation(line: 16, column: 21, scope: !628)
!696 = !DILocation(line: 17, column: 33, scope: !628)
!697 = !{!698, !699, i64 0}
!698 = !{!"_mp_lexer_t", !699, i64 0, !702, i64 8, !704, i64 32, !704, i64 36, !704, i64 40, !699, i64 48, !699, i64 56, !699, i64 64, !699, i64 72, !699, i64 80, !699, i64 88, !703, i64 96, !699, i64 104, !699, i64 112, !700, i64 120, !705, i64 128}
!699 = !{!"long", !700, i64 0}
!700 = !{!"omnipotent char", !701, i64 0}
!701 = !{!"Simple C/C++ TBAA"}
!702 = !{!"_mp_reader_t", !703, i64 0, !703, i64 8, !703, i64 16}
!703 = !{!"any pointer", !700, i64 0}
!704 = !{!"int", !700, i64 0}
!705 = !{!"_vstr_t", !699, i64 0, !699, i64 8, !703, i64 16, !706, i64 24}
!706 = !{!"_Bool", !700, i64 0}
!707 = !DILocation(line: 17, column: 14, scope: !628)
!708 = !DILocation(line: 18, column: 9, scope: !628)
!709 = !DILocation(line: 18, column: 38, scope: !628)
!710 = !DILocation(line: 18, column: 25, scope: !628)
!711 = !DILocation(line: 19, column: 31, scope: !628)
!712 = !DILocation(line: 19, column: 18, scope: !628)
!713 = !DILocation(line: 20, column: 9, scope: !628)
!714 = !DILocation(line: 21, column: 9, scope: !628)
!715 = !DILocation(line: 22, column: 5, scope: !629)
!716 = !DILocation(line: 22, column: 5, scope: !628)
!717 = !DILocation(line: 24, column: 62, scope: !718)
!718 = distinct !DILexicalBlock(scope: !629, file: !430, line: 22, column: 12)
!719 = !{!720, !703, i64 8}
!720 = !{!"_nlr_buf_t", !703, i64 0, !703, i64 8, !700, i64 16}
!721 = !DILocation(line: 24, column: 9, scope: !718)
!722 = !DILocation(line: 26, column: 1, scope: !606)
!723 = distinct !DISubprogram(name: "main", scope: !430, file: !430, line: 34, type: !724, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !727)
!724 = !DISubroutineType(types: !725)
!725 = !{!567, !567, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!727 = !{!728, !729, !730}
!728 = !DILocalVariable(name: "argc", arg: 1, scope: !723, file: !430, line: 34, type: !567)
!729 = !DILocalVariable(name: "argv", arg: 2, scope: !723, file: !430, line: 34, type: !726)
!730 = !DILocalVariable(name: "stack_dummy", scope: !723, file: !430, line: 35, type: !567)
!731 = !DILocation(line: 34, column: 14, scope: !723)
!732 = !DILocation(line: 34, column: 27, scope: !723)
!733 = !DILocation(line: 35, column: 5, scope: !723)
!734 = !DILocation(line: 36, column: 15, scope: !723)
!735 = !{!703, !703, i64 0}
!736 = !DILocation(line: 39, column: 5, scope: !723)
!737 = !DILocation(line: 41, column: 5, scope: !723)
!738 = !DILocation(line: 54, column: 5, scope: !723)
!739 = !DILocation(line: 61, column: 5, scope: !723)
!740 = !DILocation(line: 63, column: 1, scope: !723)
!741 = !DILocation(line: 62, column: 5, scope: !723)
!742 = distinct !DISubprogram(name: "gc_collect", scope: !430, file: !430, line: 65, type: !743, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
