; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }
%struct._mp_parse_t = type { i64, %struct._mp_parse_chunk_t* }
%struct._mp_parse_chunk_t = type opaque

!369 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!370 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!371 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!372 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!373 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!374 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !362, line: 69, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!377 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!378 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!379 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!380 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!381 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!382 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!383 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!384 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!385 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!386 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!387 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!388 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!389 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!390 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!391 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!392 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!393 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!394 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!395 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!396 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!397 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!398 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!399 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!400 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!401 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!402 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!403 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!404 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!405 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!406 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!407 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!408 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!409 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!410 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!411 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!412 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!413 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!414 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!415 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!416 = !{!417, !419, !421}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !353, line: 46, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !422, line: 71, baseType: !423)
!422 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !424, line: 30, baseType: !425)
!424 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!425 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!426 = !{!427, !0, !594}
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "mp_builtin_open_obj", scope: !2, file: !429, line: 84, type: !430, isLocal: false, isDefinition: true)
!429 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/main.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !353, line: 814, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !353, line: 805, size: 192, elements: !433)
!433 = !{!434, !577, !579, !580, !581}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !353, line: 806, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !353, line: 59, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !353, line: 56, size: 64, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !353, line: 57, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !353, line: 52, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !353, line: 474, size: 960, elements: !443)
!443 = !{!444, !445, !449, !450, !474, !498, !503, !509, !515, !522, !527, !541, !546, !567, !570, !571}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !353, line: 476, baseType: !435, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !442, file: !353, line: 479, baseType: !446, size: 16, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !447, line: 31, baseType: !448)
!447 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!448 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !353, line: 482, baseType: !446, size: 16, offset: 80)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !442, file: !353, line: 485, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !353, line: 441, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !455, !417, !473}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !458, line: 53, baseType: !459)
!458 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !458, line: 50, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !459, file: !458, line: 51, baseType: !418, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !459, file: !458, line: 52, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !458, line: 48, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !418, !467, !469}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !470, line: 31, baseType: !471)
!470 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !472, line: 92, baseType: !425)
!472 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !353, line: 430, baseType: !352)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !442, file: !353, line: 488, baseType: !475, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !353, line: 442, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!417, !439, !469, !479, !481}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !353, line: 374, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !353, line: 365, size: 192, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !483, file: !353, line: 366, baseType: !469, size: 1, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !483, file: !353, line: 367, baseType: !469, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !483, file: !353, line: 368, baseType: !469, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !483, file: !353, line: 369, baseType: !469, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !483, file: !353, line: 371, baseType: !469, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !483, file: !353, line: 372, baseType: !469, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !483, file: !353, line: 373, baseType: !492, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !353, line: 353, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !353, line: 350, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !494, file: !353, line: 351, baseType: !417, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !494, file: !353, line: 352, baseType: !417, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !442, file: !353, line: 491, baseType: !499, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !353, line: 443, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!417, !417, !469, !469, !479}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !442, file: !353, line: 495, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !353, line: 444, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!417, !508, !417}
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !362, line: 65, baseType: !361)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !442, file: !353, line: 496, baseType: !510, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !353, line: 445, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!417, !514, !417, !417}
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !362, line: 145, baseType: !375)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !442, file: !353, line: 509, baseType: !516, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !353, line: 446, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !417, !520, !521}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !106, line: 48, baseType: !469)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !442, file: !353, line: 516, baseType: !523, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !353, line: 447, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!417, !417, !417, !417}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !442, file: !353, line: 521, baseType: !528, size: 64, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !353, line: 448, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!417, !417, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !353, line: 435, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !353, line: 432, size: 256, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !534, file: !353, line: 433, baseType: !435, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !534, file: !353, line: 434, baseType: !538, size: 192, offset: 64)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 3)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !442, file: !353, line: 525, baseType: !542, size: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !353, line: 415, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!417, !417}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !442, file: !353, line: 528, baseType: !547, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !353, line: 470, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !353, line: 468, size: 64, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !548, file: !353, line: 469, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !417, !559, !421}
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !422, line: 70, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !556, line: 32, baseType: !557)
!556 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !472, line: 49, baseType: !558)
!558 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !353, line: 464, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !353, line: 451, size: 192, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !561, file: !353, line: 457, baseType: !418, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !561, file: !353, line: 458, baseType: !469, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !561, file: !353, line: 459, baseType: !566, size: 32, offset: 128)
!566 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !442, file: !353, line: 531, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !442, file: !353, line: 537, baseType: !568, size: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !442, file: !353, line: 540, baseType: !572, size: 64, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !353, line: 775, size: 256, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !573, file: !353, line: 776, baseType: !435, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !573, file: !353, line: 777, baseType: !482, size: 192, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !432, file: !353, line: 807, baseType: !578, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!578 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !432, file: !353, line: 808, baseType: !421, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !432, file: !353, line: 809, baseType: !421, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !432, file: !353, line: 813, baseType: !582, size: 64, offset: 128)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !353, line: 810, size: 64, elements: !583)
!583 = !{!584, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !582, file: !353, line: 811, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !353, line: 418, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!417, !469, !479}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !582, file: !353, line: 812, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !353, line: 421, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!417, !469, !479, !481}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "heap", scope: !2, file: !429, line: 31, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 16384, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 2048)
!599 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!600 = !{i32 2, !"Dwarf Version", i32 4}
!601 = !{i32 2, !"Debug Info Version", i32 3}
!602 = !{i32 1, !"wchar_size", i32 4}
!603 = !{i32 7, !"PIC Level", i32 2}
!604 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!605 = distinct !DISubprogram(name: "do_str", scope: !429, file: !429, line: 13, type: !606, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !609)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !467, !608}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !6, line: 95, baseType: !5)
!609 = !{!610, !611, !612, !626, !675, !676, !685}
!610 = !DILocalVariable(name: "src", arg: 1, scope: !605, file: !429, line: 13, type: !467)
!611 = !DILocalVariable(name: "input_kind", arg: 2, scope: !605, file: !429, line: 13, type: !608)
!612 = !DILocalVariable(name: "nlr", scope: !605, file: !429, line: 14, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !614, line: 72, baseType: !615)
!614 = !DIFile(filename: "../../py/nlr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !614, line: 73, size: 1344, elements: !616)
!616 = !{!617, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !615, file: !614, line: 75, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !615, file: !614, line: 76, baseType: !418, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !615, file: !614, line: 79, baseType: !621, size: 1184, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !622, line: 37, baseType: !623)
!622 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/setjmp.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 1184, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 37)
!626 = !DILocalVariable(name: "lex", scope: !627, file: !429, line: 16, type: !629)
!627 = distinct !DILexicalBlock(scope: !628, file: !429, line: 15, column: 30)
!628 = distinct !DILexicalBlock(scope: !605, file: !429, line: 15, column: 9)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !12, line: 168, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !12, line: 148, size: 1280, elements: !632)
!632 = !{!633, !634, !648, !653, !654, !655, !656, !657, !658, !659, !660, !661, !663, !664, !665, !667}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !631, file: !12, line: 149, baseType: !520, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !631, file: !12, line: 150, baseType: !635, size: 192, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !636, line: 40, baseType: !637)
!636 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !636, line: 36, size: 192, elements: !638)
!638 = !{!639, !640, !644}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !637, file: !636, line: 37, baseType: !418, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !637, file: !636, line: 38, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!421, !418}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !637, file: !636, line: 39, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !418}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !631, file: !12, line: 152, baseType: !649, size: 32, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !650, line: 131, baseType: !651)
!650 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !650, line: 40, baseType: !652)
!652 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !631, file: !12, line: 152, baseType: !649, size: 32, offset: 288)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !631, file: !12, line: 152, baseType: !649, size: 32, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !631, file: !12, line: 154, baseType: !469, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !631, file: !12, line: 155, baseType: !469, size: 64, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !631, file: !12, line: 157, baseType: !554, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !631, file: !12, line: 158, baseType: !554, size: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !631, file: !12, line: 160, baseType: !469, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !631, file: !12, line: 161, baseType: !469, size: 64, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !631, file: !12, line: 162, baseType: !662, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !631, file: !12, line: 164, baseType: !469, size: 64, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !631, file: !12, line: 165, baseType: !469, size: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !631, file: !12, line: 166, baseType: !666, size: 32, offset: 960)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !12, line: 144, baseType: !11)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !631, file: !12, line: 167, baseType: !668, size: 256, offset: 1024)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !650, line: 165, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !650, line: 160, size: 256, elements: !670)
!670 = !{!671, !672, !673, !674}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !669, file: !650, line: 161, baseType: !469, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !669, file: !650, line: 162, baseType: !469, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !669, file: !650, line: 163, baseType: !419, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !669, file: !650, line: 164, baseType: !578, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!675 = !DILocalVariable(name: "source_name", scope: !627, file: !429, line: 17, type: !520)
!676 = !DILocalVariable(name: "parse_tree", scope: !627, file: !429, line: 18, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !6, line: 100, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !6, line: 97, size: 128, elements: !679)
!679 = !{!680, !682}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !678, file: !6, line: 98, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !6, line: 52, baseType: !423)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !678, file: !6, line: 99, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !6, line: 99, flags: DIFlagFwdDecl)
!685 = !DILocalVariable(name: "module_fun", scope: !627, file: !429, line: 19, type: !417)
!686 = !DILocation(line: 13, column: 25, scope: !605)
!687 = !DILocation(line: 13, column: 52, scope: !605)
!688 = !DILocation(line: 14, column: 5, scope: !605)
!689 = !DILocation(line: 14, column: 15, scope: !605)
!690 = !DILocation(line: 15, column: 9, scope: !628)
!691 = !DILocation(line: 15, column: 24, scope: !628)
!692 = !DILocation(line: 15, column: 9, scope: !605)
!693 = !DILocation(line: 16, column: 81, scope: !627)
!694 = !DILocation(line: 16, column: 27, scope: !627)
!695 = !DILocation(line: 16, column: 21, scope: !627)
!696 = !DILocation(line: 17, column: 33, scope: !627)
!697 = !{!698, !699, i64 0}
!698 = !{!"_mp_lexer_t", !699, i64 0, !702, i64 8, !704, i64 32, !704, i64 36, !704, i64 40, !699, i64 48, !699, i64 56, !699, i64 64, !699, i64 72, !699, i64 80, !699, i64 88, !703, i64 96, !699, i64 104, !699, i64 112, !700, i64 120, !705, i64 128}
!699 = !{!"long", !700, i64 0}
!700 = !{!"omnipotent char", !701, i64 0}
!701 = !{!"Simple C/C++ TBAA"}
!702 = !{!"_mp_reader_t", !703, i64 0, !703, i64 8, !703, i64 16}
!703 = !{!"any pointer", !700, i64 0}
!704 = !{!"int", !700, i64 0}
!705 = !{!"_vstr_t", !699, i64 0, !699, i64 8, !703, i64 16, !706, i64 24}
!706 = !{!"_Bool", !700, i64 0}
!707 = !DILocation(line: 17, column: 14, scope: !627)
!708 = !DILocation(line: 18, column: 9, scope: !627)
!709 = !DILocation(line: 18, column: 38, scope: !627)
!710 = !DILocation(line: 18, column: 25, scope: !627)
!711 = !DILocation(line: 19, column: 31, scope: !627)
!712 = !DILocation(line: 19, column: 18, scope: !627)
!713 = !DILocation(line: 20, column: 9, scope: !627)
!714 = !DILocation(line: 21, column: 9, scope: !627)
!715 = !DILocation(line: 22, column: 5, scope: !628)
!716 = !DILocation(line: 22, column: 5, scope: !627)
!717 = !DILocation(line: 24, column: 62, scope: !718)
!718 = distinct !DILexicalBlock(scope: !628, file: !429, line: 22, column: 12)
!719 = !{!720, !703, i64 8}
!720 = !{!"_nlr_buf_t", !703, i64 0, !703, i64 8, !700, i64 16}
!721 = !DILocation(line: 24, column: 9, scope: !718)
!722 = !DILocation(line: 26, column: 1, scope: !605)
!723 = distinct !DISubprogram(name: "main", scope: !429, file: !429, line: 34, type: !724, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !727)
!724 = !DISubroutineType(types: !725)
!725 = !{!566, !566, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!727 = !{!728, !729, !730}
!728 = !DILocalVariable(name: "argc", arg: 1, scope: !723, file: !429, line: 34, type: !566)
!729 = !DILocalVariable(name: "argv", arg: 2, scope: !723, file: !429, line: 34, type: !726)
!730 = !DILocalVariable(name: "stack_dummy", scope: !723, file: !429, line: 35, type: !566)
!731 = !DILocation(line: 34, column: 14, scope: !723)
!732 = !DILocation(line: 34, column: 27, scope: !723)
!733 = !DILocation(line: 35, column: 5, scope: !723)
!734 = !DILocation(line: 36, column: 15, scope: !723)
!735 = !{!703, !703, i64 0}
!736 = !DILocation(line: 39, column: 5, scope: !723)
!737 = !DILocation(line: 41, column: 5, scope: !723)
!738 = !DILocation(line: 52, column: 5, scope: !723)
!739 = !DILocation(line: 59, column: 5, scope: !723)
!740 = !DILocation(line: 61, column: 1, scope: !723)
!741 = !DILocation(line: 60, column: 5, scope: !723)
!742 = distinct !DISubprogram(name: "gc_collect", scope: !429, file: !429, line: 63, type: !743, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !745)
