; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/map.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/map.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }

@mp_const_empty_map = local_unnamed_addr constant { i8, i8, i8, i8, i8, i8, i8, i8, i64, %struct._mp_map_elem_t* } { i8 6, i8 0, i8 0, i8 0, i8 0, i8 0, i8 0, i8 0, i64 0, %struct._mp_map_elem_t* null }, align 8, !dbg !0
@mp_type_str = external constant %struct._mp_obj_type_t, align 8

!11 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 423, baseType: !7, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20}
!15 = !DIEnumerator(name: "PRINT_STR", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "PRINT_REPR", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "PRINT_EXC", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "PRINT_JSON", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "PRINT_RAW", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 47, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime0.h", directory: "")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!29 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 69, baseType: !7, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75}
!37 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!70 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!71 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!72 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!73 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!74 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!75 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!76 = !{!77, !85, !83, !216, !202, !82}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !80)
!80 = !{!81, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !79, file: !6, line: 351, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !6, line: 352, baseType: !82, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !6, line: 57, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !94)
!94 = !{!95, !96, !100, !101, !127, !145, !150, !156, !162, !170, !175, !189, !194, !219, !222, !223}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !93, file: !6, line: 476, baseType: !86, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !6, line: 479, baseType: !97, size: 16, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !98, line: 31, baseType: !99)
!98 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !6, line: 482, baseType: !97, size: 16, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !93, file: !6, line: 485, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !106, !82, !126}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !109, line: 53, baseType: !110)
!109 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !109, line: 50, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !109, line: 51, baseType: !83, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !110, file: !109, line: 52, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !109, line: 48, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !83, !118, !121}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 31, baseType: !123)
!122 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !124, line: 92, baseType: !125)
!124 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!125 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !13)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !93, file: !6, line: 488, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!82, !90, !121, !132, !134}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !136, file: !6, line: 366, baseType: !121, size: 1, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !136, file: !6, line: 367, baseType: !121, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !136, file: !6, line: 368, baseType: !121, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !136, file: !6, line: 369, baseType: !121, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !136, file: !6, line: 371, baseType: !121, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !136, file: !6, line: 372, baseType: !121, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !136, file: !6, line: 373, baseType: !77, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !93, file: !6, line: 491, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!82, !82, !121, !121, !132}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !93, file: !6, line: 495, baseType: !151, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!82, !155, !82}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !22, line: 65, baseType: !21)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !93, file: !6, line: 496, baseType: !157, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!82, !161, !82, !82}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !22, line: 145, baseType: !35)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !93, file: !6, line: 509, baseType: !163, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !82, !167, !169}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !168, line: 48, baseType: !121)
!168 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !93, file: !6, line: 516, baseType: !171, size: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!82, !82, !82, !82}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !93, file: !6, line: 521, baseType: !176, size: 64, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!82, !82, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !182, file: !6, line: 433, baseType: !86, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !182, file: !6, line: 434, baseType: !186, size: 192, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 192, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !93, file: !6, line: 525, baseType: !190, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!82, !82}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !93, file: !6, line: 528, baseType: !195, size: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !196, file: !6, line: 469, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !82, !208, !216}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !203, line: 69, baseType: !204)
!203 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !205, line: 32, baseType: !206)
!205 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !124, line: 49, baseType: !207)
!207 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !210, file: !6, line: 457, baseType: !83, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !210, file: !6, line: 458, baseType: !121, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !210, file: !6, line: 459, baseType: !215, size: 32, offset: 128)
!215 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !203, line: 70, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !218, line: 30, baseType: !125)
!218 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !93, file: !6, line: 531, baseType: !220, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !93, file: !6, line: 537, baseType: !220, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !93, file: !6, line: 540, baseType: !224, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !225, file: !6, line: 776, baseType: !86, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !225, file: !6, line: 777, baseType: !135, size: 192, offset: 64)
!229 = !{!0, !230}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "hash_allocation_sizes", scope: !2, file: !232, line: 58, type: !233, isLocal: true, isDefinition: true)
!232 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/map.c", directory: "")
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 544, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!235 = !{!236}
!236 = !DISubrange(count: 34)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!238 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!239 = !{i32 2, !"Dwarf Version", i32 4}
!240 = !{i32 2, !"Debug Info Version", i32 3}
!241 = !{i32 1, !"wchar_size", i32 4}
!242 = !{i32 7, !"PIC Level", i32 2}
!243 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!244 = distinct !DISubprogram(name: "mp_map_init", scope: !232, file: !232, line: 79, type: !245, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !134, !121}
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "map", arg: 1, scope: !244, file: !232, line: 79, type: !134)
!249 = !DILocalVariable(name: "n", arg: 2, scope: !244, file: !232, line: 79, type: !121)
!250 = !DILocation(line: 79, column: 28, scope: !244)
!251 = !DILocation(line: 79, column: 40, scope: !244)
!252 = !DILocation(line: 80, column: 11, scope: !253)
!253 = distinct !DILexicalBlock(scope: !244, file: !232, line: 80, column: 9)
!254 = !DILocation(line: 0, scope: !253)
!255 = !DILocation(line: 80, column: 9, scope: !244)
!256 = !DILocation(line: 83, column: 5, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !232, line: 80, column: 17)
!258 = !DILocation(line: 82, column: 20, scope: !257)
!259 = !DILocation(line: 84, column: 20, scope: !260)
!260 = distinct !DILexicalBlock(scope: !253, file: !232, line: 83, column: 12)
!261 = !{!262, !263, i64 8}
!262 = !{!"_mp_map_t", !263, i64 0, !263, i64 0, !263, i64 0, !263, i64 0, !263, i64 0, !263, i64 8, !266, i64 16}
!263 = !{!"long", !264, i64 0}
!264 = !{!"omnipotent char", !265, i64 0}
!265 = !{!"Simple C/C++ TBAA"}
!266 = !{!"any pointer", !264, i64 0}
!267 = !DILocation(line: 85, column: 22, scope: !260)
!268 = !DILocation(line: 85, column: 14, scope: !260)
!269 = !DILocation(line: 85, column: 20, scope: !260)
!270 = !{!262, !266, i64 16}
!271 = !DILocation(line: 87, column: 10, scope: !244)
!272 = !DILocation(line: 87, column: 15, scope: !244)
!273 = !DILocation(line: 88, column: 29, scope: !244)
!274 = !DILocation(line: 90, column: 21, scope: !244)
!275 = !DILocation(line: 91, column: 1, scope: !244)
!276 = distinct !DISubprogram(name: "mp_map_init_fixed_table", scope: !232, file: !232, line: 93, type: !277, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !279)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !134, !121, !132}
!279 = !{!280, !281, !282}
!280 = !DILocalVariable(name: "map", arg: 1, scope: !276, file: !232, line: 93, type: !134)
!281 = !DILocalVariable(name: "n", arg: 2, scope: !276, file: !232, line: 93, type: !121)
!282 = !DILocalVariable(name: "table", arg: 3, scope: !276, file: !232, line: 93, type: !132)
!283 = !DILocation(line: 93, column: 40, scope: !276)
!284 = !DILocation(line: 93, column: 52, scope: !276)
!285 = !DILocation(line: 93, column: 71, scope: !276)
!286 = !DILocation(line: 94, column: 10, scope: !276)
!287 = !DILocation(line: 94, column: 16, scope: !276)
!288 = !DILocation(line: 95, column: 10, scope: !276)
!289 = !DILocation(line: 95, column: 15, scope: !276)
!290 = !DILocation(line: 98, column: 21, scope: !276)
!291 = !DILocation(line: 99, column: 10, scope: !276)
