; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/map.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/map.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }

@mp_const_empty_map = local_unnamed_addr constant { i8, i8, i8, i8, i8, i8, i8, i8, i64, %struct._mp_map_elem_t* } { i8 6, i8 0, i8 0, i8 0, i8 0, i8 0, i8 0, i8 0, i64 0, %struct._mp_map_elem_t* null }, align 8, !dbg !0
@mp_type_str = external constant %struct._mp_obj_type_t, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mp_const_empty_map", scope: !2, file: !3, line: 45, type: !235, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !75, globals: !228)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/map.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !{!5, !12, !20, !34}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !6, line: 377, size: 32, elements: !7)
!6 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0)
!9 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1)
!10 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2)
!11 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 423, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19}
!14 = !DIEnumerator(name: "PRINT_STR", value: 0)
!15 = !DIEnumerator(name: "PRINT_REPR", value: 1)
!16 = !DIEnumerator(name: "PRINT_EXC", value: 2)
!17 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!18 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!19 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 47, size: 32, elements: !22)
!21 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!23 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!24 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!25 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!26 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!28 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!29 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!30 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!31 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!32 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!33 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 69, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!36 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!37 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!39 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!40 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!41 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!42 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!43 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!44 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!52 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!53 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!54 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!55 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!56 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!57 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!58 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!59 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!60 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!61 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!62 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!63 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!64 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!65 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!66 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!67 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!68 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!69 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!70 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!71 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!72 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!73 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!74 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!75 = !{!76, !84, !82, !215, !201, !81}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !79)
!79 = !{!80, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !78, file: !6, line: 351, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !6, line: 352, baseType: !81, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !87)
!87 = !{!88}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !6, line: 57, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !93)
!93 = !{!94, !95, !99, !100, !126, !144, !149, !155, !161, !169, !174, !188, !193, !218, !221, !222}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !92, file: !6, line: 476, baseType: !85, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !92, file: !6, line: 479, baseType: !96, size: 16, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !97, line: 31, baseType: !98)
!97 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !6, line: 482, baseType: !96, size: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !92, file: !6, line: 485, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !81, !125}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !108, line: 53, baseType: !109)
!108 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !108, line: 50, size: 128, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !108, line: 51, baseType: !82, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !109, file: !108, line: 52, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !108, line: 48, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !82, !117, !120}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 31, baseType: !122)
!121 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !123, line: 92, baseType: !124)
!123 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!124 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !12)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !92, file: !6, line: 488, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!81, !89, !120, !131, !133}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !135, file: !6, line: 366, baseType: !120, size: 1, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !135, file: !6, line: 367, baseType: !120, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !135, file: !6, line: 368, baseType: !120, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !135, file: !6, line: 369, baseType: !120, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !135, file: !6, line: 371, baseType: !120, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !135, file: !6, line: 372, baseType: !120, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !135, file: !6, line: 373, baseType: !76, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !92, file: !6, line: 491, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!81, !81, !120, !120, !131}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !92, file: !6, line: 495, baseType: !150, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!81, !154, !81}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !21, line: 65, baseType: !20)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !92, file: !6, line: 496, baseType: !156, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!81, !160, !81, !81}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !21, line: 145, baseType: !34)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !92, file: !6, line: 509, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !81, !166, !168}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !167, line: 48, baseType: !120)
!167 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !92, file: !6, line: 516, baseType: !170, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!81, !81, !81, !81}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !92, file: !6, line: 521, baseType: !175, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!81, !81, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !181, file: !6, line: 433, baseType: !85, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !181, file: !6, line: 434, baseType: !185, size: 192, offset: 64)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 192, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !92, file: !6, line: 525, baseType: !189, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!81, !81}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !92, file: !6, line: 528, baseType: !194, size: 64, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !195, file: !6, line: 469, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !81, !207, !215}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !202, line: 70, baseType: !203)
!202 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !204, line: 32, baseType: !205)
!204 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !123, line: 49, baseType: !206)
!206 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !209, file: !6, line: 457, baseType: !82, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !209, file: !6, line: 458, baseType: !120, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !209, file: !6, line: 459, baseType: !214, size: 32, offset: 128)
!214 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !202, line: 71, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !217, line: 30, baseType: !124)
!217 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !92, file: !6, line: 531, baseType: !219, size: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !92, file: !6, line: 537, baseType: !219, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !92, file: !6, line: 540, baseType: !223, size: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !224, file: !6, line: 776, baseType: !85, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !224, file: !6, line: 777, baseType: !134, size: 192, offset: 64)
!228 = !{!0, !229}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "hash_allocation_sizes", scope: !2, file: !3, line: 58, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 544, elements: !233)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!233 = !{!234}
!234 = !DISubrange(count: 34)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!236 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!237 = !{i32 2, !"Dwarf Version", i32 4}
!238 = !{i32 2, !"Debug Info Version", i32 3}
!239 = !{i32 1, !"wchar_size", i32 4}
!240 = !{i32 7, !"PIC Level", i32 2}
!241 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!242 = distinct !DISubprogram(name: "mp_map_init", scope: !3, file: !3, line: 79, type: !243, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !133, !120}
!245 = !{!246, !247}
!246 = !DILocalVariable(name: "map", arg: 1, scope: !242, file: !3, line: 79, type: !133)
!247 = !DILocalVariable(name: "n", arg: 2, scope: !242, file: !3, line: 79, type: !120)
!248 = !DILocation(line: 79, column: 28, scope: !242)
!249 = !DILocation(line: 79, column: 40, scope: !242)
!250 = !DILocation(line: 80, column: 11, scope: !251)
!251 = distinct !DILexicalBlock(scope: !242, file: !3, line: 80, column: 9)
!252 = !DILocation(line: 0, scope: !253)
!253 = distinct !DILexicalBlock(scope: !251, file: !3, line: 83, column: 12)
!254 = !DILocation(line: 80, column: 9, scope: !242)
!255 = !DILocation(line: 83, column: 5, scope: !256)
!256 = distinct !DILexicalBlock(scope: !251, file: !3, line: 80, column: 17)
!257 = !DILocation(line: 82, column: 20, scope: !256)
!258 = !DILocation(line: 84, column: 20, scope: !253)
!259 = !{!260, !261, i64 8}
!260 = !{!"_mp_map_t", !261, i64 0, !261, i64 0, !261, i64 0, !261, i64 0, !261, i64 0, !261, i64 8, !264, i64 16}
!261 = !{!"long", !262, i64 0}
!262 = !{!"omnipotent char", !263, i64 0}
!263 = !{!"Simple C/C++ TBAA"}
!264 = !{!"any pointer", !262, i64 0}
!265 = !DILocation(line: 85, column: 22, scope: !253)
!266 = !DILocation(line: 85, column: 14, scope: !253)
!267 = !DILocation(line: 85, column: 20, scope: !253)
!268 = !{!260, !264, i64 16}
!269 = !DILocation(line: 87, column: 10, scope: !242)
!270 = !DILocation(line: 87, column: 15, scope: !242)
!271 = !DILocation(line: 88, column: 29, scope: !242)
!272 = !DILocation(line: 90, column: 21, scope: !242)
!273 = !DILocation(line: 91, column: 1, scope: !242)
!274 = distinct !DISubprogram(name: "mp_map_init_fixed_table", scope: !3, file: !3, line: 93, type: !275, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !277)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !133, !120, !131}
!277 = !{!278, !279, !280}
!278 = !DILocalVariable(name: "map", arg: 1, scope: !274, file: !3, line: 93, type: !133)
!279 = !DILocalVariable(name: "n", arg: 2, scope: !274, file: !3, line: 93, type: !120)
!280 = !DILocalVariable(name: "table", arg: 3, scope: !274, file: !3, line: 93, type: !131)
!281 = !DILocation(line: 93, column: 40, scope: !274)
!282 = !DILocation(line: 93, column: 52, scope: !274)
!283 = !DILocation(line: 93, column: 71, scope: !274)
!284 = !DILocation(line: 94, column: 10, scope: !274)
!285 = !DILocation(line: 94, column: 16, scope: !274)
!286 = !DILocation(line: 95, column: 10, scope: !274)
!287 = !DILocation(line: 95, column: 15, scope: !274)
!288 = !DILocation(line: 98, column: 21, scope: !274)
!289 = !DILocation(line: 99, column: 10, scope: !274)
!290 = !DILocation(line: 99, column: 16, scope: !274)
!291 = !DILocation(line: 100, column: 1, scope: !274)
