; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/modbuiltins.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/modbuiltins.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_fun_builtin_fixed_t = type { %struct._mp_obj_base_t, %union.anon.0 }
%union.anon.0 = type { i8* ()* }
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%struct._mp_obj_module_t = type { %struct._mp_obj_base_t, %struct._mp_obj_dict_t* }
%struct._mp_obj_none_t = type opaque

!249 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!250 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!251 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!252 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!253 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!254 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!255 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!256 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!257 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !306, file: !305, line: 375, baseType: !7, size: 32, elements: !378)
!305 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/modbuiltins.c", directory: "")
!306 = distinct !DISubprogram(name: "mp_builtin_print", scope: !305, file: !305, line: 373, type: !307, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !335)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !311, !316, !318}
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !312, line: 31, baseType: !313)
!312 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !314, line: 92, baseType: !315)
!314 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!315 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !320, file: !6, line: 366, baseType: !311, size: 1, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !320, file: !6, line: 367, baseType: !311, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !320, file: !6, line: 368, baseType: !311, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !320, file: !6, line: 369, baseType: !311, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !320, file: !6, line: 371, baseType: !311, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !320, file: !6, line: 372, baseType: !311, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !320, file: !6, line: 373, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !331, file: !6, line: 351, baseType: !309, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !6, line: 352, baseType: !309, size: 64, offset: 64)
!335 = !{!336, !337, !338, !339, !369, !370, !371, !375, !376}
!336 = !DILocalVariable(name: "n_args", arg: 1, scope: !306, file: !305, line: 373, type: !311)
!337 = !DILocalVariable(name: "pos_args", arg: 2, scope: !306, file: !305, line: 373, type: !316)
!338 = !DILocalVariable(name: "kw_args", arg: 3, scope: !306, file: !305, line: 373, type: !318)
!339 = !DILocalVariable(name: "u", scope: !306, file: !305, line: 389, type: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !306, file: !305, line: 386, size: 192, elements: !341)
!341 = !{!342, !365}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !340, file: !305, line: 387, baseType: !343, size: 192)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 192, elements: !363)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_val_t", file: !345, line: 52, baseType: !346)
!345 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime.h", directory: "")
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_mp_arg_val_t", file: !345, line: 47, size: 64, elements: !347)
!347 = !{!348, !350, !357, !358}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "u_bool", scope: !346, file: !345, line: 48, baseType: !349, size: 8)
!349 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "u_int", scope: !346, file: !345, line: 49, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !352, line: 69, baseType: !353)
!352 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !354, line: 32, baseType: !355)
!354 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !314, line: 49, baseType: !356)
!356 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "u_obj", scope: !346, file: !345, line: 50, baseType: !309, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "u_rom_obj", scope: !346, file: !345, line: 51, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!363 = !{!364}
!364 = !DISubrange(count: 3)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !340, file: !305, line: 388, baseType: !366, size: 128)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 128, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 2)
!369 = !DILocalVariable(name: "sep", scope: !306, file: !305, line: 399, type: !309)
!370 = !DILocalVariable(name: "end", scope: !306, file: !305, line: 400, type: !309)
!371 = !DILocalVariable(name: "sep_data", scope: !306, file: !305, line: 402, type: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!375 = !DILocalVariable(name: "end_data", scope: !306, file: !305, line: 404, type: !372)
!376 = !DILocalVariable(name: "i", scope: !377, file: !305, line: 406, type: !311)
!377 = distinct !DILexicalBlock(scope: !306, file: !305, line: 406, column: 5)
!378 = !{!379, !380, !381, !382}
!379 = !DIEnumerator(name: "ARG_sep", value: 0, isUnsigned: true)
!380 = !DIEnumerator(name: "ARG_end", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "ARG_flush", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "ARG_file", value: 3, isUnsigned: true)
!383 = !{!310, !309, !384, !387, !388, !393, !351}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !352, line: 70, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !386, line: 30, baseType: !315)
!386 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !391, line: 39, baseType: !392)
!391 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!392 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !6, line: 57, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !402)
!402 = !{!403, !404, !408, !409, !427, !432, !437, !443, !449, !456, !461, !473, !478, !494, !495, !496}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !401, file: !6, line: 476, baseType: !394, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !6, line: 479, baseType: !405, size: 16, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !406, line: 31, baseType: !407)
!406 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !6, line: 482, baseType: !405, size: 16, offset: 80)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !401, file: !6, line: 485, baseType: !410, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414, !309, !426}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !417, line: 53, baseType: !418)
!417 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !417, line: 50, size: 128, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !417, line: 51, baseType: !310, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !418, file: !417, line: 52, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !417, line: 48, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !310, !372, !311}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !401, file: !6, line: 488, baseType: !428, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!309, !398, !311, !316, !318}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !401, file: !6, line: 491, baseType: !433, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!309, !309, !311, !311, !316}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !401, file: !6, line: 495, baseType: !438, size: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!309, !442, !309}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !401, file: !6, line: 496, baseType: !444, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!309, !448, !309, !309}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !401, file: !6, line: 509, baseType: !450, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !309, !454, !455}
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !311)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !401, file: !6, line: 516, baseType: !457, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!309, !309, !309, !309}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !401, file: !6, line: 521, baseType: !462, size: 64, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!309, !309, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !468, file: !6, line: 433, baseType: !394, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !468, file: !6, line: 434, baseType: !472, size: 192, offset: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 192, elements: !363)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !401, file: !6, line: 525, baseType: !474, size: 64, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!309, !309}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !401, file: !6, line: 528, baseType: !479, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !480, file: !6, line: 469, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!351, !309, !486, !384}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !488, file: !6, line: 457, baseType: !310, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !488, file: !6, line: 458, baseType: !311, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !488, file: !6, line: 459, baseType: !493, size: 32, offset: 128)
!493 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !401, file: !6, line: 531, baseType: !361, size: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !401, file: !6, line: 537, baseType: !361, size: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !401, file: !6, line: 540, baseType: !497, size: 64, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !6, line: 776, baseType: !394, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !498, file: !6, line: 777, baseType: !319, size: 192, offset: 64)
!502 = !{!0, !503, !526, !528, !530, !532, !534, !536, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !599, !603, !612, !622}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "mp_builtin_abs_obj", scope: !2, file: !305, line: 96, type: !505, isLocal: false, isDefinition: true)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !507, file: !6, line: 795, baseType: !394, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !507, file: !6, line: 801, baseType: !511, size: 64, offset: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !507, file: !6, line: 796, size: 64, elements: !512)
!512 = !{!513, !518, !519, !524}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !511, file: !6, line: 797, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!309}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !511, file: !6, line: 798, baseType: !474, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !511, file: !6, line: 799, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!309, !309, !309}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !511, file: !6, line: 800, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !458)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "mp_builtin_all_obj", scope: !2, file: !305, line: 109, type: !505, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "mp_builtin_any_obj", scope: !2, file: !305, line: 122, type: !505, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "mp_builtin_bin_obj", scope: !2, file: !305, line: 128, type: !505, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "mp_builtin_callable_obj", scope: !2, file: !305, line: 137, type: !505, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mp_builtin_chr_obj", scope: !2, file: !305, line: 175, type: !505, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "mp_builtin_dir_obj", scope: !2, file: !305, line: 208, type: !538, isLocal: false, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !541)
!541 = !{!542, !543, !544, !545, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !540, file: !6, line: 806, baseType: !394, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !540, file: !6, line: 807, baseType: !349, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !540, file: !6, line: 808, baseType: !384, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !540, file: !6, line: 809, baseType: !384, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !540, file: !6, line: 813, baseType: !547, size: 64, offset: 128)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !6, line: 810, size: 64, elements: !548)
!548 = !{!549, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !547, file: !6, line: 811, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!309, !311, !316}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !547, file: !6, line: 812, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "mp_builtin_divmod_obj", scope: !2, file: !305, line: 213, type: !505, isLocal: false, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "mp_builtin_hash_obj", scope: !2, file: !305, line: 219, type: !505, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "mp_builtin_hex_obj", scope: !2, file: !305, line: 224, type: !505, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "mp_builtin_iter_obj", scope: !2, file: !305, line: 258, type: !505, isLocal: false, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "mp_builtin_next_obj", scope: !2, file: !305, line: 324, type: !505, isLocal: false, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "mp_builtin_oct_obj", scope: !2, file: !305, line: 329, type: !505, isLocal: false, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "mp_builtin_ord_obj", scope: !2, file: !305, line: 356, type: !505, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "mp_builtin_pow_obj", scope: !2, file: !305, line: 371, type: !538, isLocal: false, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "mp_builtin_print_obj", scope: !2, file: !305, line: 430, type: !538, isLocal: false, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "mp_builtin___repl_print___obj", scope: !2, file: !305, line: 444, type: !505, isLocal: false, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "mp_builtin_repr_obj", scope: !2, file: !305, line: 453, type: !505, isLocal: false, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "mp_builtin_round_obj", scope: !2, file: !305, line: 505, type: !538, isLocal: false, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "mp_builtin_sum_obj", scope: !2, file: !305, line: 521, type: !538, isLocal: false, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "mp_builtin_sorted_obj", scope: !2, file: !305, line: 532, type: !538, isLocal: false, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "mp_builtin_getattr_obj", scope: !2, file: !305, line: 557, type: !538, isLocal: false, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mp_builtin_setattr_obj", scope: !2, file: !305, line: 563, type: !505, isLocal: false, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "mp_builtin_hasattr_obj", scope: !2, file: !305, line: 578, type: !505, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "mp_builtin_globals_obj", scope: !2, file: !305, line: 583, type: !505, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "mp_builtin_locals_obj", scope: !2, file: !305, line: 588, type: !505, isLocal: false, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "mp_builtin_id_obj", scope: !2, file: !305, line: 591, type: !505, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "mp_builtin_len_obj", scope: !2, file: !305, line: 592, type: !505, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "mp_module_builtins_globals", scope: !2, file: !305, line: 757, type: !601, isLocal: false, isDefinition: true)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !498)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "mp_module_builtins", scope: !2, file: !305, line: 759, type: !605, isLocal: false, isDefinition: true)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !6, line: 831, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !6, line: 828, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !607, file: !6, line: 829, baseType: !394, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !607, file: !6, line: 830, baseType: !611, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "allowed_args", scope: !306, file: !305, line: 376, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 384, elements: !363)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_t", file: !345, line: 58, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_arg_t", file: !345, line: 54, size: 128, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !617, file: !345, line: 55, baseType: !405, size: 16)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !617, file: !345, line: 56, baseType: !405, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !617, file: !345, line: 57, baseType: !344, size: 64, offset: 64)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "mp_module_builtins_globals_table", scope: !2, file: !305, line: 594, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 10240, elements: !631)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !627, file: !6, line: 356, baseType: !359, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !627, file: !6, line: 357, baseType: !359, size: 64, offset: 64)
!631 = !{!632}
!632 = !DISubrange(count: 80)
!633 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!634 = !{i32 2, !"Dwarf Version", i32 4}
!635 = !{i32 2, !"Debug Info Version", i32 3}
!636 = !{i32 1, !"wchar_size", i32 4}
!637 = !{i32 7, !"PIC Level", i32 2}
!638 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!639 = distinct !DISubprogram(name: "mp_builtin___build_class__", scope: !305, file: !305, line: 51, type: !552, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648}
!641 = !DILocalVariable(name: "n_args", arg: 1, scope: !639, file: !305, line: 51, type: !311)
!642 = !DILocalVariable(name: "args", arg: 2, scope: !639, file: !305, line: 51, type: !316)
!643 = !DILocalVariable(name: "old_locals", scope: !639, file: !305, line: 55, type: !611)
!644 = !DILocalVariable(name: "class_locals", scope: !639, file: !305, line: 56, type: !309)
!645 = !DILocalVariable(name: "cell", scope: !639, file: !305, line: 60, type: !309)
!646 = !DILocalVariable(name: "meta", scope: !639, file: !305, line: 66, type: !309)
!647 = !DILocalVariable(name: "meta_args", scope: !639, file: !305, line: 78, type: !472)
!648 = !DILocalVariable(name: "new_class", scope: !639, file: !305, line: 82, type: !309)
!649 = !DILocation(line: 51, column: 51, scope: !639)
!650 = !DILocation(line: 51, column: 75, scope: !639)
!651 = !DILocation(line: 55, column: 33, scope: !639)
!652 = !DILocation(line: 55, column: 20, scope: !639)
!653 = !DILocation(line: 56, column: 29, scope: !639)
!654 = !DILocation(line: 56, column: 14, scope: !639)
!655 = !DILocation(line: 57, column: 19, scope: !639)
!656 = !DILocation(line: 57, column: 5, scope: !639)
!657 = !DILocation(line: 60, column: 40, scope: !639)
!658 = !{!659, !659, i64 0}
!659 = !{!"any pointer", !660, i64 0}
!660 = !{!"omnipotent char", !661, i64 0}
!661 = !{!"Simple C/C++ TBAA"}
!662 = !DILocation(line: 60, column: 21, scope: !639)
!663 = !DILocation(line: 60, column: 14, scope: !639)
!664 = !DILocation(line: 63, column: 5, scope: !639)
!665 = !DILocation(line: 67, column: 16, scope: !666)
!666 = distinct !DILexicalBlock(scope: !639, file: !305, line: 67, column: 9)
!667 = !DILocation(line: 67, column: 9, scope: !639)
!668 = !DILocation(line: 72, column: 16, scope: !669)
!669 = distinct !DILexicalBlock(scope: !666, file: !305, line: 70, column: 12)
!670 = !DILocation(line: 66, column: 14, scope: !639)
!671 = !DILocation(line: 0, scope: !666)
!672 = !DILocation(line: 78, column: 5, scope: !639)
!673 = !DILocation(line: 78, column: 14, scope: !639)
!674 = !DILocation(line: 79, column: 20, scope: !639)
!675 = !DILocation(line: 79, column: 18, scope: !639)
!676 = !DILocation(line: 80, column: 44, scope: !639)
!677 = !DILocation(line: 80, column: 54, scope: !639)
!678 = !DILocation(line: 80, column: 20, scope: !639)
!679 = !DILocation(line: 80, column: 5, scope: !639)
!680 = !DILocation(line: 80, column: 18, scope: !639)
!681 = !DILocation(line: 81, column: 5, scope: !639)
!682 = !DILocation(line: 81, column: 18, scope: !639)
!683 = !DILocation(line: 82, column: 60, scope: !639)
!684 = !DILocation(line: 82, column: 26, scope: !639)
!685 = !DILocation(line: 82, column: 14, scope: !639)
!686 = !DILocation(line: 85, column: 14, scope: !687)
!687 = distinct !DILexicalBlock(scope: !639, file: !305, line: 85, column: 9)
!688 = !DILocation(line: 85, column: 9, scope: !639)
!689 = !DILocation(line: 86, column: 9, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !305, line: 85, column: 32)
!691 = !DILocation(line: 87, column: 5, scope: !690)
!692 = !DILocation(line: 90, column: 1, scope: !639)
!693 = !DILocation(line: 89, column: 5, scope: !639)
!694 = distinct !DISubprogram(name: "mp_builtin_abs", scope: !305, file: !305, line: 93, type: !476, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !695)
!695 = !{!696}
!696 = !DILocalVariable(name: "o_in", arg: 1, scope: !694, file: !305, line: 93, type: !309)
!697 = !DILocation(line: 93, column: 41, scope: !694)
!698 = !DILocation(line: 94, column: 12, scope: !694)
!699 = !DILocation(line: 94, column: 5, scope: !694)
!700 = distinct !DISubprogram(name: "mp_builtin_all", scope: !305, file: !305, line: 98, type: !476, scopeLine: 98, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DILocalVariable(name: "o_in", arg: 1, scope: !700, file: !305, line: 98, type: !309)
!703 = !DILocalVariable(name: "iter_buf", scope: !700, file: !305, line: 99, type: !467)
!704 = !DILocalVariable(name: "iterable", scope: !700, file: !305, line: 100, type: !309)
!705 = !DILocalVariable(name: "item", scope: !700, file: !305, line: 101, type: !309)
!706 = !DILocation(line: 98, column: 41, scope: !700)
!707 = !DILocation(line: 99, column: 5, scope: !700)
!708 = !DILocation(line: 99, column: 23, scope: !700)
!709 = !DILocation(line: 100, column: 25, scope: !700)
!710 = !DILocation(line: 100, column: 14, scope: !700)
!711 = !DILocation(line: 102, column: 5, scope: !700)
!712 = !DILocation(line: 102, column: 20, scope: !700)
!713 = !DILocation(line: 101, column: 14, scope: !700)
!714 = !DILocation(line: 102, column: 43, scope: !700)
!715 = !DILocation(line: 103, column: 14, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !305, line: 103, column: 13)
!717 = distinct !DILexicalBlock(scope: !700, file: !305, line: 102, column: 69)
!718 = !DILocation(line: 103, column: 13, scope: !717)
!719 = distinct !{!719, !711, !720}
!720 = !DILocation(line: 106, column: 5, scope: !700)
!721 = !DILocation(line: 0, scope: !700)
!722 = !DILocation(line: 108, column: 1, scope: !700)
!723 = distinct !DISubprogram(name: "mp_builtin_any", scope: !305, file: !305, line: 111, type: !476, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DILocalVariable(name: "o_in", arg: 1, scope: !723, file: !305, line: 111, type: !309)
!726 = !DILocalVariable(name: "iter_buf", scope: !723, file: !305, line: 112, type: !467)
!727 = !DILocalVariable(name: "iterable", scope: !723, file: !305, line: 113, type: !309)
!728 = !DILocalVariable(name: "item", scope: !723, file: !305, line: 114, type: !309)
!729 = !DILocation(line: 111, column: 41, scope: !723)
!730 = !DILocation(line: 112, column: 5, scope: !723)
!731 = !DILocation(line: 112, column: 23, scope: !723)
!732 = !DILocation(line: 113, column: 25, scope: !723)
!733 = !DILocation(line: 113, column: 14, scope: !723)
!734 = !DILocation(line: 115, column: 5, scope: !723)
!735 = !DILocation(line: 115, column: 20, scope: !723)
!736 = !DILocation(line: 114, column: 14, scope: !723)
!737 = !DILocation(line: 115, column: 43, scope: !723)
!738 = !DILocation(line: 116, column: 13, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !305, line: 116, column: 13)
!740 = distinct !DILexicalBlock(scope: !723, file: !305, line: 115, column: 69)
!741 = !DILocation(line: 116, column: 13, scope: !740)
!742 = distinct !{!742, !734, !743}
!743 = !DILocation(line: 119, column: 5, scope: !723)
!744 = !DILocation(line: 0, scope: !723)
!745 = !DILocation(line: 121, column: 1, scope: !723)
!746 = distinct !DISubprogram(name: "mp_builtin_bin", scope: !305, file: !305, line: 124, type: !476, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !747)
!747 = !{!748, !749}
!748 = !DILocalVariable(name: "o_in", arg: 1, scope: !746, file: !305, line: 124, type: !309)
!749 = !DILocalVariable(name: "args", scope: !746, file: !305, line: 125, type: !750)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, elements: !367)
!751 = !DILocation(line: 124, column: 41, scope: !746)
!752 = !DILocation(line: 125, column: 5, scope: !746)
!753 = !DILocation(line: 125, column: 14, scope: !746)
!754 = !DILocation(line: 125, column: 23, scope: !746)
!755 = !DILocation(line: 126, column: 12, scope: !746)
!756 = !DILocation(line: 127, column: 1, scope: !746)
!757 = !DILocation(line: 126, column: 5, scope: !746)
!758 = distinct !DISubprogram(name: "mp_builtin_callable", scope: !305, file: !305, line: 130, type: !476, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !759)
!759 = !{!760}
!760 = !DILocalVariable(name: "o_in", arg: 1, scope: !758, file: !305, line: 130, type: !309)
!761 = !DILocation(line: 130, column: 46, scope: !758)
!762 = !DILocation(line: 131, column: 9, scope: !763)
!763 = distinct !DILexicalBlock(scope: !758, file: !305, line: 131, column: 9)
!764 = !DILocation(line: 136, column: 1, scope: !758)
!765 = distinct !DISubprogram(name: "mp_builtin_chr", scope: !305, file: !305, line: 139, type: !476, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!766 = !{!767, !768, !769}
!767 = !DILocalVariable(name: "o_in", arg: 1, scope: !765, file: !305, line: 139, type: !309)
!768 = !DILocalVariable(name: "ord", scope: !765, file: !305, line: 166, type: !351)
!769 = !DILocalVariable(name: "str", scope: !770, file: !305, line: 168, type: !772)
!770 = distinct !DILexicalBlock(scope: !771, file: !305, line: 167, column: 34)
!771 = distinct !DILexicalBlock(scope: !765, file: !305, line: 167, column: 9)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 8, elements: !775)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !774, line: 31, baseType: !392)
!774 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!775 = !{!776}
!776 = !DISubrange(count: 1)
!777 = !DILocation(line: 139, column: 41, scope: !765)
!778 = !DILocation(line: 166, column: 20, scope: !765)
!779 = !DILocation(line: 166, column: 14, scope: !765)
!780 = !DILocation(line: 167, column: 18, scope: !771)
!781 = !DILocation(line: 168, column: 9, scope: !770)
!782 = !DILocation(line: 168, column: 17, scope: !770)
!783 = !DILocation(line: 168, column: 27, scope: !770)
!784 = !DILocation(line: 168, column: 26, scope: !770)
!785 = !{!660, !660, i64 0}
!786 = !DILocation(line: 169, column: 16, scope: !770)
!787 = !DILocation(line: 170, column: 5, scope: !771)
!788 = !DILocation(line: 169, column: 9, scope: !770)
!789 = !DILocation(line: 171, column: 29, scope: !790)
!790 = distinct !DILexicalBlock(scope: !771, file: !305, line: 170, column: 12)
!791 = !DILocation(line: 171, column: 9, scope: !790)
!792 = distinct !DISubprogram(name: "mp_builtin_dir", scope: !305, file: !305, line: 177, type: !552, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !793)
!793 = !{!794, !795, !796, !797, !800, !802, !804, !806}
!794 = !DILocalVariable(name: "n_args", arg: 1, scope: !792, file: !305, line: 177, type: !311)
!795 = !DILocalVariable(name: "args", arg: 2, scope: !792, file: !305, line: 177, type: !316)
!796 = !DILocalVariable(name: "dir", scope: !792, file: !305, line: 178, type: !309)
!797 = !DILocalVariable(name: "dict", scope: !798, file: !305, line: 181, type: !611)
!798 = distinct !DILexicalBlock(scope: !799, file: !305, line: 179, column: 22)
!799 = distinct !DILexicalBlock(scope: !792, file: !305, line: 179, column: 9)
!800 = !DILocalVariable(name: "i", scope: !801, file: !305, line: 182, type: !311)
!801 = distinct !DILexicalBlock(scope: !798, file: !305, line: 182, column: 9)
!802 = !DILocalVariable(name: "nqstr", scope: !803, file: !305, line: 190, type: !311)
!803 = distinct !DILexicalBlock(scope: !799, file: !305, line: 187, column: 12)
!804 = !DILocalVariable(name: "i", scope: !805, file: !305, line: 191, type: !311)
!805 = distinct !DILexicalBlock(scope: !803, file: !305, line: 191, column: 9)
!806 = !DILocalVariable(name: "dest", scope: !807, file: !305, line: 192, type: !750)
!807 = distinct !DILexicalBlock(scope: !808, file: !305, line: 191, column: 55)
!808 = distinct !DILexicalBlock(scope: !805, file: !305, line: 191, column: 9)
!809 = !DILocation(line: 177, column: 39, scope: !792)
!810 = !DILocation(line: 177, column: 63, scope: !792)
!811 = !DILocation(line: 178, column: 20, scope: !792)
!812 = !DILocation(line: 178, column: 14, scope: !792)
!813 = !DILocation(line: 179, column: 16, scope: !799)
!814 = !DILocation(line: 179, column: 9, scope: !792)
!815 = !DILocation(line: 181, column: 31, scope: !798)
!816 = !DILocation(line: 181, column: 24, scope: !798)
!817 = !DILocation(line: 182, column: 21, scope: !801)
!818 = !DILocation(line: 182, column: 42, scope: !819)
!819 = distinct !DILexicalBlock(scope: !801, file: !305, line: 182, column: 9)
!820 = !{!821, !824, i64 16}
!821 = !{!"_mp_obj_dict_t", !822, i64 0, !823, i64 8}
!822 = !{!"_mp_obj_base_t", !659, i64 0}
!823 = !{!"_mp_map_t", !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 8, !659, i64 16}
!824 = !{!"long", !660, i64 0}
!825 = !DILocation(line: 182, column: 30, scope: !819)
!826 = !DILocation(line: 182, column: 9, scope: !801)
!827 = !DILocation(line: 0, scope: !819)
!828 = !DILocation(line: 0, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !305, line: 183, column: 55)
!830 = distinct !DILexicalBlock(scope: !831, file: !305, line: 183, column: 17)
!831 = distinct !DILexicalBlock(scope: !819, file: !305, line: 182, column: 54)
!832 = !DILocation(line: 183, column: 17, scope: !830)
!833 = !DILocation(line: 183, column: 17, scope: !831)
!834 = !DILocation(line: 184, column: 51, scope: !829)
!835 = !{!821, !659, i64 24}
!836 = !DILocation(line: 184, column: 60, scope: !829)
!837 = !{!838, !659, i64 0}
!838 = !{!"_mp_map_elem_t", !659, i64 0, !659, i64 8}
!839 = !DILocation(line: 184, column: 17, scope: !829)
!840 = !DILocation(line: 185, column: 13, scope: !829)
!841 = !DILocation(line: 182, column: 50, scope: !819)
!842 = distinct !{!842, !826, !843}
!843 = !DILocation(line: 186, column: 9, scope: !801)
!844 = !DILocation(line: 190, column: 24, scope: !803)
!845 = !{!846, !659, i64 32}
!846 = !{!"_mp_state_ctx_t", !847, i64 0, !848, i64 32, !851, i64 336}
!847 = !{!"_mp_state_thread_t", !659, i64 0, !659, i64 8, !659, i64 16, !659, i64 24}
!848 = !{!"_mp_state_vm_t", !659, i64 0, !849, i64 8, !849, i64 40, !821, i64 72, !659, i64 104, !821, i64 112, !850, i64 144, !850, i64 176, !660, i64 208, !659, i64 272, !824, i64 280, !824, i64 288, !824, i64 296}
!849 = !{!"_mp_obj_exception_t", !822, i64 0, !824, i64 8, !824, i64 12, !659, i64 16, !659, i64 24}
!850 = !{!"_mp_obj_list_t", !822, i64 0, !824, i64 8, !824, i64 16, !659, i64 24}
!851 = !{!"_mp_state_mem_t", !659, i64 0, !824, i64 8, !659, i64 16, !659, i64 24, !659, i64 32, !852, i64 40, !660, i64 48, !853, i64 560, !854, i64 562, !824, i64 568, !824, i64 576, !659, i64 584}
!852 = !{!"int", !660, i64 0}
!853 = !{!"short", !660, i64 0}
!854 = !{!"_Bool", !660, i64 0}
!855 = !{!824, !824, i64 0}
!856 = !DILocation(line: 190, column: 16, scope: !803)
!857 = !DILocation(line: 191, column: 21, scope: !805)
!858 = !DILocation(line: 191, column: 41, scope: !808)
!859 = !DILocation(line: 191, column: 9, scope: !805)
!860 = !DILocation(line: 0, scope: !807)
!861 = !DILocation(line: 192, column: 13, scope: !807)
!862 = !DILocation(line: 192, column: 22, scope: !807)
!863 = !DILocation(line: 193, column: 38, scope: !807)
!864 = !DILocation(line: 193, column: 13, scope: !807)
!865 = !DILocation(line: 194, column: 17, scope: !866)
!866 = distinct !DILexicalBlock(scope: !807, file: !305, line: 194, column: 17)
!867 = !DILocation(line: 194, column: 25, scope: !866)
!868 = !DILocation(line: 194, column: 17, scope: !807)
!869 = !DILocation(line: 202, column: 41, scope: !870)
!870 = distinct !DILexicalBlock(scope: !866, file: !305, line: 194, column: 41)
!871 = !DILocation(line: 202, column: 17, scope: !870)
!872 = !DILocation(line: 203, column: 13, scope: !870)
!873 = !DILocation(line: 204, column: 9, scope: !808)
!874 = !DILocation(line: 191, column: 50, scope: !808)
!875 = distinct !{!875, !859, !876}
!876 = !DILocation(line: 204, column: 9, scope: !805)
!877 = !DILocation(line: 206, column: 5, scope: !792)
!878 = distinct !DISubprogram(name: "mp_builtin_divmod", scope: !305, file: !305, line: 210, type: !522, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!879 = !{!880, !881}
!880 = !DILocalVariable(name: "o1_in", arg: 1, scope: !878, file: !305, line: 210, type: !309)
!881 = !DILocalVariable(name: "o2_in", arg: 2, scope: !878, file: !305, line: 210, type: !309)
!882 = !DILocation(line: 210, column: 44, scope: !878)
!883 = !DILocation(line: 210, column: 60, scope: !878)
!884 = !DILocation(line: 211, column: 12, scope: !878)
!885 = !DILocation(line: 211, column: 5, scope: !878)
!886 = distinct !DISubprogram(name: "mp_builtin_hash", scope: !305, file: !305, line: 215, type: !476, scopeLine: 215, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !887)
!887 = !{!888}
!888 = !DILocalVariable(name: "o_in", arg: 1, scope: !886, file: !305, line: 215, type: !309)
!889 = !DILocation(line: 215, column: 42, scope: !886)
!890 = !DILocation(line: 217, column: 12, scope: !886)
!891 = !DILocation(line: 217, column: 5, scope: !886)
!892 = distinct !DISubprogram(name: "mp_builtin_hex", scope: !305, file: !305, line: 221, type: !476, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !893)
!893 = !{!894}
!894 = !DILocalVariable(name: "o_in", arg: 1, scope: !892, file: !305, line: 221, type: !309)
!895 = !DILocation(line: 221, column: 41, scope: !892)
!896 = !DILocation(line: 222, column: 12, scope: !892)
!897 = !DILocation(line: 222, column: 5, scope: !892)
!898 = distinct !DISubprogram(name: "mp_builtin_iter", scope: !305, file: !305, line: 255, type: !476, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !899)
!899 = !{!900}
!900 = !DILocalVariable(name: "o_in", arg: 1, scope: !898, file: !305, line: 255, type: !309)
!901 = !DILocation(line: 255, column: 42, scope: !898)
!902 = !DILocation(line: 256, column: 12, scope: !898)
!903 = !DILocation(line: 256, column: 5, scope: !898)
!904 = distinct !DISubprogram(name: "mp_builtin_next", scope: !305, file: !305, line: 316, type: !476, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!905 = !{!906, !907}
!906 = !DILocalVariable(name: "o", arg: 1, scope: !904, file: !305, line: 316, type: !309)
!907 = !DILocalVariable(name: "ret", scope: !904, file: !305, line: 317, type: !309)
!908 = !DILocation(line: 316, column: 42, scope: !904)
!909 = !DILocation(line: 317, column: 20, scope: !904)
!910 = !DILocation(line: 317, column: 14, scope: !904)
!911 = !DILocation(line: 318, column: 13, scope: !912)
!912 = distinct !DILexicalBlock(scope: !904, file: !305, line: 318, column: 9)
!913 = !DILocation(line: 318, column: 9, scope: !904)
!914 = !DILocation(line: 319, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !912, file: !305, line: 318, column: 39)
!916 = !DILocation(line: 321, column: 9, scope: !917)
!917 = distinct !DILexicalBlock(scope: !912, file: !305, line: 320, column: 12)
!918 = distinct !DISubprogram(name: "mp_builtin_oct", scope: !305, file: !305, line: 326, type: !476, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !919)
!919 = !{!920}
!920 = !DILocalVariable(name: "o_in", arg: 1, scope: !918, file: !305, line: 326, type: !309)
!921 = !DILocation(line: 326, column: 41, scope: !918)
!922 = !DILocation(line: 327, column: 12, scope: !918)
!923 = !DILocation(line: 327, column: 5, scope: !918)
!924 = distinct !DISubprogram(name: "mp_builtin_ord", scope: !305, file: !305, line: 331, type: !476, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !925)
!925 = !{!926, !927, !928}
!926 = !DILocalVariable(name: "o_in", arg: 1, scope: !924, file: !305, line: 331, type: !309)
!927 = !DILocalVariable(name: "len", scope: !924, file: !305, line: 332, type: !311)
!928 = !DILocalVariable(name: "str", scope: !924, file: !305, line: 333, type: !388)
!929 = !DILocation(line: 331, column: 41, scope: !924)
!930 = !DILocation(line: 332, column: 5, scope: !924)
!931 = !DILocation(line: 332, column: 12, scope: !924)
!932 = !DILocation(line: 333, column: 36, scope: !924)
!933 = !DILocation(line: 333, column: 17, scope: !924)
!934 = !DILocation(line: 344, column: 13, scope: !935)
!935 = distinct !DILexicalBlock(scope: !936, file: !305, line: 344, column: 13)
!936 = distinct !DILexicalBlock(scope: !924, file: !305, line: 342, column: 5)
!937 = !DILocation(line: 344, column: 17, scope: !935)
!938 = !DILocation(line: 344, column: 13, scope: !936)
!939 = !DILocation(line: 345, column: 20, scope: !940)
!940 = distinct !DILexicalBlock(scope: !935, file: !305, line: 344, column: 23)
!941 = !DILocation(line: 355, column: 1, scope: !924)
!942 = !DILocation(line: 345, column: 13, scope: !940)
!943 = !DILocation(line: 350, column: 28, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !305, line: 349, column: 67)
!945 = distinct !DILexicalBlock(scope: !924, file: !305, line: 349, column: 9)
!946 = !DILocation(line: 350, column: 9, scope: !944)
!947 = distinct !DISubprogram(name: "mp_builtin_pow", scope: !305, file: !305, line: 358, type: !552, scopeLine: 358, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !948)
!948 = !{!949, !950}
!949 = !DILocalVariable(name: "n_args", arg: 1, scope: !947, file: !305, line: 358, type: !311)
!950 = !DILocalVariable(name: "args", arg: 2, scope: !947, file: !305, line: 358, type: !316)
!951 = !DILocation(line: 358, column: 39, scope: !947)
!952 = !DILocation(line: 358, column: 63, scope: !947)
!953 = !DILocation(line: 359, column: 5, scope: !947)
!954 = !DILocation(line: 360, column: 57, scope: !955)
!955 = distinct !DILexicalBlock(scope: !947, file: !305, line: 359, column: 21)
!956 = !DILocation(line: 360, column: 66, scope: !955)
!957 = !DILocation(line: 360, column: 24, scope: !955)
!958 = !DILocation(line: 360, column: 17, scope: !955)
!959 = !DILocation(line: 363, column: 56, scope: !955)
!960 = !DILocation(line: 363, column: 13, scope: !955)
!961 = !DILocation(line: 373, column: 41, scope: !306)
!962 = !DILocation(line: 373, column: 65, scope: !306)
!963 = !DILocation(line: 373, column: 85, scope: !306)
!964 = !DILocation(line: 386, column: 5, scope: !306)
!965 = !DILocation(line: 390, column: 83, scope: !306)
!966 = !DILocation(line: 390, column: 5, scope: !306)
!967 = !DILocation(line: 399, column: 36, scope: !306)
!968 = !DILocation(line: 399, column: 14, scope: !306)
!969 = !DILocation(line: 400, column: 20, scope: !306)
!970 = !DILocation(line: 400, column: 36, scope: !306)
!971 = !DILocation(line: 400, column: 14, scope: !306)
!972 = !DILocation(line: 402, column: 54, scope: !306)
!973 = !DILocation(line: 402, column: 28, scope: !306)
!974 = !DILocation(line: 402, column: 17, scope: !306)
!975 = !DILocation(line: 404, column: 54, scope: !306)
!976 = !DILocation(line: 404, column: 28, scope: !306)
!977 = !DILocation(line: 404, column: 17, scope: !306)
!978 = !DILocation(line: 406, column: 17, scope: !377)
!979 = !DILocation(line: 406, column: 26, scope: !980)
!980 = distinct !DILexicalBlock(scope: !377, file: !305, line: 406, column: 5)
!981 = !DILocation(line: 406, column: 5, scope: !377)
!982 = !DILocation(line: 426, column: 45, scope: !306)
!983 = !DILocation(line: 426, column: 5, scope: !306)
!984 = !DILocation(line: 429, column: 1, scope: !306)
!985 = !DILocation(line: 428, column: 5, scope: !306)
!986 = !DILocation(line: 407, column: 15, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !305, line: 407, column: 13)
!988 = distinct !DILexicalBlock(scope: !980, file: !305, line: 406, column: 41)
!989 = !DILocation(line: 407, column: 13, scope: !988)
!990 = !DILocation(line: 411, column: 53, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !305, line: 407, column: 20)
!992 = !DILocation(line: 411, column: 13, scope: !991)
!993 = !DILocation(line: 413, column: 9, scope: !991)
!994 = !DILocation(line: 417, column: 45, scope: !988)
!995 = !DILocation(line: 417, column: 9, scope: !988)
!996 = !DILocation(line: 406, column: 37, scope: !980)
!997 = distinct !{!997, !981, !998}
!998 = !DILocation(line: 419, column: 5, scope: !377)
!999 = distinct !DISubprogram(name: "mp_builtin___repl_print__", scope: !305, file: !305, line: 432, type: !476, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1000)
!1000 = !{!1001}
!1001 = !DILocalVariable(name: "o", arg: 1, scope: !999, file: !305, line: 432, type: !309)
!1002 = !DILocation(line: 432, column: 52, scope: !999)
!1003 = !DILocation(line: 433, column: 11, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !999, file: !305, line: 433, column: 9)
!1005 = !DILocation(line: 433, column: 9, scope: !999)
!1006 = !DILocation(line: 434, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !305, line: 433, column: 29)
!1008 = !DILocation(line: 435, column: 9, scope: !1007)
!1009 = !DILocation(line: 441, column: 5, scope: !1007)
!1010 = !DILocation(line: 442, column: 5, scope: !999)
!1011 = distinct !DISubprogram(name: "mp_builtin_repr", scope: !305, file: !305, line: 446, type: !476, scopeLine: 446, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1012)
!1012 = !{!1013, !1014, !1022}
!1013 = !DILocalVariable(name: "o_in", arg: 1, scope: !1011, file: !305, line: 446, type: !309)
!1014 = !DILocalVariable(name: "vstr", scope: !1011, file: !305, line: 447, type: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !391, line: 165, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !391, line: 160, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1016, file: !391, line: 161, baseType: !311, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1016, file: !391, line: 162, baseType: !311, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1016, file: !391, line: 163, baseType: !387, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !1016, file: !391, line: 164, baseType: !349, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1022 = !DILocalVariable(name: "print", scope: !1011, file: !305, line: 448, type: !416)
!1023 = !DILocation(line: 446, column: 42, scope: !1011)
!1024 = !DILocation(line: 447, column: 5, scope: !1011)
!1025 = !DILocation(line: 448, column: 5, scope: !1011)
!1026 = !DILocation(line: 447, column: 12, scope: !1011)
!1027 = !DILocation(line: 448, column: 16, scope: !1011)
!1028 = !DILocation(line: 449, column: 5, scope: !1011)
!1029 = !DILocation(line: 450, column: 5, scope: !1011)
!1030 = !DILocation(line: 451, column: 12, scope: !1011)
!1031 = !DILocation(line: 452, column: 1, scope: !1011)
!1032 = !DILocation(line: 451, column: 5, scope: !1011)
!1033 = distinct !DISubprogram(name: "mp_builtin_round", scope: !305, file: !305, line: 455, type: !552, scopeLine: 455, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1041}
!1035 = !DILocalVariable(name: "n_args", arg: 1, scope: !1033, file: !305, line: 455, type: !311)
!1036 = !DILocalVariable(name: "args", arg: 2, scope: !1033, file: !305, line: 455, type: !316)
!1037 = !DILocalVariable(name: "o_in", scope: !1033, file: !305, line: 456, type: !309)
!1038 = !DILocalVariable(name: "num_dig", scope: !1039, file: !305, line: 462, type: !351)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !305, line: 457, column: 30)
!1040 = distinct !DILexicalBlock(scope: !1033, file: !305, line: 457, column: 9)
!1041 = !DILocalVariable(name: "r", scope: !1033, file: !305, line: 501, type: !351)
!1042 = !DILocation(line: 455, column: 41, scope: !1033)
!1043 = !DILocation(line: 455, column: 65, scope: !1033)
!1044 = !DILocation(line: 456, column: 21, scope: !1033)
!1045 = !DILocation(line: 456, column: 14, scope: !1033)
!1046 = !DILocation(line: 457, column: 9, scope: !1040)
!1047 = !{!822, !659, i64 0}
!1048 = !DILocation(line: 457, column: 9, scope: !1033)
!1049 = !DILocation(line: 458, column: 20, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1039, file: !305, line: 458, column: 13)
!1051 = !DILocation(line: 458, column: 13, scope: !1039)
!1052 = !DILocation(line: 462, column: 43, scope: !1039)
!1053 = !DILocation(line: 462, column: 28, scope: !1039)
!1054 = !DILocation(line: 462, column: 18, scope: !1039)
!1055 = !DILocation(line: 463, column: 21, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1039, file: !305, line: 463, column: 13)
!1057 = !DILocation(line: 463, column: 13, scope: !1039)
!1058 = !DILocation(line: 467, column: 9, scope: !1039)
!1059 = !DILocation(line: 501, column: 18, scope: !1033)
!1060 = !DILocation(line: 501, column: 14, scope: !1033)
!1061 = !DILocation(line: 502, column: 12, scope: !1033)
!1062 = !DILocation(line: 0, scope: !1033)
!1063 = !DILocation(line: 504, column: 1, scope: !1033)
!1064 = distinct !DISubprogram(name: "mp_builtin_sum", scope: !305, file: !305, line: 507, type: !552, scopeLine: 507, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071}
!1066 = !DILocalVariable(name: "n_args", arg: 1, scope: !1064, file: !305, line: 507, type: !311)
!1067 = !DILocalVariable(name: "args", arg: 2, scope: !1064, file: !305, line: 507, type: !316)
!1068 = !DILocalVariable(name: "value", scope: !1064, file: !305, line: 508, type: !309)
!1069 = !DILocalVariable(name: "iter_buf", scope: !1064, file: !305, line: 513, type: !467)
!1070 = !DILocalVariable(name: "iterable", scope: !1064, file: !305, line: 514, type: !309)
!1071 = !DILocalVariable(name: "item", scope: !1064, file: !305, line: 515, type: !309)
!1072 = !DILocation(line: 507, column: 39, scope: !1064)
!1073 = !DILocation(line: 507, column: 63, scope: !1064)
