; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/modbuiltins.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/modbuiltins.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_fun_builtin_fixed_t = type { %struct._mp_obj_base_t, %union.anon.0 }
%union.anon.0 = type { i8* ()* }
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%struct._mp_obj_module_t = type { %struct._mp_obj_base_t, %struct._mp_obj_dict_t* }
%struct._mp_obj_none_t = type opaque

!233 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!234 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!235 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!236 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!237 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!238 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!239 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!240 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!241 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!242 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!243 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!244 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!245 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!246 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!247 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!248 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!249 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!250 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!251 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!252 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!253 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!254 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!255 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!256 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!257 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!258 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!259 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!260 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!261 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!262 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!263 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!264 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!265 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!266 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!267 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!268 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!269 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!270 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!271 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!272 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!273 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!274 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!275 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!276 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!277 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!278 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!279 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!280 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!281 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!282 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!283 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!284 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!285 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!286 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!287 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!288 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!289 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!290 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!291 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!292 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!293 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!294 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!295 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!296 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!297 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!298 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!299 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!300 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!301 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!302 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !304, file: !3, line: 374, size: 32, elements: !376)
!304 = distinct !DISubprogram(name: "mp_builtin_print", scope: !3, file: !3, line: 373, type: !305, isLocal: true, isDefinition: true, scopeLine: 373, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !333)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !309, !314, !316}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 31, baseType: !311)
!310 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !312, line: 92, baseType: !313)
!312 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!313 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !318, file: !6, line: 366, baseType: !309, size: 1, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !318, file: !6, line: 367, baseType: !309, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !318, file: !6, line: 368, baseType: !309, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !318, file: !6, line: 369, baseType: !309, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !318, file: !6, line: 371, baseType: !309, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !318, file: !6, line: 372, baseType: !309, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !318, file: !6, line: 373, baseType: !327, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !329, file: !6, line: 351, baseType: !307, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !329, file: !6, line: 352, baseType: !307, size: 64, offset: 64)
!333 = !{!334, !335, !336, !337, !367, !368, !369, !373, !374}
!334 = !DILocalVariable(name: "n_args", arg: 1, scope: !304, file: !3, line: 373, type: !309)
!335 = !DILocalVariable(name: "pos_args", arg: 2, scope: !304, file: !3, line: 373, type: !314)
!336 = !DILocalVariable(name: "kw_args", arg: 3, scope: !304, file: !3, line: 373, type: !316)
!337 = !DILocalVariable(name: "u", scope: !304, file: !3, line: 388, type: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !304, file: !3, line: 385, size: 192, elements: !339)
!339 = !{!340, !363}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !338, file: !3, line: 386, baseType: !341, size: 192)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 192, elements: !361)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_val_t", file: !343, line: 52, baseType: !344)
!343 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_mp_arg_val_t", file: !343, line: 47, size: 64, elements: !345)
!345 = !{!346, !348, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "u_bool", scope: !344, file: !343, line: 48, baseType: !347, size: 8)
!347 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "u_int", scope: !344, file: !343, line: 49, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !350, line: 70, baseType: !351)
!350 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !352, line: 32, baseType: !353)
!352 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !312, line: 49, baseType: !354)
!354 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "u_obj", scope: !344, file: !343, line: 50, baseType: !307, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "u_rom_obj", scope: !344, file: !343, line: 51, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!361 = !{!362}
!362 = !DISubrange(count: 3)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !338, file: !3, line: 387, baseType: !364, size: 128)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 2)
!367 = !DILocalVariable(name: "sep", scope: !304, file: !3, line: 397, type: !307)
!368 = !DILocalVariable(name: "end", scope: !304, file: !3, line: 398, type: !307)
!369 = !DILocalVariable(name: "sep_data", scope: !304, file: !3, line: 399, type: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!373 = !DILocalVariable(name: "end_data", scope: !304, file: !3, line: 400, type: !370)
!374 = !DILocalVariable(name: "i", scope: !375, file: !3, line: 402, type: !309)
!375 = distinct !DILexicalBlock(scope: !304, file: !3, line: 402, column: 5)
!376 = !{!377, !378, !379, !380}
!377 = !DIEnumerator(name: "ARG_sep", value: 0)
!378 = !DIEnumerator(name: "ARG_end", value: 1)
!379 = !DIEnumerator(name: "ARG_flush", value: 2)
!380 = !DIEnumerator(name: "ARG_file", value: 3)
!381 = !{!308, !307, !382, !385, !386, !391, !349}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !350, line: 71, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !384, line: 30, baseType: !313)
!384 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !389, line: 39, baseType: !390)
!389 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!390 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !393, file: !6, line: 57, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !400)
!400 = !{!401, !402, !406, !407, !425, !430, !435, !441, !447, !454, !459, !471, !476, !492, !493, !494}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !399, file: !6, line: 476, baseType: !392, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !6, line: 479, baseType: !403, size: 16, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !404, line: 31, baseType: !405)
!404 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!405 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !6, line: 482, baseType: !403, size: 16, offset: 80)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !399, file: !6, line: 485, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412, !307, !424}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !415, line: 53, baseType: !416)
!415 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !415, line: 50, size: 128, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !416, file: !415, line: 51, baseType: !308, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !416, file: !415, line: 52, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !415, line: 48, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !308, !370, !309}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !399, file: !6, line: 488, baseType: !426, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!307, !396, !309, !314, !316}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !399, file: !6, line: 491, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!307, !307, !309, !309, !314}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !399, file: !6, line: 495, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!307, !440, !307}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !399, file: !6, line: 496, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!307, !446, !307, !307}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !399, file: !6, line: 509, baseType: !448, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !307, !452, !453}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !70, line: 48, baseType: !309)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !399, file: !6, line: 516, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!307, !307, !307, !307}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !399, file: !6, line: 521, baseType: !460, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!307, !307, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !466, file: !6, line: 433, baseType: !392, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !466, file: !6, line: 434, baseType: !470, size: 192, offset: 64)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 192, elements: !361)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !399, file: !6, line: 525, baseType: !472, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!307, !307}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !399, file: !6, line: 528, baseType: !477, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !478, file: !6, line: 469, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!349, !307, !484, !382}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !486, file: !6, line: 457, baseType: !308, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !486, file: !6, line: 458, baseType: !309, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !486, file: !6, line: 459, baseType: !491, size: 32, offset: 128)
!491 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !399, file: !6, line: 531, baseType: !359, size: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !399, file: !6, line: 537, baseType: !359, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !399, file: !6, line: 540, baseType: !495, size: 64, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !496, file: !6, line: 776, baseType: !392, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !496, file: !6, line: 777, baseType: !317, size: 192, offset: 64)
!500 = !{!0, !501, !524, !526, !528, !530, !532, !534, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !601, !610, !620}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "mp_builtin_abs_obj", scope: !2, file: !3, line: 96, type: !503, isLocal: false, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !505, file: !6, line: 795, baseType: !392, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !505, file: !6, line: 801, baseType: !509, size: 64, offset: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !505, file: !6, line: 796, size: 64, elements: !510)
!510 = !{!511, !516, !517, !522}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !509, file: !6, line: 797, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!307}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !509, file: !6, line: 798, baseType: !472, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !509, file: !6, line: 799, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!307, !307, !307}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !509, file: !6, line: 800, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !456)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "mp_builtin_all_obj", scope: !2, file: !3, line: 109, type: !503, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "mp_builtin_any_obj", scope: !2, file: !3, line: 122, type: !503, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "mp_builtin_bin_obj", scope: !2, file: !3, line: 128, type: !503, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "mp_builtin_callable_obj", scope: !2, file: !3, line: 137, type: !503, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "mp_builtin_chr_obj", scope: !2, file: !3, line: 175, type: !503, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mp_builtin_dir_obj", scope: !2, file: !3, line: 208, type: !536, isLocal: false, isDefinition: true)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !538, file: !6, line: 806, baseType: !392, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !538, file: !6, line: 807, baseType: !347, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !538, file: !6, line: 808, baseType: !382, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !538, file: !6, line: 809, baseType: !382, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !538, file: !6, line: 813, baseType: !545, size: 64, offset: 128)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !538, file: !6, line: 810, size: 64, elements: !546)
!546 = !{!547, !552}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !545, file: !6, line: 811, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!307, !309, !314}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !545, file: !6, line: 812, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "mp_builtin_divmod_obj", scope: !2, file: !3, line: 213, type: !503, isLocal: false, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "mp_builtin_hash_obj", scope: !2, file: !3, line: 219, type: !503, isLocal: false, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "mp_builtin_hex_obj", scope: !2, file: !3, line: 224, type: !503, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "mp_builtin_iter_obj", scope: !2, file: !3, line: 258, type: !503, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "mp_builtin_next_obj", scope: !2, file: !3, line: 324, type: !503, isLocal: false, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "mp_builtin_oct_obj", scope: !2, file: !3, line: 329, type: !503, isLocal: false, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "mp_builtin_ord_obj", scope: !2, file: !3, line: 356, type: !503, isLocal: false, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "mp_builtin_pow_obj", scope: !2, file: !3, line: 371, type: !536, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "mp_builtin_print_obj", scope: !2, file: !3, line: 426, type: !536, isLocal: false, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "mp_builtin___repl_print___obj", scope: !2, file: !3, line: 440, type: !503, isLocal: false, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "mp_builtin_repr_obj", scope: !2, file: !3, line: 449, type: !503, isLocal: false, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "mp_builtin_round_obj", scope: !2, file: !3, line: 501, type: !536, isLocal: false, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "mp_builtin_sum_obj", scope: !2, file: !3, line: 517, type: !536, isLocal: false, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "mp_builtin_sorted_obj", scope: !2, file: !3, line: 528, type: !536, isLocal: false, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "mp_builtin_getattr_obj", scope: !2, file: !3, line: 553, type: !536, isLocal: false, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "mp_builtin_setattr_obj", scope: !2, file: !3, line: 559, type: !503, isLocal: false, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mp_builtin_hasattr_obj", scope: !2, file: !3, line: 574, type: !503, isLocal: false, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "mp_builtin_globals_obj", scope: !2, file: !3, line: 579, type: !503, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "mp_builtin_locals_obj", scope: !2, file: !3, line: 584, type: !503, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "mp_builtin_id_obj", scope: !2, file: !3, line: 587, type: !503, isLocal: false, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "mp_builtin_len_obj", scope: !2, file: !3, line: 588, type: !503, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "mp_module_builtins_globals", scope: !2, file: !3, line: 753, type: !599, isLocal: false, isDefinition: true)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !496)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "mp_module_builtins", scope: !2, file: !3, line: 755, type: !603, isLocal: false, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !6, line: 831, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !6, line: 828, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !605, file: !6, line: 829, baseType: !392, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !605, file: !6, line: 830, baseType: !609, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "allowed_args", scope: !304, file: !3, line: 375, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 384, elements: !361)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_t", file: !343, line: 58, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_arg_t", file: !343, line: 54, size: 128, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !615, file: !343, line: 55, baseType: !403, size: 16)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !615, file: !343, line: 56, baseType: !403, size: 16, offset: 16)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !615, file: !343, line: 57, baseType: !342, size: 64, offset: 64)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "mp_module_builtins_globals_table", scope: !2, file: !3, line: 590, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 10240, elements: !629)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !625, file: !6, line: 356, baseType: !357, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !625, file: !6, line: 357, baseType: !357, size: 64, offset: 64)
!629 = !{!630}
!630 = !DISubrange(count: 80)
!631 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!632 = !{i32 2, !"Dwarf Version", i32 4}
!633 = !{i32 2, !"Debug Info Version", i32 3}
!634 = !{i32 1, !"wchar_size", i32 4}
!635 = !{i32 7, !"PIC Level", i32 2}
!636 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!637 = distinct !DISubprogram(name: "mp_builtin___build_class__", scope: !3, file: !3, line: 51, type: !550, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646}
!639 = !DILocalVariable(name: "n_args", arg: 1, scope: !637, file: !3, line: 51, type: !309)
!640 = !DILocalVariable(name: "args", arg: 2, scope: !637, file: !3, line: 51, type: !314)
!641 = !DILocalVariable(name: "old_locals", scope: !637, file: !3, line: 55, type: !609)
!642 = !DILocalVariable(name: "class_locals", scope: !637, file: !3, line: 56, type: !307)
!643 = !DILocalVariable(name: "cell", scope: !637, file: !3, line: 60, type: !307)
!644 = !DILocalVariable(name: "meta", scope: !637, file: !3, line: 66, type: !307)
!645 = !DILocalVariable(name: "meta_args", scope: !637, file: !3, line: 78, type: !470)
!646 = !DILocalVariable(name: "new_class", scope: !637, file: !3, line: 82, type: !307)
!647 = !DILocation(line: 51, column: 51, scope: !637)
!648 = !DILocation(line: 51, column: 75, scope: !637)
!649 = !DILocation(line: 55, column: 33, scope: !637)
!650 = !DILocation(line: 55, column: 20, scope: !637)
!651 = !DILocation(line: 56, column: 29, scope: !637)
!652 = !DILocation(line: 56, column: 14, scope: !637)
!653 = !DILocation(line: 57, column: 19, scope: !637)
!654 = !DILocation(line: 57, column: 5, scope: !637)
!655 = !DILocation(line: 60, column: 40, scope: !637)
!656 = !{!657, !657, i64 0}
!657 = !{!"any pointer", !658, i64 0}
!658 = !{!"omnipotent char", !659, i64 0}
!659 = !{!"Simple C/C++ TBAA"}
!660 = !DILocation(line: 60, column: 21, scope: !637)
!661 = !DILocation(line: 60, column: 14, scope: !637)
!662 = !DILocation(line: 63, column: 5, scope: !637)
!663 = !DILocation(line: 67, column: 16, scope: !664)
!664 = distinct !DILexicalBlock(scope: !637, file: !3, line: 67, column: 9)
!665 = !DILocation(line: 67, column: 9, scope: !637)
!666 = !DILocation(line: 72, column: 16, scope: !667)
!667 = distinct !DILexicalBlock(scope: !664, file: !3, line: 70, column: 12)
!668 = !DILocation(line: 66, column: 14, scope: !637)
!669 = !DILocation(line: 0, scope: !667)
!670 = !DILocation(line: 78, column: 5, scope: !637)
!671 = !DILocation(line: 78, column: 14, scope: !637)
!672 = !DILocation(line: 79, column: 20, scope: !637)
!673 = !DILocation(line: 79, column: 18, scope: !637)
!674 = !DILocation(line: 80, column: 44, scope: !637)
!675 = !DILocation(line: 80, column: 54, scope: !637)
!676 = !DILocation(line: 80, column: 20, scope: !637)
!677 = !DILocation(line: 80, column: 5, scope: !637)
!678 = !DILocation(line: 80, column: 18, scope: !637)
!679 = !DILocation(line: 81, column: 5, scope: !637)
!680 = !DILocation(line: 81, column: 18, scope: !637)
!681 = !DILocation(line: 82, column: 60, scope: !637)
!682 = !DILocation(line: 82, column: 26, scope: !637)
!683 = !DILocation(line: 82, column: 14, scope: !637)
!684 = !DILocation(line: 85, column: 14, scope: !685)
!685 = distinct !DILexicalBlock(scope: !637, file: !3, line: 85, column: 9)
!686 = !DILocation(line: 85, column: 9, scope: !637)
!687 = !DILocation(line: 86, column: 9, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !3, line: 85, column: 32)
!689 = !DILocation(line: 87, column: 5, scope: !688)
!690 = !DILocation(line: 90, column: 1, scope: !637)
!691 = !DILocation(line: 89, column: 5, scope: !637)
!692 = distinct !DISubprogram(name: "mp_builtin_abs", scope: !3, file: !3, line: 93, type: !474, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !693)
!693 = !{!694}
!694 = !DILocalVariable(name: "o_in", arg: 1, scope: !692, file: !3, line: 93, type: !307)
!695 = !DILocation(line: 93, column: 41, scope: !692)
!696 = !DILocation(line: 94, column: 12, scope: !692)
!697 = !DILocation(line: 94, column: 5, scope: !692)
!698 = distinct !DISubprogram(name: "mp_builtin_all", scope: !3, file: !3, line: 98, type: !474, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !699)
!699 = !{!700, !701, !702, !703}
!700 = !DILocalVariable(name: "o_in", arg: 1, scope: !698, file: !3, line: 98, type: !307)
!701 = !DILocalVariable(name: "iter_buf", scope: !698, file: !3, line: 99, type: !465)
!702 = !DILocalVariable(name: "iterable", scope: !698, file: !3, line: 100, type: !307)
!703 = !DILocalVariable(name: "item", scope: !698, file: !3, line: 101, type: !307)
!704 = !DILocation(line: 98, column: 41, scope: !698)
!705 = !DILocation(line: 99, column: 5, scope: !698)
!706 = !DILocation(line: 99, column: 23, scope: !698)
!707 = !DILocation(line: 100, column: 25, scope: !698)
!708 = !DILocation(line: 100, column: 14, scope: !698)
!709 = !DILocation(line: 102, column: 5, scope: !698)
!710 = !DILocation(line: 102, column: 20, scope: !698)
!711 = !DILocation(line: 101, column: 14, scope: !698)
!712 = !DILocation(line: 102, column: 43, scope: !698)
!713 = !DILocation(line: 103, column: 14, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !3, line: 103, column: 13)
!715 = distinct !DILexicalBlock(scope: !698, file: !3, line: 102, column: 69)
!716 = !DILocation(line: 103, column: 13, scope: !715)
!717 = distinct !{!717, !709, !718}
!718 = !DILocation(line: 106, column: 5, scope: !698)
!719 = !DILocation(line: 0, scope: !698)
!720 = !DILocation(line: 108, column: 1, scope: !698)
!721 = distinct !DISubprogram(name: "mp_builtin_any", scope: !3, file: !3, line: 111, type: !474, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DILocalVariable(name: "o_in", arg: 1, scope: !721, file: !3, line: 111, type: !307)
!724 = !DILocalVariable(name: "iter_buf", scope: !721, file: !3, line: 112, type: !465)
!725 = !DILocalVariable(name: "iterable", scope: !721, file: !3, line: 113, type: !307)
!726 = !DILocalVariable(name: "item", scope: !721, file: !3, line: 114, type: !307)
!727 = !DILocation(line: 111, column: 41, scope: !721)
!728 = !DILocation(line: 112, column: 5, scope: !721)
!729 = !DILocation(line: 112, column: 23, scope: !721)
!730 = !DILocation(line: 113, column: 25, scope: !721)
!731 = !DILocation(line: 113, column: 14, scope: !721)
!732 = !DILocation(line: 115, column: 5, scope: !721)
!733 = !DILocation(line: 115, column: 20, scope: !721)
!734 = !DILocation(line: 114, column: 14, scope: !721)
!735 = !DILocation(line: 115, column: 43, scope: !721)
!736 = !DILocation(line: 116, column: 13, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 116, column: 13)
!738 = distinct !DILexicalBlock(scope: !721, file: !3, line: 115, column: 69)
!739 = !DILocation(line: 116, column: 13, scope: !738)
!740 = distinct !{!740, !732, !741}
!741 = !DILocation(line: 119, column: 5, scope: !721)
!742 = !DILocation(line: 0, scope: !721)
!743 = !DILocation(line: 121, column: 1, scope: !721)
!744 = distinct !DISubprogram(name: "mp_builtin_bin", scope: !3, file: !3, line: 124, type: !474, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !745)
!745 = !{!746, !747}
!746 = !DILocalVariable(name: "o_in", arg: 1, scope: !744, file: !3, line: 124, type: !307)
!747 = !DILocalVariable(name: "args", scope: !744, file: !3, line: 125, type: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 128, elements: !365)
!749 = !DILocation(line: 124, column: 41, scope: !744)
!750 = !DILocation(line: 125, column: 5, scope: !744)
!751 = !DILocation(line: 125, column: 14, scope: !744)
!752 = !DILocation(line: 125, column: 23, scope: !744)
!753 = !DILocation(line: 126, column: 12, scope: !744)
!754 = !DILocation(line: 127, column: 1, scope: !744)
!755 = !DILocation(line: 126, column: 5, scope: !744)
!756 = distinct !DISubprogram(name: "mp_builtin_callable", scope: !3, file: !3, line: 130, type: !474, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !757)
!757 = !{!758}
!758 = !DILocalVariable(name: "o_in", arg: 1, scope: !756, file: !3, line: 130, type: !307)
!759 = !DILocation(line: 130, column: 46, scope: !756)
!760 = !DILocation(line: 131, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !756, file: !3, line: 131, column: 9)
!762 = !DILocation(line: 132, column: 9, scope: !763)
!763 = distinct !DILexicalBlock(scope: !761, file: !3, line: 131, column: 35)
!764 = !DILocation(line: 136, column: 1, scope: !756)
!765 = distinct !DISubprogram(name: "mp_builtin_chr", scope: !3, file: !3, line: 139, type: !474, isLocal: true, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !766)
!766 = !{!767, !768, !769}
!767 = !DILocalVariable(name: "o_in", arg: 1, scope: !765, file: !3, line: 139, type: !307)
!768 = !DILocalVariable(name: "ord", scope: !765, file: !3, line: 166, type: !349)
!769 = !DILocalVariable(name: "str", scope: !770, file: !3, line: 168, type: !772)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 167, column: 34)
!771 = distinct !DILexicalBlock(scope: !765, file: !3, line: 167, column: 9)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 8, elements: !775)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !774, line: 31, baseType: !390)
!774 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!775 = !{!776}
!776 = !DISubrange(count: 1)
!777 = !DILocation(line: 139, column: 41, scope: !765)
!778 = !DILocation(line: 166, column: 20, scope: !765)
!779 = !DILocation(line: 166, column: 14, scope: !765)
!780 = !DILocation(line: 167, column: 18, scope: !771)
!781 = !DILocation(line: 168, column: 9, scope: !770)
!782 = !DILocation(line: 168, column: 17, scope: !770)
!783 = !DILocation(line: 168, column: 27, scope: !770)
!784 = !DILocation(line: 168, column: 26, scope: !770)
!785 = !{!658, !658, i64 0}
!786 = !DILocation(line: 169, column: 16, scope: !770)
!787 = !DILocation(line: 170, column: 5, scope: !771)
!788 = !DILocation(line: 169, column: 9, scope: !770)
!789 = !DILocation(line: 171, column: 29, scope: !790)
!790 = distinct !DILexicalBlock(scope: !771, file: !3, line: 170, column: 12)
!791 = !DILocation(line: 171, column: 9, scope: !790)
!792 = distinct !DISubprogram(name: "mp_builtin_dir", scope: !3, file: !3, line: 177, type: !550, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !793)
!793 = !{!794, !795, !796, !797, !800, !802, !804, !806}
!794 = !DILocalVariable(name: "n_args", arg: 1, scope: !792, file: !3, line: 177, type: !309)
!795 = !DILocalVariable(name: "args", arg: 2, scope: !792, file: !3, line: 177, type: !314)
!796 = !DILocalVariable(name: "dir", scope: !792, file: !3, line: 178, type: !307)
!797 = !DILocalVariable(name: "dict", scope: !798, file: !3, line: 181, type: !609)
!798 = distinct !DILexicalBlock(scope: !799, file: !3, line: 179, column: 22)
!799 = distinct !DILexicalBlock(scope: !792, file: !3, line: 179, column: 9)
!800 = !DILocalVariable(name: "i", scope: !801, file: !3, line: 182, type: !309)
!801 = distinct !DILexicalBlock(scope: !798, file: !3, line: 182, column: 9)
!802 = !DILocalVariable(name: "nqstr", scope: !803, file: !3, line: 190, type: !309)
!803 = distinct !DILexicalBlock(scope: !799, file: !3, line: 187, column: 12)
!804 = !DILocalVariable(name: "i", scope: !805, file: !3, line: 191, type: !309)
!805 = distinct !DILexicalBlock(scope: !803, file: !3, line: 191, column: 9)
!806 = !DILocalVariable(name: "dest", scope: !807, file: !3, line: 192, type: !748)
!807 = distinct !DILexicalBlock(scope: !808, file: !3, line: 191, column: 55)
!808 = distinct !DILexicalBlock(scope: !805, file: !3, line: 191, column: 9)
!809 = !DILocation(line: 177, column: 39, scope: !792)
!810 = !DILocation(line: 177, column: 63, scope: !792)
!811 = !DILocation(line: 178, column: 20, scope: !792)
!812 = !DILocation(line: 178, column: 14, scope: !792)
!813 = !DILocation(line: 179, column: 16, scope: !799)
!814 = !DILocation(line: 179, column: 9, scope: !792)
!815 = !DILocation(line: 181, column: 31, scope: !798)
!816 = !DILocation(line: 181, column: 24, scope: !798)
!817 = !DILocation(line: 182, column: 21, scope: !801)
!818 = !DILocation(line: 182, column: 42, scope: !819)
!819 = distinct !DILexicalBlock(scope: !801, file: !3, line: 182, column: 9)
!820 = !{!821, !824, i64 16}
!821 = !{!"_mp_obj_dict_t", !822, i64 0, !823, i64 8}
!822 = !{!"_mp_obj_base_t", !657, i64 0}
!823 = !{!"_mp_map_t", !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 0, !824, i64 8, !657, i64 16}
!824 = !{!"long", !658, i64 0}
!825 = !DILocation(line: 182, column: 30, scope: !819)
!826 = !DILocation(line: 182, column: 9, scope: !801)
!827 = !DILocation(line: 183, column: 17, scope: !828)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 183, column: 17)
!829 = distinct !DILexicalBlock(scope: !819, file: !3, line: 182, column: 54)
!830 = !DILocation(line: 183, column: 17, scope: !829)
!831 = !DILocation(line: 184, column: 51, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !3, line: 183, column: 55)
!833 = !{!821, !657, i64 24}
!834 = !DILocation(line: 184, column: 60, scope: !832)
!835 = !{!836, !657, i64 0}
!836 = !{!"_mp_map_elem_t", !657, i64 0, !657, i64 8}
!837 = !DILocation(line: 184, column: 17, scope: !832)
!838 = !DILocation(line: 185, column: 13, scope: !832)
!839 = !DILocation(line: 182, column: 50, scope: !819)
!840 = distinct !{!840, !826, !841}
!841 = !DILocation(line: 186, column: 9, scope: !801)
!842 = !DILocation(line: 190, column: 24, scope: !803)
!843 = !{!844, !657, i64 32}
!844 = !{!"_mp_state_ctx_t", !845, i64 0, !846, i64 32, !849, i64 336}
!845 = !{!"_mp_state_thread_t", !657, i64 0, !657, i64 8, !657, i64 16, !657, i64 24}
!846 = !{!"_mp_state_vm_t", !657, i64 0, !847, i64 8, !847, i64 40, !821, i64 72, !657, i64 104, !821, i64 112, !848, i64 144, !848, i64 176, !658, i64 208, !657, i64 272, !824, i64 280, !824, i64 288, !824, i64 296}
!847 = !{!"_mp_obj_exception_t", !822, i64 0, !824, i64 8, !824, i64 12, !657, i64 16, !657, i64 24}
!848 = !{!"_mp_obj_list_t", !822, i64 0, !824, i64 8, !824, i64 16, !657, i64 24}
!849 = !{!"_mp_state_mem_t", !657, i64 0, !824, i64 8, !657, i64 16, !657, i64 24, !657, i64 32, !850, i64 40, !658, i64 48, !851, i64 560, !852, i64 562, !824, i64 568, !824, i64 576, !657, i64 584}
!850 = !{!"int", !658, i64 0}
!851 = !{!"short", !658, i64 0}
!852 = !{!"_Bool", !658, i64 0}
!853 = !{!824, !824, i64 0}
!854 = !DILocation(line: 190, column: 16, scope: !803)
!855 = !DILocation(line: 191, column: 21, scope: !805)
!856 = !DILocation(line: 191, column: 41, scope: !808)
!857 = !DILocation(line: 191, column: 9, scope: !805)
!858 = !DILocation(line: 192, column: 13, scope: !807)
!859 = !DILocation(line: 192, column: 22, scope: !807)
!860 = !DILocation(line: 193, column: 38, scope: !807)
!861 = !DILocation(line: 193, column: 13, scope: !807)
!862 = !DILocation(line: 194, column: 17, scope: !863)
!863 = distinct !DILexicalBlock(scope: !807, file: !3, line: 194, column: 17)
!864 = !DILocation(line: 194, column: 25, scope: !863)
!865 = !DILocation(line: 194, column: 17, scope: !807)
!866 = !DILocation(line: 202, column: 41, scope: !867)
!867 = distinct !DILexicalBlock(scope: !863, file: !3, line: 194, column: 41)
!868 = !DILocation(line: 202, column: 17, scope: !867)
!869 = !DILocation(line: 203, column: 13, scope: !867)
!870 = !DILocation(line: 204, column: 9, scope: !808)
!871 = !DILocation(line: 191, column: 50, scope: !808)
!872 = distinct !{!872, !857, !873}
!873 = !DILocation(line: 204, column: 9, scope: !805)
!874 = !DILocation(line: 206, column: 5, scope: !792)
!875 = distinct !DISubprogram(name: "mp_builtin_divmod", scope: !3, file: !3, line: 210, type: !520, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !876)
!876 = !{!877, !878}
!877 = !DILocalVariable(name: "o1_in", arg: 1, scope: !875, file: !3, line: 210, type: !307)
!878 = !DILocalVariable(name: "o2_in", arg: 2, scope: !875, file: !3, line: 210, type: !307)
!879 = !DILocation(line: 210, column: 44, scope: !875)
!880 = !DILocation(line: 210, column: 60, scope: !875)
!881 = !DILocation(line: 211, column: 12, scope: !875)
!882 = !DILocation(line: 211, column: 5, scope: !875)
!883 = distinct !DISubprogram(name: "mp_builtin_hash", scope: !3, file: !3, line: 215, type: !474, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !884)
!884 = !{!885}
!885 = !DILocalVariable(name: "o_in", arg: 1, scope: !883, file: !3, line: 215, type: !307)
!886 = !DILocation(line: 215, column: 42, scope: !883)
!887 = !DILocation(line: 217, column: 12, scope: !883)
!888 = !DILocation(line: 217, column: 5, scope: !883)
!889 = distinct !DISubprogram(name: "mp_builtin_hex", scope: !3, file: !3, line: 221, type: !474, isLocal: true, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !890)
!890 = !{!891}
!891 = !DILocalVariable(name: "o_in", arg: 1, scope: !889, file: !3, line: 221, type: !307)
!892 = !DILocation(line: 221, column: 41, scope: !889)
!893 = !DILocation(line: 222, column: 12, scope: !889)
!894 = !DILocation(line: 222, column: 5, scope: !889)
!895 = distinct !DISubprogram(name: "mp_builtin_iter", scope: !3, file: !3, line: 255, type: !474, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !896)
!896 = !{!897}
!897 = !DILocalVariable(name: "o_in", arg: 1, scope: !895, file: !3, line: 255, type: !307)
!898 = !DILocation(line: 255, column: 42, scope: !895)
!899 = !DILocation(line: 256, column: 12, scope: !895)
!900 = !DILocation(line: 256, column: 5, scope: !895)
!901 = distinct !DISubprogram(name: "mp_builtin_next", scope: !3, file: !3, line: 316, type: !474, isLocal: true, isDefinition: true, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !902)
!902 = !{!903, !904}
!903 = !DILocalVariable(name: "o", arg: 1, scope: !901, file: !3, line: 316, type: !307)
!904 = !DILocalVariable(name: "ret", scope: !901, file: !3, line: 317, type: !307)
!905 = !DILocation(line: 316, column: 42, scope: !901)
!906 = !DILocation(line: 317, column: 20, scope: !901)
!907 = !DILocation(line: 317, column: 14, scope: !901)
!908 = !DILocation(line: 318, column: 13, scope: !909)
!909 = distinct !DILexicalBlock(scope: !901, file: !3, line: 318, column: 9)
!910 = !DILocation(line: 318, column: 9, scope: !901)
!911 = !DILocation(line: 319, column: 9, scope: !912)
!912 = distinct !DILexicalBlock(scope: !909, file: !3, line: 318, column: 39)
!913 = !DILocation(line: 321, column: 9, scope: !914)
!914 = distinct !DILexicalBlock(scope: !909, file: !3, line: 320, column: 12)
!915 = distinct !DISubprogram(name: "mp_builtin_oct", scope: !3, file: !3, line: 326, type: !474, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !916)
!916 = !{!917}
!917 = !DILocalVariable(name: "o_in", arg: 1, scope: !915, file: !3, line: 326, type: !307)
!918 = !DILocation(line: 326, column: 41, scope: !915)
!919 = !DILocation(line: 327, column: 12, scope: !915)
!920 = !DILocation(line: 327, column: 5, scope: !915)
!921 = distinct !DISubprogram(name: "mp_builtin_ord", scope: !3, file: !3, line: 331, type: !474, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !922)
!922 = !{!923, !924, !925}
!923 = !DILocalVariable(name: "o_in", arg: 1, scope: !921, file: !3, line: 331, type: !307)
!924 = !DILocalVariable(name: "len", scope: !921, file: !3, line: 332, type: !309)
!925 = !DILocalVariable(name: "str", scope: !921, file: !3, line: 333, type: !386)
!926 = !DILocation(line: 331, column: 41, scope: !921)
!927 = !DILocation(line: 332, column: 5, scope: !921)
!928 = !DILocation(line: 332, column: 12, scope: !921)
!929 = !DILocation(line: 333, column: 36, scope: !921)
!930 = !DILocation(line: 333, column: 17, scope: !921)
!931 = !DILocation(line: 344, column: 13, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !3, line: 344, column: 13)
!933 = distinct !DILexicalBlock(scope: !921, file: !3, line: 342, column: 5)
!934 = !DILocation(line: 344, column: 17, scope: !932)
!935 = !DILocation(line: 344, column: 13, scope: !933)
!936 = !DILocation(line: 345, column: 20, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !3, line: 344, column: 23)
!938 = !DILocation(line: 355, column: 1, scope: !921)
!939 = !DILocation(line: 345, column: 13, scope: !937)
!940 = !DILocation(line: 350, column: 28, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 349, column: 67)
!942 = distinct !DILexicalBlock(scope: !921, file: !3, line: 349, column: 9)
!943 = !DILocation(line: 350, column: 9, scope: !941)
!944 = distinct !DISubprogram(name: "mp_builtin_pow", scope: !3, file: !3, line: 358, type: !550, isLocal: true, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !945)
!945 = !{!946, !947}
!946 = !DILocalVariable(name: "n_args", arg: 1, scope: !944, file: !3, line: 358, type: !309)
!947 = !DILocalVariable(name: "args", arg: 2, scope: !944, file: !3, line: 358, type: !314)
!948 = !DILocation(line: 358, column: 39, scope: !944)
!949 = !DILocation(line: 358, column: 63, scope: !944)
!950 = !DILocation(line: 359, column: 5, scope: !944)
!951 = !DILocation(line: 360, column: 57, scope: !952)
!952 = distinct !DILexicalBlock(scope: !944, file: !3, line: 359, column: 21)
!953 = !DILocation(line: 360, column: 66, scope: !952)
!954 = !DILocation(line: 360, column: 24, scope: !952)
!955 = !DILocation(line: 360, column: 17, scope: !952)
!956 = !DILocation(line: 363, column: 56, scope: !952)
!957 = !DILocation(line: 363, column: 13, scope: !952)
!958 = !DILocation(line: 373, column: 41, scope: !304)
!959 = !DILocation(line: 373, column: 65, scope: !304)
!960 = !DILocation(line: 373, column: 85, scope: !304)
!961 = !DILocation(line: 385, column: 5, scope: !304)
!962 = !DILocation(line: 389, column: 83, scope: !304)
!963 = !DILocation(line: 389, column: 5, scope: !304)
!964 = !DILocation(line: 397, column: 36, scope: !304)
!965 = !DILocation(line: 397, column: 14, scope: !304)
!966 = !DILocation(line: 398, column: 20, scope: !304)
!967 = !DILocation(line: 398, column: 36, scope: !304)
!968 = !DILocation(line: 398, column: 14, scope: !304)
!969 = !DILocation(line: 399, column: 54, scope: !304)
!970 = !DILocation(line: 399, column: 28, scope: !304)
!971 = !DILocation(line: 399, column: 17, scope: !304)
!972 = !DILocation(line: 400, column: 54, scope: !304)
!973 = !DILocation(line: 400, column: 28, scope: !304)
!974 = !DILocation(line: 400, column: 17, scope: !304)
!975 = !DILocation(line: 402, column: 17, scope: !375)
!976 = !DILocation(line: 402, column: 26, scope: !977)
!977 = distinct !DILexicalBlock(scope: !375, file: !3, line: 402, column: 5)
!978 = !DILocation(line: 402, column: 5, scope: !375)
!979 = !DILocation(line: 422, column: 45, scope: !304)
!980 = !DILocation(line: 422, column: 5, scope: !304)
!981 = !DILocation(line: 425, column: 1, scope: !304)
!982 = !DILocation(line: 424, column: 5, scope: !304)
!983 = !DILocation(line: 403, column: 15, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 403, column: 13)
!985 = distinct !DILexicalBlock(scope: !977, file: !3, line: 402, column: 41)
!986 = !DILocation(line: 403, column: 13, scope: !985)
!987 = !DILocation(line: 407, column: 53, scope: !988)
!988 = distinct !DILexicalBlock(scope: !984, file: !3, line: 403, column: 20)
!989 = !DILocation(line: 407, column: 13, scope: !988)
!990 = !DILocation(line: 409, column: 9, scope: !988)
!991 = !DILocation(line: 413, column: 45, scope: !985)
!992 = !DILocation(line: 413, column: 9, scope: !985)
!993 = !DILocation(line: 402, column: 37, scope: !977)
!994 = distinct !{!994, !978, !995}
!995 = !DILocation(line: 415, column: 5, scope: !375)
!996 = distinct !DISubprogram(name: "mp_builtin___repl_print__", scope: !3, file: !3, line: 428, type: !474, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !997)
!997 = !{!998}
!998 = !DILocalVariable(name: "o", arg: 1, scope: !996, file: !3, line: 428, type: !307)
!999 = !DILocation(line: 428, column: 52, scope: !996)
!1000 = !DILocation(line: 429, column: 11, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !996, file: !3, line: 429, column: 9)
!1002 = !DILocation(line: 429, column: 9, scope: !996)
!1003 = !DILocation(line: 430, column: 9, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 429, column: 29)
!1005 = !DILocation(line: 431, column: 9, scope: !1004)
!1006 = !DILocation(line: 437, column: 5, scope: !1004)
!1007 = !DILocation(line: 438, column: 5, scope: !996)
!1008 = distinct !DISubprogram(name: "mp_builtin_repr", scope: !3, file: !3, line: 442, type: !474, isLocal: true, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1009)
!1009 = !{!1010, !1011, !1019}
!1010 = !DILocalVariable(name: "o_in", arg: 1, scope: !1008, file: !3, line: 442, type: !307)
!1011 = !DILocalVariable(name: "vstr", scope: !1008, file: !3, line: 443, type: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !389, line: 165, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !389, line: 160, size: 256, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1013, file: !389, line: 161, baseType: !309, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1013, file: !389, line: 162, baseType: !309, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1013, file: !389, line: 163, baseType: !385, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !1013, file: !389, line: 164, baseType: !347, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1019 = !DILocalVariable(name: "print", scope: !1008, file: !3, line: 444, type: !414)
!1020 = !DILocation(line: 442, column: 42, scope: !1008)
!1021 = !DILocation(line: 443, column: 5, scope: !1008)
!1022 = !DILocation(line: 444, column: 5, scope: !1008)
!1023 = !DILocation(line: 443, column: 12, scope: !1008)
!1024 = !DILocation(line: 444, column: 16, scope: !1008)
!1025 = !DILocation(line: 445, column: 5, scope: !1008)
!1026 = !DILocation(line: 446, column: 5, scope: !1008)
!1027 = !DILocation(line: 447, column: 12, scope: !1008)
!1028 = !DILocation(line: 448, column: 1, scope: !1008)
!1029 = !DILocation(line: 447, column: 5, scope: !1008)
!1030 = distinct !DISubprogram(name: "mp_builtin_round", scope: !3, file: !3, line: 451, type: !550, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1038}
!1032 = !DILocalVariable(name: "n_args", arg: 1, scope: !1030, file: !3, line: 451, type: !309)
!1033 = !DILocalVariable(name: "args", arg: 2, scope: !1030, file: !3, line: 451, type: !314)
!1034 = !DILocalVariable(name: "o_in", scope: !1030, file: !3, line: 452, type: !307)
!1035 = !DILocalVariable(name: "num_dig", scope: !1036, file: !3, line: 458, type: !349)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 453, column: 30)
!1037 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 453, column: 9)
!1038 = !DILocalVariable(name: "r", scope: !1030, file: !3, line: 497, type: !349)
!1039 = !DILocation(line: 451, column: 41, scope: !1030)
!1040 = !DILocation(line: 451, column: 65, scope: !1030)
!1041 = !DILocation(line: 452, column: 21, scope: !1030)
!1042 = !DILocation(line: 452, column: 14, scope: !1030)
!1043 = !DILocation(line: 453, column: 9, scope: !1037)
!1044 = !{!822, !657, i64 0}
!1045 = !DILocation(line: 453, column: 9, scope: !1030)
!1046 = !DILocation(line: 454, column: 20, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 454, column: 13)
!1048 = !DILocation(line: 454, column: 13, scope: !1036)
!1049 = !DILocation(line: 458, column: 43, scope: !1036)
!1050 = !DILocation(line: 458, column: 28, scope: !1036)
!1051 = !DILocation(line: 458, column: 18, scope: !1036)
!1052 = !DILocation(line: 459, column: 21, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 459, column: 13)
!1054 = !DILocation(line: 459, column: 13, scope: !1036)
!1055 = !DILocation(line: 463, column: 9, scope: !1036)
!1056 = !DILocation(line: 497, column: 18, scope: !1030)
!1057 = !DILocation(line: 497, column: 14, scope: !1030)
!1058 = !DILocation(line: 498, column: 12, scope: !1030)
!1059 = !DILocation(line: 0, scope: !1030)
!1060 = !DILocation(line: 500, column: 1, scope: !1030)
!1061 = distinct !DISubprogram(name: "mp_builtin_sum", scope: !3, file: !3, line: 503, type: !550, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068}
!1063 = !DILocalVariable(name: "n_args", arg: 1, scope: !1061, file: !3, line: 503, type: !309)
!1064 = !DILocalVariable(name: "args", arg: 2, scope: !1061, file: !3, line: 503, type: !314)
!1065 = !DILocalVariable(name: "value", scope: !1061, file: !3, line: 504, type: !307)
!1066 = !DILocalVariable(name: "iter_buf", scope: !1061, file: !3, line: 509, type: !465)
!1067 = !DILocalVariable(name: "iterable", scope: !1061, file: !3, line: 510, type: !307)
!1068 = !DILocalVariable(name: "item", scope: !1061, file: !3, line: 511, type: !307)
!1069 = !DILocation(line: 503, column: 39, scope: !1061)
!1070 = !DILocation(line: 503, column: 63, scope: !1061)
!1071 = !DILocation(line: 505, column: 5, scope: !1061)
