; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@mp_plat_print = local_unnamed_addr constant %struct._mp_print_t { i8* null, void (i8*, i8*, i64)* @plat_print_strn }, align 8, !dbg !0
@pad_spaces = internal constant [17 x i8] c"                \00", align 16, !dbg !223

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mp_plat_print", scope: !2, file: !3, line: 51, type: !92, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !69, globals: !222)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !{!5, !14, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 423, size: 32, elements: !7)
!6 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "PRINT_STR", value: 0)
!9 = !DIEnumerator(name: "PRINT_REPR", value: 1)
!10 = !DIEnumerator(name: "PRINT_EXC", value: 2)
!11 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!12 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!13 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 47, size: 32, elements: !16)
!15 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!18 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!19 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!20 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!22 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!23 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!24 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!25 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!26 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !{!70, !98, !112, !209, !104, !195}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !6, line: 57, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !79)
!79 = !{!80, !81, !85, !86, !114, !138, !143, !149, !155, !163, !168, !182, !187, !212, !215, !216}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !78, file: !6, line: 476, baseType: !71, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !6, line: 479, baseType: !82, size: 16, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !83, line: 31, baseType: !84)
!83 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!84 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !6, line: 482, baseType: !82, size: 16, offset: 80)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !78, file: !6, line: 485, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91, !112, !113}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !94, line: 53, baseType: !95)
!94 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !94, line: 50, size: 128, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !94, line: 51, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !95, file: !94, line: 52, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !94, line: 48, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !98, !104, !107}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 31, baseType: !109)
!108 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !110, line: 92, baseType: !111)
!110 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !98)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !78, file: !6, line: 488, baseType: !115, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!112, !75, !107, !119, !121}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !123, file: !6, line: 366, baseType: !107, size: 1, flags: DIFlagBitField, extraData: i64 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !123, file: !6, line: 367, baseType: !107, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !123, file: !6, line: 368, baseType: !107, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !123, file: !6, line: 369, baseType: !107, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !123, file: !6, line: 371, baseType: !107, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !123, file: !6, line: 372, baseType: !107, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !123, file: !6, line: 373, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !134, file: !6, line: 351, baseType: !112, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !134, file: !6, line: 352, baseType: !112, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !78, file: !6, line: 491, baseType: !139, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!112, !112, !107, !107, !119}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !78, file: !6, line: 495, baseType: !144, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!112, !148, !112}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !78, file: !6, line: 496, baseType: !150, size: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!112, !154, !112, !112}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !78, file: !6, line: 509, baseType: !156, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !112, !160, !162}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !161, line: 48, baseType: !107)
!161 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !78, file: !6, line: 516, baseType: !164, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!112, !112, !112, !112}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !78, file: !6, line: 521, baseType: !169, size: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!112, !112, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !175, file: !6, line: 433, baseType: !71, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !175, file: !6, line: 434, baseType: !179, size: 192, offset: 64)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 192, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !78, file: !6, line: 525, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!112, !112}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !78, file: !6, line: 528, baseType: !188, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !189, file: !6, line: 469, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !112, !201, !209}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !196, line: 70, baseType: !197)
!196 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !198, line: 32, baseType: !199)
!198 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !110, line: 49, baseType: !200)
!200 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !203, file: !6, line: 457, baseType: !98, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !203, file: !6, line: 458, baseType: !107, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !203, file: !6, line: 459, baseType: !208, size: 32, offset: 128)
!208 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !196, line: 71, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !211, line: 30, baseType: !111)
!211 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !78, file: !6, line: 531, baseType: !213, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !6, line: 537, baseType: !213, size: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !78, file: !6, line: 540, baseType: !217, size: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !218, file: !6, line: 776, baseType: !71, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !218, file: !6, line: 777, baseType: !122, size: 192, offset: 64)
!222 = !{!0, !223, !228}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "pad_spaces", scope: !2, file: !3, line: 43, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 136, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 17)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pad_zeroes", scope: !2, file: !3, line: 44, type: !225, isLocal: true, isDefinition: true)
!230 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!231 = !{i32 2, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{i32 7, !"PIC Level", i32 2}
!235 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!236 = distinct !DISubprogram(name: "plat_print_strn", scope: !3, file: !3, line: 46, type: !102, isLocal: true, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !237)
!237 = !{!238, !239, !240}
!238 = !DILocalVariable(name: "env", arg: 1, scope: !236, file: !3, line: 46, type: !98)
!239 = !DILocalVariable(name: "str", arg: 2, scope: !236, file: !3, line: 46, type: !104)
!240 = !DILocalVariable(name: "len", arg: 3, scope: !236, file: !3, line: 46, type: !107)
!241 = !DILocation(line: 46, column: 35, scope: !236)
!242 = !DILocation(line: 46, column: 52, scope: !236)
!243 = !DILocation(line: 46, column: 64, scope: !236)
!244 = !DILocation(line: 48, column: 5, scope: !236)
!245 = !DILocation(line: 49, column: 1, scope: !236)
!246 = distinct !DISubprogram(name: "mp_print_str", scope: !3, file: !3, line: 53, type: !247, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !249)
!247 = !DISubroutineType(types: !248)
!248 = !{!208, !91, !104}
!249 = !{!250, !251, !252}
!250 = !DILocalVariable(name: "print", arg: 1, scope: !246, file: !3, line: 53, type: !91)
!251 = !DILocalVariable(name: "str", arg: 2, scope: !246, file: !3, line: 53, type: !104)
!252 = !DILocalVariable(name: "len", scope: !246, file: !3, line: 54, type: !107)
!253 = !DILocation(line: 53, column: 36, scope: !246)
!254 = !DILocation(line: 53, column: 55, scope: !246)
!255 = !DILocation(line: 54, column: 18, scope: !246)
!256 = !DILocation(line: 54, column: 12, scope: !246)
!257 = !DILocation(line: 55, column: 9, scope: !258)
!258 = distinct !DILexicalBlock(scope: !246, file: !3, line: 55, column: 9)
!259 = !DILocation(line: 55, column: 9, scope: !246)
!260 = !DILocation(line: 56, column: 16, scope: !261)
!261 = distinct !DILexicalBlock(scope: !258, file: !3, line: 55, column: 14)
!262 = !DILocation(line: 56, column: 9, scope: !261)
!263 = !{!264, !265, i64 8}
!264 = !{!"_mp_print_t", !265, i64 0, !265, i64 8}
!265 = !{!"any pointer", !266, i64 0}
!266 = !{!"omnipotent char", !267, i64 0}
!267 = !{!"Simple C/C++ TBAA"}
!268 = !DILocation(line: 56, column: 34, scope: !261)
!269 = !{!264, !265, i64 0}
!270 = !DILocation(line: 57, column: 5, scope: !261)
!271 = !DILocation(line: 58, column: 12, scope: !246)
!272 = !DILocation(line: 58, column: 5, scope: !246)
!273 = distinct !DISubprogram(name: "mp_print_strn", scope: !3, file: !3, line: 61, type: !274, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !276)
!274 = !DISubroutineType(types: !275)
!275 = !{!208, !91, !104, !107, !208, !106, !208}
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !293}
!277 = !DILocalVariable(name: "print", arg: 1, scope: !273, file: !3, line: 61, type: !91)
!278 = !DILocalVariable(name: "str", arg: 2, scope: !273, file: !3, line: 61, type: !104)
!279 = !DILocalVariable(name: "len", arg: 3, scope: !273, file: !3, line: 61, type: !107)
!280 = !DILocalVariable(name: "flags", arg: 4, scope: !273, file: !3, line: 61, type: !208)
!281 = !DILocalVariable(name: "fill", arg: 5, scope: !273, file: !3, line: 61, type: !106)
!282 = !DILocalVariable(name: "width", arg: 6, scope: !273, file: !3, line: 61, type: !208)
!283 = !DILocalVariable(name: "left_pad", scope: !273, file: !3, line: 62, type: !208)
!284 = !DILocalVariable(name: "right_pad", scope: !273, file: !3, line: 63, type: !208)
!285 = !DILocalVariable(name: "pad", scope: !273, file: !3, line: 64, type: !208)
!286 = !DILocalVariable(name: "pad_size", scope: !273, file: !3, line: 65, type: !208)
!287 = !DILocalVariable(name: "total_chars_printed", scope: !273, file: !3, line: 66, type: !208)
!288 = !DILocalVariable(name: "pad_chars", scope: !273, file: !3, line: 67, type: !104)
!289 = !DILocalVariable(name: "p", scope: !290, file: !3, line: 94, type: !208)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 93, column: 30)
!291 = distinct !DILexicalBlock(scope: !292, file: !3, line: 91, column: 23)
!292 = distinct !DILexicalBlock(scope: !273, file: !3, line: 91, column: 9)
!293 = !DILocalVariable(name: "p", scope: !294, file: !3, line: 109, type: !208)
!294 = distinct !DILexicalBlock(scope: !295, file: !3, line: 108, column: 31)
!295 = distinct !DILexicalBlock(scope: !296, file: !3, line: 106, column: 24)
!296 = distinct !DILexicalBlock(scope: !273, file: !3, line: 106, column: 9)
!297 = !DILocation(line: 61, column: 37, scope: !273)
!298 = !DILocation(line: 61, column: 56, scope: !273)
!299 = !DILocation(line: 61, column: 68, scope: !273)
!300 = !DILocation(line: 61, column: 77, scope: !273)
!301 = !DILocation(line: 61, column: 89, scope: !273)
!302 = !{!266, !266, i64 0}
!303 = !DILocation(line: 61, column: 99, scope: !273)
!304 = !DILocation(line: 62, column: 9, scope: !273)
!305 = !DILocation(line: 63, column: 9, scope: !273)
!306 = !DILocation(line: 64, column: 15, scope: !273)
!307 = !DILocation(line: 64, column: 9, scope: !273)
!308 = !DILocation(line: 66, column: 9, scope: !273)
!309 = !DILocation(line: 69, column: 15, scope: !310)
!310 = distinct !DILexicalBlock(scope: !273, file: !3, line: 69, column: 9)
!311 = !DILocation(line: 65, column: 9, scope: !273)
!312 = !DILocation(line: 75, column: 5, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 72, column: 29)
!314 = distinct !DILexicalBlock(scope: !310, file: !3, line: 72, column: 16)
!315 = !DILocation(line: 67, column: 17, scope: !273)
!316 = !DILocation(line: 0, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !3, line: 75, column: 12)
!318 = !DILocation(line: 82, column: 15, scope: !319)
!319 = distinct !DILexicalBlock(scope: !273, file: !3, line: 82, column: 9)
!320 = !DILocation(line: 82, column: 9, scope: !273)
!321 = !DILocation(line: 83, column: 24, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !3, line: 82, column: 40)
!323 = !DILocation(line: 84, column: 25, scope: !322)
!324 = !DILocation(line: 85, column: 5, scope: !322)
!325 = !DILocation(line: 85, column: 22, scope: !326)
!326 = distinct !DILexicalBlock(scope: !319, file: !3, line: 85, column: 16)
!327 = !DILocation(line: 0, scope: !273)
!328 = !DILocation(line: 0, scope: !329)
!329 = distinct !DILexicalBlock(scope: !326, file: !3, line: 87, column: 12)
!330 = !DILocation(line: 91, column: 18, scope: !292)
!331 = !DILocation(line: 91, column: 9, scope: !273)
!332 = !DILocation(line: 93, column: 9, scope: !291)
!333 = !DILocation(line: 94, column: 17, scope: !290)
!334 = !DILocation(line: 95, column: 19, scope: !335)
!335 = distinct !DILexicalBlock(scope: !290, file: !3, line: 95, column: 17)
!336 = !DILocation(line: 95, column: 17, scope: !290)
!337 = !DILocation(line: 98, column: 13, scope: !290)
!338 = !DILocation(line: 98, column: 38, scope: !290)
!339 = !DILocation(line: 98, column: 55, scope: !290)
!340 = !DILocation(line: 99, column: 22, scope: !290)
!341 = !DILocation(line: 93, column: 25, scope: !291)
!342 = distinct !{!342, !332, !343}
!343 = !DILocation(line: 100, column: 9, scope: !291)
!344 = !DILocation(line: 102, column: 9, scope: !345)
!345 = distinct !DILexicalBlock(scope: !273, file: !3, line: 102, column: 9)
!346 = !DILocation(line: 102, column: 9, scope: !273)
!347 = !DILocation(line: 103, column: 16, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !3, line: 102, column: 14)
!349 = !DILocation(line: 103, column: 9, scope: !348)
!350 = !DILocation(line: 103, column: 34, scope: !348)
!351 = !DILocation(line: 104, column: 29, scope: !348)
!352 = !DILocation(line: 105, column: 5, scope: !348)
!353 = !DILocation(line: 0, scope: !291)
!354 = !DILocation(line: 106, column: 19, scope: !296)
!355 = !DILocation(line: 106, column: 9, scope: !273)
!356 = !DILocation(line: 108, column: 9, scope: !295)
!357 = !DILocation(line: 109, column: 17, scope: !294)
!358 = !DILocation(line: 110, column: 19, scope: !359)
!359 = distinct !DILexicalBlock(scope: !294, file: !3, line: 110, column: 17)
!360 = !DILocation(line: 110, column: 17, scope: !294)
!361 = !DILocation(line: 113, column: 13, scope: !294)
!362 = !DILocation(line: 113, column: 38, scope: !294)
!363 = !DILocation(line: 113, column: 55, scope: !294)
!364 = !DILocation(line: 114, column: 23, scope: !294)
!365 = !DILocation(line: 108, column: 26, scope: !295)
!366 = distinct !{!366, !356, !367}
!367 = !DILocation(line: 115, column: 9, scope: !295)
!368 = !DILocation(line: 107, column: 29, scope: !295)
!369 = !DILocation(line: 117, column: 5, scope: !273)
!370 = !DILocation(line: 0, scope: !348)
!371 = distinct !DISubprogram(name: "mp_print_mp_int", scope: !3, file: !3, line: 204, type: !372, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !374)
!372 = !DISubroutineType(types: !373)
!373 = !{!208, !91, !112, !208, !208, !208, !106, !208, !208}
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !387, !389, !390, !391, !395, !396, !397, !398, !399, !400, !401, !402, !405}
!375 = !DILocalVariable(name: "print", arg: 1, scope: !371, file: !3, line: 204, type: !91)
!376 = !DILocalVariable(name: "x", arg: 2, scope: !371, file: !3, line: 204, type: !112)
!377 = !DILocalVariable(name: "base", arg: 3, scope: !371, file: !3, line: 204, type: !208)
!378 = !DILocalVariable(name: "base_char", arg: 4, scope: !371, file: !3, line: 204, type: !208)
!379 = !DILocalVariable(name: "flags", arg: 5, scope: !371, file: !3, line: 204, type: !208)
!380 = !DILocalVariable(name: "fill", arg: 6, scope: !371, file: !3, line: 204, type: !106)
!381 = !DILocalVariable(name: "width", arg: 7, scope: !371, file: !3, line: 204, type: !208)
!382 = !DILocalVariable(name: "prec", arg: 8, scope: !371, file: !3, line: 204, type: !208)
!383 = !DILocalVariable(name: "prefix_buf", scope: !371, file: !3, line: 222, type: !384)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 4)
!387 = !DILocalVariable(name: "prefix", scope: !371, file: !3, line: 223, type: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!389 = !DILocalVariable(name: "prefix_len", scope: !371, file: !3, line: 248, type: !208)
!390 = !DILocalVariable(name: "comma", scope: !371, file: !3, line: 251, type: !106)
!391 = !DILocalVariable(name: "stack_buf", scope: !371, file: !3, line: 258, type: !392)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 256, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 32)
!395 = !DILocalVariable(name: "buf", scope: !371, file: !3, line: 259, type: !388)
!396 = !DILocalVariable(name: "buf_size", scope: !371, file: !3, line: 260, type: !107)
!397 = !DILocalVariable(name: "fmt_size", scope: !371, file: !3, line: 261, type: !107)
!398 = !DILocalVariable(name: "str", scope: !371, file: !3, line: 262, type: !388)
!399 = !DILocalVariable(name: "sign", scope: !371, file: !3, line: 267, type: !106)
!400 = !DILocalVariable(name: "spaces_before", scope: !371, file: !3, line: 282, type: !208)
!401 = !DILocalVariable(name: "spaces_after", scope: !371, file: !3, line: 283, type: !208)
!402 = !DILocalVariable(name: "prec_width", scope: !403, file: !3, line: 290, type: !208)
!403 = distinct !DILexicalBlock(scope: !404, file: !3, line: 285, column: 19)
!404 = distinct !DILexicalBlock(scope: !371, file: !3, line: 285, column: 9)
!405 = !DILocalVariable(name: "len", scope: !371, file: !3, line: 311, type: !208)
!406 = !DILocation(line: 204, column: 39, scope: !371)
!407 = !DILocation(line: 204, column: 55, scope: !371)
!408 = !DILocation(line: 204, column: 62, scope: !371)
!409 = !DILocation(line: 204, column: 72, scope: !371)
!410 = !DILocation(line: 204, column: 87, scope: !371)
!411 = !DILocation(line: 204, column: 99, scope: !371)
!412 = !DILocation(line: 204, column: 109, scope: !371)
!413 = !DILocation(line: 204, column: 120, scope: !371)
!414 = !DILocation(line: 210, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !371, file: !3, line: 210, column: 9)
!416 = !{!417, !265, i64 0}
!417 = !{!"_mp_obj_base_t", !265, i64 0}
!418 = !DILocation(line: 210, column: 9, scope: !371)
!419 = !DILocation(line: 213, column: 13, scope: !420)
!420 = distinct !DILexicalBlock(scope: !415, file: !3, line: 210, column: 28)
!421 = !DILocation(line: 214, column: 5, scope: !420)
!422 = !DILocation(line: 216, column: 16, scope: !423)
!423 = distinct !DILexicalBlock(scope: !371, file: !3, line: 216, column: 9)
!424 = !DILocation(line: 216, column: 65, scope: !423)
!425 = !DILocation(line: 216, column: 78, scope: !423)
!426 = !DILocation(line: 216, column: 70, scope: !423)
!427 = !DILocation(line: 217, column: 18, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !3, line: 217, column: 13)
!429 = distinct !DILexicalBlock(scope: !423, file: !3, line: 216, column: 86)
!430 = !DILocation(line: 222, column: 5, scope: !371)
!431 = !DILocation(line: 222, column: 10, scope: !371)
!432 = !DILocation(line: 223, column: 11, scope: !371)
!433 = !DILocation(line: 225, column: 9, scope: !434)
!434 = distinct !DILexicalBlock(scope: !371, file: !3, line: 225, column: 9)
!435 = !DILocation(line: 225, column: 28, scope: !434)
!436 = !DILocation(line: 225, column: 9, scope: !371)
!437 = !DILocation(line: 226, column: 19, scope: !438)
!438 = distinct !DILexicalBlock(scope: !439, file: !3, line: 226, column: 13)
!439 = distinct !DILexicalBlock(scope: !434, file: !3, line: 225, column: 34)
!440 = !DILocation(line: 226, column: 13, scope: !439)
!441 = !DILocation(line: 227, column: 20, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !3, line: 226, column: 40)
!443 = !DILocation(line: 227, column: 23, scope: !442)
!444 = !DILocation(line: 228, column: 9, scope: !442)
!445 = !DILocation(line: 228, column: 26, scope: !446)
!446 = distinct !DILexicalBlock(scope: !438, file: !3, line: 228, column: 20)
!447 = !DILocation(line: 228, column: 20, scope: !438)
!448 = !DILocation(line: 229, column: 20, scope: !449)
!449 = distinct !DILexicalBlock(scope: !446, file: !3, line: 228, column: 48)
!450 = !DILocation(line: 229, column: 23, scope: !449)
!451 = !DILocation(line: 230, column: 9, scope: !449)
!452 = !DILocation(line: 0, scope: !371)
!453 = !DILocation(line: 233, column: 15, scope: !454)
!454 = distinct !DILexicalBlock(scope: !371, file: !3, line: 233, column: 9)
!455 = !DILocation(line: 233, column: 9, scope: !371)
!456 = !DILocation(line: 234, column: 13, scope: !457)
!457 = distinct !DILexicalBlock(scope: !454, file: !3, line: 233, column: 38)
!458 = !DILocation(line: 235, column: 20, scope: !459)
!459 = distinct !DILexicalBlock(scope: !460, file: !3, line: 234, column: 24)
!460 = distinct !DILexicalBlock(scope: !457, file: !3, line: 234, column: 13)
!461 = !DILocation(line: 235, column: 23, scope: !459)
!462 = !DILocation(line: 236, column: 25, scope: !459)
!463 = !DILocation(line: 236, column: 20, scope: !459)
!464 = !DILocation(line: 236, column: 23, scope: !459)
!465 = !DILocation(line: 237, column: 9, scope: !459)
!466 = !DILocation(line: 238, column: 20, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 237, column: 31)
!468 = distinct !DILexicalBlock(scope: !460, file: !3, line: 237, column: 20)
!469 = !DILocation(line: 238, column: 23, scope: !467)
!470 = !DILocation(line: 239, column: 23, scope: !471)
!471 = distinct !DILexicalBlock(scope: !467, file: !3, line: 239, column: 17)
!472 = !DILocation(line: 239, column: 17, scope: !467)
!473 = !DILocation(line: 240, column: 29, scope: !474)
!474 = distinct !DILexicalBlock(scope: !471, file: !3, line: 239, column: 52)
!475 = !DILocation(line: 240, column: 24, scope: !474)
!476 = !DILocation(line: 240, column: 27, scope: !474)
!477 = !DILocation(line: 241, column: 13, scope: !474)
!478 = !DILocation(line: 243, column: 20, scope: !479)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 242, column: 32)
!480 = distinct !DILexicalBlock(scope: !468, file: !3, line: 242, column: 20)
!481 = !DILocation(line: 243, column: 23, scope: !479)
!482 = !DILocation(line: 244, column: 25, scope: !479)
!483 = !DILocation(line: 244, column: 20, scope: !479)
!484 = !DILocation(line: 244, column: 23, scope: !479)
!485 = !DILocation(line: 245, column: 9, scope: !479)
!486 = !DILocation(line: 0, scope: !442)
!487 = !DILocation(line: 247, column: 13, scope: !371)
!488 = !DILocation(line: 248, column: 29, scope: !371)
!489 = !DILocation(line: 248, column: 22, scope: !371)
!490 = !DILocation(line: 248, column: 9, scope: !371)
!491 = !DILocation(line: 251, column: 10, scope: !371)
!492 = !DILocation(line: 252, column: 15, scope: !493)
!493 = distinct !DILexicalBlock(scope: !371, file: !3, line: 252, column: 9)
!494 = !DILocation(line: 252, column: 9, scope: !371)
!495 = !DILocation(line: 258, column: 5, scope: !371)
!496 = !DILocation(line: 258, column: 10, scope: !371)
!497 = !DILocation(line: 259, column: 5, scope: !371)
!498 = !DILocation(line: 259, column: 11, scope: !371)
!499 = !{!265, !265, i64 0}
!500 = !DILocation(line: 260, column: 5, scope: !371)
!501 = !DILocation(line: 260, column: 12, scope: !371)
!502 = !{!503, !503, i64 0}
!503 = !{!"long", !266, i64 0}
!504 = !DILocation(line: 261, column: 5, scope: !371)
!505 = !DILocation(line: 261, column: 12, scope: !371)
!506 = !DILocation(line: 264, column: 14, scope: !507)
!507 = distinct !DILexicalBlock(scope: !371, file: !3, line: 264, column: 9)
!508 = !DILocation(line: 265, column: 15, scope: !509)
!509 = distinct !DILexicalBlock(scope: !507, file: !3, line: 264, column: 19)
!510 = !DILocation(line: 264, column: 9, scope: !371)
!511 = !DILocation(line: 267, column: 10, scope: !371)
!512 = !DILocation(line: 267, column: 5, scope: !371)
!513 = !DILocation(line: 268, column: 15, scope: !514)
!514 = distinct !DILexicalBlock(scope: !371, file: !3, line: 268, column: 9)
!515 = !DILocation(line: 0, scope: !516)
!516 = distinct !DILexicalBlock(scope: !514, file: !3, line: 277, column: 12)
!517 = !DILocation(line: 268, column: 9, scope: !371)
!518 = !DILocation(line: 271, column: 15, scope: !519)
!519 = distinct !DILexicalBlock(scope: !514, file: !3, line: 268, column: 41)
!520 = !DILocation(line: 262, column: 11, scope: !371)
!521 = !DILocation(line: 273, column: 13, scope: !522)
!522 = distinct !DILexicalBlock(scope: !519, file: !3, line: 273, column: 13)
!523 = !DILocation(line: 273, column: 18, scope: !522)
!524 = !DILocation(line: 273, column: 13, scope: !519)
!525 = !DILocation(line: 274, column: 24, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !3, line: 273, column: 26)
!527 = !DILocation(line: 274, column: 18, scope: !526)
!528 = !DILocation(line: 275, column: 21, scope: !526)
!529 = !DILocation(line: 276, column: 9, scope: !526)
!530 = !DILocation(line: 278, column: 15, scope: !516)
!531 = !DILocation(line: 282, column: 9, scope: !371)
!532 = !DILocation(line: 283, column: 9, scope: !371)
!533 = !DILocation(line: 285, column: 9, scope: !371)
!534 = !DILocation(line: 290, column: 26, scope: !403)
!535 = !DILocation(line: 290, column: 13, scope: !403)
!536 = !DILocation(line: 291, column: 24, scope: !537)
!537 = distinct !DILexicalBlock(scope: !403, file: !3, line: 291, column: 13)
!538 = !DILocation(line: 291, column: 13, scope: !403)
!539 = !DILocation(line: 294, column: 13, scope: !403)
!540 = !DILocation(line: 295, column: 17, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !3, line: 295, column: 17)
!542 = distinct !DILexicalBlock(scope: !543, file: !3, line: 294, column: 45)
!543 = distinct !DILexicalBlock(scope: !403, file: !3, line: 294, column: 13)
!544 = !DILocation(line: 295, column: 17, scope: !542)
!545 = !DILocation(line: 298, column: 24, scope: !542)
!546 = !DILocation(line: 299, column: 9, scope: !542)
!547 = !DILocation(line: 0, scope: !548)
!548 = distinct !DILexicalBlock(scope: !537, file: !3, line: 291, column: 32)
!549 = !DILocation(line: 300, column: 24, scope: !550)
!550 = distinct !DILexicalBlock(scope: !403, file: !3, line: 300, column: 13)
!551 = !DILocation(line: 300, column: 13, scope: !403)
!552 = !DILocation(line: 301, column: 23, scope: !553)
!553 = distinct !DILexicalBlock(scope: !554, file: !3, line: 301, column: 17)
!554 = distinct !DILexicalBlock(scope: !550, file: !3, line: 300, column: 33)
!555 = !DILocation(line: 0, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !3, line: 303, column: 20)
!557 = !DILocation(line: 308, column: 15, scope: !403)
!558 = !DILocation(line: 311, column: 9, scope: !371)
!559 = !DILocation(line: 312, column: 9, scope: !371)
!560 = !DILocation(line: 312, column: 9, scope: !561)
!561 = distinct !DILexicalBlock(scope: !371, file: !3, line: 312, column: 9)
!562 = !DILocation(line: 313, column: 16, scope: !563)
!563 = distinct !DILexicalBlock(scope: !561, file: !3, line: 312, column: 24)
!564 = !DILocation(line: 314, column: 5, scope: !563)
!565 = !DILocation(line: 315, column: 15, scope: !566)
!566 = distinct !DILexicalBlock(scope: !371, file: !3, line: 315, column: 9)
!567 = !DILocation(line: 315, column: 9, scope: !371)
!568 = !DILocation(line: 317, column: 13, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !3, line: 317, column: 13)
!570 = distinct !DILexicalBlock(scope: !566, file: !3, line: 315, column: 41)
!571 = !DILocation(line: 317, column: 13, scope: !570)
!572 = !DILocation(line: 318, column: 20, scope: !573)
!573 = distinct !DILexicalBlock(scope: !569, file: !3, line: 317, column: 19)
!574 = !DILocation(line: 318, column: 17, scope: !573)
!575 = !DILocation(line: 319, column: 18, scope: !573)
!576 = !DILocation(line: 320, column: 9, scope: !573)
!577 = !DILocation(line: 0, scope: !578)
!578 = distinct !DILexicalBlock(scope: !428, file: !3, line: 217, column: 27)
!579 = !DILocation(line: 0, scope: !563)
!580 = !DILocation(line: 321, column: 13, scope: !581)
!581 = distinct !DILexicalBlock(scope: !570, file: !3, line: 321, column: 13)
!582 = !DILocation(line: 321, column: 13, scope: !570)
!583 = !DILocation(line: 322, column: 49, scope: !584)
!584 = distinct !DILexicalBlock(scope: !581, file: !3, line: 321, column: 25)
!585 = !DILocation(line: 322, column: 20, scope: !584)
!586 = !DILocation(line: 322, column: 17, scope: !584)
!587 = !DILocation(line: 323, column: 19, scope: !584)
!588 = !DILocation(line: 324, column: 9, scope: !584)
!589 = !DILocation(line: 326, column: 9, scope: !371)
!590 = !DILocation(line: 330, column: 38, scope: !371)
!591 = !DILocation(line: 330, column: 12, scope: !371)
!592 = !DILocation(line: 330, column: 9, scope: !371)
!593 = !DILocation(line: 332, column: 9, scope: !594)
!594 = distinct !DILexicalBlock(scope: !371, file: !3, line: 332, column: 9)
!595 = !DILocation(line: 332, column: 9, scope: !371)
!596 = !DILocation(line: 333, column: 16, scope: !597)
!597 = distinct !DILexicalBlock(scope: !594, file: !3, line: 332, column: 23)
!598 = !DILocation(line: 333, column: 13, scope: !597)
!599 = !DILocation(line: 334, column: 5, scope: !597)
!600 = !DILocation(line: 336, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !371, file: !3, line: 336, column: 9)
!602 = !DILocation(line: 336, column: 13, scope: !601)
!603 = !DILocation(line: 336, column: 9, scope: !371)
!604 = !DILocation(line: 337, column: 9, scope: !605)
!605 = distinct !DILexicalBlock(scope: !601, file: !3, line: 336, column: 27)
!606 = !DILocation(line: 338, column: 5, scope: !605)
!607 = !DILocation(line: 340, column: 1, scope: !371)
!608 = !DILocation(line: 339, column: 5, scope: !371)
!609 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !610, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !614)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !613}
!612 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !213)
!614 = !{!615}
!615 = !DILocalVariable(name: "o", arg: 1, scope: !609, file: !6, line: 88, type: !613)
!616 = !DILocation(line: 88, column: 55, scope: !609)
!617 = !DILocation(line: 89, column: 17, scope: !609)
!618 = !DILocation(line: 89, column: 32, scope: !609)
!619 = !DILocation(line: 89, column: 37, scope: !609)
!620 = !DILocation(line: 89, column: 7, scope: !609)
!621 = distinct !DISubprogram(name: "MP_OBJ_IS_OBJ", scope: !6, file: !6, line: 109, type: !610, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !622)
!622 = !{!623}
!623 = !DILocalVariable(name: "o", arg: 1, scope: !621, file: !6, line: 109, type: !613)
!624 = !DILocation(line: 109, column: 49, scope: !621)
!625 = !DILocation(line: 110, column: 17, scope: !621)
!626 = !DILocation(line: 110, column: 32, scope: !621)
!627 = !DILocation(line: 110, column: 37, scope: !621)
!628 = !DILocation(line: 110, column: 7, scope: !621)
!629 = distinct !DISubprogram(name: "mp_printf", scope: !3, file: !3, line: 380, type: !630, isLocal: false, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!208, !91, !104, null}
!632 = !{!633, !634, !635, !650}
!633 = !DILocalVariable(name: "print", arg: 1, scope: !629, file: !3, line: 380, type: !91)
!634 = !DILocalVariable(name: "fmt", arg: 2, scope: !629, file: !3, line: 380, type: !104)
!635 = !DILocalVariable(name: "ap", scope: !629, file: !3, line: 381, type: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !637, line: 32, baseType: !638)
!637 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_va_list.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !110, line: 98, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 381, baseType: !640)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 192, elements: !648)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 381, size: 192, elements: !642)
!642 = !{!643, !645, !646, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !641, file: !3, line: 381, baseType: !644, size: 32)
!644 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !641, file: !3, line: 381, baseType: !644, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !641, file: !3, line: 381, baseType: !98, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !641, file: !3, line: 381, baseType: !98, size: 64, offset: 128)
!648 = !{!649}
!649 = !DISubrange(count: 1)
!650 = !DILocalVariable(name: "ret", scope: !629, file: !3, line: 383, type: !208)
!651 = !DILocation(line: 380, column: 33, scope: !629)
!652 = !DILocation(line: 380, column: 52, scope: !629)
!653 = !DILocation(line: 381, column: 5, scope: !629)
!654 = !DILocation(line: 381, column: 13, scope: !629)
!655 = !DILocation(line: 382, column: 5, scope: !629)
!656 = !DILocation(line: 383, column: 15, scope: !629)
!657 = !DILocation(line: 383, column: 9, scope: !629)
!658 = !DILocation(line: 384, column: 5, scope: !629)
!659 = !DILocation(line: 386, column: 1, scope: !629)
!660 = !DILocation(line: 385, column: 5, scope: !629)
!661 = distinct !DISubprogram(name: "mp_vprintf", scope: !3, file: !3, line: 388, type: !662, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !665)
!662 = !DISubroutineType(types: !663)
!663 = !{!208, !91, !104, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!665 = !{!666, !667, !668, !669, !670, !675, !676, !677, !678, !679, !680, !683, !685, !686, !687, !689, !691}
!666 = !DILocalVariable(name: "print", arg: 1, scope: !661, file: !3, line: 388, type: !91)
!667 = !DILocalVariable(name: "fmt", arg: 2, scope: !661, file: !3, line: 388, type: !104)
!668 = !DILocalVariable(name: "args", arg: 3, scope: !661, file: !3, line: 388, type: !664)
!669 = !DILocalVariable(name: "chrs", scope: !661, file: !3, line: 389, type: !208)
!670 = !DILocalVariable(name: "f", scope: !671, file: !3, line: 392, type: !104)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 391, column: 9)
!672 = distinct !DILexicalBlock(scope: !673, file: !3, line: 390, column: 14)
!673 = distinct !DILexicalBlock(scope: !674, file: !3, line: 390, column: 5)
!674 = distinct !DILexicalBlock(scope: !661, file: !3, line: 390, column: 5)
!675 = !DILocalVariable(name: "flags", scope: !672, file: !3, line: 411, type: !208)
!676 = !DILocalVariable(name: "fill", scope: !672, file: !3, line: 412, type: !106)
!677 = !DILocalVariable(name: "width", scope: !672, file: !3, line: 426, type: !208)
!678 = !DILocalVariable(name: "prec", scope: !672, file: !3, line: 432, type: !208)
!679 = !DILocalVariable(name: "long_arg", scope: !672, file: !3, line: 453, type: !612)
!680 = !DILocalVariable(name: "str", scope: !681, file: !3, line: 475, type: !106)
!681 = distinct !DILexicalBlock(scope: !682, file: !3, line: 474, column: 13)
!682 = distinct !DILexicalBlock(scope: !672, file: !3, line: 465, column: 23)
!683 = !DILocalVariable(name: "qst", scope: !684, file: !3, line: 481, type: !160)
!684 = distinct !DILexicalBlock(scope: !682, file: !3, line: 480, column: 13)
!685 = !DILocalVariable(name: "len", scope: !684, file: !3, line: 482, type: !107)
!686 = !DILocalVariable(name: "str", scope: !684, file: !3, line: 483, type: !104)
!687 = !DILocalVariable(name: "str", scope: !688, file: !3, line: 492, type: !104)
!688 = distinct !DILexicalBlock(scope: !682, file: !3, line: 491, column: 13)
!689 = !DILocalVariable(name: "fmt_c", scope: !690, file: !3, line: 514, type: !106)
!690 = distinct !DILexicalBlock(scope: !682, file: !3, line: 513, column: 23)
!691 = !DILocalVariable(name: "val", scope: !690, file: !3, line: 515, type: !209)
!692 = !DILocation(line: 388, column: 34, scope: !661)
!693 = !DILocation(line: 388, column: 53, scope: !661)
!694 = !DILocation(line: 388, column: 66, scope: !661)
!695 = !DILocation(line: 389, column: 9, scope: !661)
!696 = !DILocation(line: 390, column: 5, scope: !661)
!697 = !DILocation(line: 0, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !3, line: 396, column: 26)
!699 = distinct !DILexicalBlock(scope: !671, file: !3, line: 396, column: 17)
!700 = !DILocation(line: 392, column: 25, scope: !671)
