; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@mp_plat_print = local_unnamed_addr constant %struct._mp_print_t { i8* null, void (i8*, i8*, i64)* @plat_print_strn }, align 8, !dbg !0
@pad_spaces = internal constant [17 x i8] c"                \00", align 16, !dbg !224

!9 = !DIEnumerator(name: "PRINT_STR", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PRINT_REPR", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PRINT_EXC", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PRINT_JSON", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PRINT_RAW", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 47, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime0.h", directory: "")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !{!71, !99, !113, !210, !105, !196}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !6, line: 57, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !80)
!80 = !{!81, !82, !86, !87, !115, !139, !144, !150, !156, !164, !169, !183, !188, !213, !216, !217}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !79, file: !6, line: 476, baseType: !72, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !6, line: 479, baseType: !83, size: 16, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 31, baseType: !85)
!84 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !79, file: !6, line: 482, baseType: !83, size: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !79, file: !6, line: 485, baseType: !88, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !92, !113, !114}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !95, line: 53, baseType: !96)
!95 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !95, line: 50, size: 128, elements: !97)
!97 = !{!98, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !95, line: 51, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !96, file: !95, line: 52, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !95, line: 48, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !99, !105, !108}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 31, baseType: !110)
!109 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !111, line: 92, baseType: !112)
!111 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !99)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !79, file: !6, line: 488, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!113, !76, !108, !120, !122}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !124, file: !6, line: 366, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !124, file: !6, line: 367, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !124, file: !6, line: 368, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !124, file: !6, line: 369, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !124, file: !6, line: 371, baseType: !108, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !6, line: 372, baseType: !108, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !124, file: !6, line: 373, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !135, file: !6, line: 351, baseType: !113, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !6, line: 352, baseType: !113, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !79, file: !6, line: 491, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!113, !113, !108, !108, !120}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !79, file: !6, line: 495, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!113, !149, !113}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !79, file: !6, line: 496, baseType: !151, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!113, !155, !113, !113}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !79, file: !6, line: 509, baseType: !157, size: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !113, !161, !163}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !162, line: 48, baseType: !108)
!162 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !79, file: !6, line: 516, baseType: !165, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!113, !113, !113, !113}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !79, file: !6, line: 521, baseType: !170, size: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!113, !113, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !176, file: !6, line: 433, baseType: !72, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !176, file: !6, line: 434, baseType: !180, size: 192, offset: 64)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !79, file: !6, line: 525, baseType: !184, size: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!113, !113}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !79, file: !6, line: 528, baseType: !189, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !191)
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !190, file: !6, line: 469, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !113, !202, !210}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !199, line: 32, baseType: !200)
!199 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !111, line: 49, baseType: !201)
!201 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !204, file: !6, line: 457, baseType: !99, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !6, line: 458, baseType: !108, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !204, file: !6, line: 459, baseType: !209, size: 32, offset: 128)
!209 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !197, line: 70, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !212, line: 30, baseType: !112)
!212 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !79, file: !6, line: 531, baseType: !214, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !6, line: 537, baseType: !214, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !79, file: !6, line: 540, baseType: !218, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !219, file: !6, line: 776, baseType: !72, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !219, file: !6, line: 777, baseType: !123, size: 192, offset: 64)
!223 = !{!0, !224, !230}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "pad_spaces", scope: !2, file: !226, line: 43, type: !227, isLocal: true, isDefinition: true)
!226 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.c", directory: "")
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 136, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 17)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "pad_zeroes", scope: !2, file: !226, line: 44, type: !227, isLocal: true, isDefinition: true)
!232 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!233 = !{i32 2, !"Dwarf Version", i32 4}
!234 = !{i32 2, !"Debug Info Version", i32 3}
!235 = !{i32 1, !"wchar_size", i32 4}
!236 = !{i32 7, !"PIC Level", i32 2}
!237 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!238 = distinct !DISubprogram(name: "plat_print_strn", scope: !226, file: !226, line: 46, type: !103, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !239)
!239 = !{!240, !241, !242}
!240 = !DILocalVariable(name: "env", arg: 1, scope: !238, file: !226, line: 46, type: !99)
!241 = !DILocalVariable(name: "str", arg: 2, scope: !238, file: !226, line: 46, type: !105)
!242 = !DILocalVariable(name: "len", arg: 3, scope: !238, file: !226, line: 46, type: !108)
!243 = !DILocation(line: 46, column: 35, scope: !238)
!244 = !DILocation(line: 46, column: 52, scope: !238)
!245 = !DILocation(line: 46, column: 64, scope: !238)
!246 = !DILocation(line: 48, column: 5, scope: !238)
!247 = !DILocation(line: 49, column: 1, scope: !238)
!248 = distinct !DISubprogram(name: "mp_print_str", scope: !226, file: !226, line: 53, type: !249, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{!209, !92, !105}
!251 = !{!252, !253, !254}
!252 = !DILocalVariable(name: "print", arg: 1, scope: !248, file: !226, line: 53, type: !92)
!253 = !DILocalVariable(name: "str", arg: 2, scope: !248, file: !226, line: 53, type: !105)
!254 = !DILocalVariable(name: "len", scope: !248, file: !226, line: 54, type: !108)
!255 = !DILocation(line: 53, column: 36, scope: !248)
!256 = !DILocation(line: 53, column: 55, scope: !248)
!257 = !DILocation(line: 54, column: 18, scope: !248)
!258 = !DILocation(line: 54, column: 12, scope: !248)
!259 = !DILocation(line: 55, column: 9, scope: !260)
!260 = distinct !DILexicalBlock(scope: !248, file: !226, line: 55, column: 9)
!261 = !DILocation(line: 55, column: 9, scope: !248)
!262 = !DILocation(line: 56, column: 16, scope: !263)
!263 = distinct !DILexicalBlock(scope: !260, file: !226, line: 55, column: 14)
!264 = !DILocation(line: 56, column: 9, scope: !263)
!265 = !{!266, !267, i64 8}
!266 = !{!"_mp_print_t", !267, i64 0, !267, i64 8}
!267 = !{!"any pointer", !268, i64 0}
!268 = !{!"omnipotent char", !269, i64 0}
!269 = !{!"Simple C/C++ TBAA"}
!270 = !DILocation(line: 56, column: 34, scope: !263)
!271 = !{!266, !267, i64 0}
!272 = !DILocation(line: 57, column: 5, scope: !263)
!273 = !DILocation(line: 58, column: 12, scope: !248)
!274 = !DILocation(line: 58, column: 5, scope: !248)
!275 = distinct !DISubprogram(name: "mp_print_strn", scope: !226, file: !226, line: 61, type: !276, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{!209, !92, !105, !108, !209, !107, !209}
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !295}
!279 = !DILocalVariable(name: "print", arg: 1, scope: !275, file: !226, line: 61, type: !92)
!280 = !DILocalVariable(name: "str", arg: 2, scope: !275, file: !226, line: 61, type: !105)
!281 = !DILocalVariable(name: "len", arg: 3, scope: !275, file: !226, line: 61, type: !108)
!282 = !DILocalVariable(name: "flags", arg: 4, scope: !275, file: !226, line: 61, type: !209)
!283 = !DILocalVariable(name: "fill", arg: 5, scope: !275, file: !226, line: 61, type: !107)
!284 = !DILocalVariable(name: "width", arg: 6, scope: !275, file: !226, line: 61, type: !209)
!285 = !DILocalVariable(name: "left_pad", scope: !275, file: !226, line: 62, type: !209)
!286 = !DILocalVariable(name: "right_pad", scope: !275, file: !226, line: 63, type: !209)
!287 = !DILocalVariable(name: "pad", scope: !275, file: !226, line: 64, type: !209)
!288 = !DILocalVariable(name: "pad_size", scope: !275, file: !226, line: 65, type: !209)
!289 = !DILocalVariable(name: "total_chars_printed", scope: !275, file: !226, line: 66, type: !209)
!290 = !DILocalVariable(name: "pad_chars", scope: !275, file: !226, line: 67, type: !105)
!291 = !DILocalVariable(name: "p", scope: !292, file: !226, line: 94, type: !209)
!292 = distinct !DILexicalBlock(scope: !293, file: !226, line: 93, column: 30)
!293 = distinct !DILexicalBlock(scope: !294, file: !226, line: 91, column: 23)
!294 = distinct !DILexicalBlock(scope: !275, file: !226, line: 91, column: 9)
!295 = !DILocalVariable(name: "p", scope: !296, file: !226, line: 109, type: !209)
!296 = distinct !DILexicalBlock(scope: !297, file: !226, line: 108, column: 31)
!297 = distinct !DILexicalBlock(scope: !298, file: !226, line: 106, column: 24)
!298 = distinct !DILexicalBlock(scope: !275, file: !226, line: 106, column: 9)
!299 = !DILocation(line: 61, column: 37, scope: !275)
!300 = !DILocation(line: 61, column: 56, scope: !275)
!301 = !DILocation(line: 61, column: 68, scope: !275)
!302 = !DILocation(line: 61, column: 77, scope: !275)
!303 = !DILocation(line: 61, column: 89, scope: !275)
!304 = !{!268, !268, i64 0}
!305 = !DILocation(line: 61, column: 99, scope: !275)
!306 = !DILocation(line: 62, column: 9, scope: !275)
!307 = !DILocation(line: 63, column: 9, scope: !275)
!308 = !DILocation(line: 64, column: 15, scope: !275)
!309 = !DILocation(line: 64, column: 9, scope: !275)
!310 = !DILocation(line: 66, column: 9, scope: !275)
!311 = !DILocation(line: 69, column: 15, scope: !312)
!312 = distinct !DILexicalBlock(scope: !275, file: !226, line: 69, column: 9)
!313 = !DILocation(line: 65, column: 9, scope: !275)
!314 = !DILocation(line: 75, column: 5, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !226, line: 72, column: 29)
!316 = distinct !DILexicalBlock(scope: !312, file: !226, line: 72, column: 16)
!317 = !DILocation(line: 67, column: 17, scope: !275)
!318 = !DILocation(line: 0, scope: !312)
!319 = !DILocation(line: 82, column: 15, scope: !320)
!320 = distinct !DILexicalBlock(scope: !275, file: !226, line: 82, column: 9)
!321 = !DILocation(line: 82, column: 9, scope: !275)
!322 = !DILocation(line: 83, column: 24, scope: !323)
!323 = distinct !DILexicalBlock(scope: !320, file: !226, line: 82, column: 40)
!324 = !DILocation(line: 84, column: 25, scope: !323)
!325 = !DILocation(line: 85, column: 5, scope: !323)
!326 = !DILocation(line: 85, column: 22, scope: !327)
!327 = distinct !DILexicalBlock(scope: !320, file: !226, line: 85, column: 16)
!328 = !DILocation(line: 0, scope: !275)
!329 = !DILocation(line: 91, column: 18, scope: !294)
!330 = !DILocation(line: 91, column: 9, scope: !275)
!331 = !DILocation(line: 0, scope: !292)
!332 = !DILocation(line: 93, column: 9, scope: !293)
!333 = !DILocation(line: 94, column: 17, scope: !292)
!334 = !DILocation(line: 95, column: 19, scope: !335)
!335 = distinct !DILexicalBlock(scope: !292, file: !226, line: 95, column: 17)
!336 = !DILocation(line: 95, column: 17, scope: !292)
!337 = !DILocation(line: 98, column: 13, scope: !292)
!338 = !DILocation(line: 98, column: 38, scope: !292)
!339 = !DILocation(line: 98, column: 55, scope: !292)
!340 = !DILocation(line: 99, column: 22, scope: !292)
!341 = !DILocation(line: 93, column: 25, scope: !293)
!342 = distinct !{!342, !332, !343}
!343 = !DILocation(line: 100, column: 9, scope: !293)
!344 = !DILocation(line: 102, column: 9, scope: !345)
!345 = distinct !DILexicalBlock(scope: !275, file: !226, line: 102, column: 9)
!346 = !DILocation(line: 102, column: 9, scope: !275)
!347 = !DILocation(line: 103, column: 16, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !226, line: 102, column: 14)
!349 = !DILocation(line: 103, column: 9, scope: !348)
!350 = !DILocation(line: 103, column: 34, scope: !348)
!351 = !DILocation(line: 104, column: 29, scope: !348)
!352 = !DILocation(line: 105, column: 5, scope: !348)
!353 = !DILocation(line: 106, column: 19, scope: !298)
!354 = !DILocation(line: 106, column: 9, scope: !275)
!355 = !DILocation(line: 0, scope: !296)
!356 = !DILocation(line: 108, column: 9, scope: !297)
!357 = !DILocation(line: 109, column: 17, scope: !296)
!358 = !DILocation(line: 110, column: 19, scope: !359)
!359 = distinct !DILexicalBlock(scope: !296, file: !226, line: 110, column: 17)
!360 = !DILocation(line: 110, column: 17, scope: !296)
!361 = !DILocation(line: 113, column: 13, scope: !296)
!362 = !DILocation(line: 113, column: 38, scope: !296)
!363 = !DILocation(line: 113, column: 55, scope: !296)
!364 = !DILocation(line: 114, column: 23, scope: !296)
!365 = !DILocation(line: 108, column: 26, scope: !297)
!366 = distinct !{!366, !356, !367}
!367 = !DILocation(line: 115, column: 9, scope: !297)
!368 = !DILocation(line: 107, column: 29, scope: !297)
!369 = !DILocation(line: 117, column: 5, scope: !275)
!370 = distinct !DISubprogram(name: "mp_print_mp_int", scope: !226, file: !226, line: 204, type: !371, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !373)
!371 = !DISubroutineType(types: !372)
!372 = !{!209, !92, !113, !209, !209, !209, !107, !209, !209}
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !386, !388, !389, !390, !394, !395, !396, !397, !398, !399, !400, !401, !404}
!374 = !DILocalVariable(name: "print", arg: 1, scope: !370, file: !226, line: 204, type: !92)
!375 = !DILocalVariable(name: "x", arg: 2, scope: !370, file: !226, line: 204, type: !113)
!376 = !DILocalVariable(name: "base", arg: 3, scope: !370, file: !226, line: 204, type: !209)
!377 = !DILocalVariable(name: "base_char", arg: 4, scope: !370, file: !226, line: 204, type: !209)
!378 = !DILocalVariable(name: "flags", arg: 5, scope: !370, file: !226, line: 204, type: !209)
!379 = !DILocalVariable(name: "fill", arg: 6, scope: !370, file: !226, line: 204, type: !107)
!380 = !DILocalVariable(name: "width", arg: 7, scope: !370, file: !226, line: 204, type: !209)
!381 = !DILocalVariable(name: "prec", arg: 8, scope: !370, file: !226, line: 204, type: !209)
!382 = !DILocalVariable(name: "prefix_buf", scope: !370, file: !226, line: 222, type: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 32, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 4)
!386 = !DILocalVariable(name: "prefix", scope: !370, file: !226, line: 223, type: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!388 = !DILocalVariable(name: "prefix_len", scope: !370, file: !226, line: 248, type: !209)
!389 = !DILocalVariable(name: "comma", scope: !370, file: !226, line: 251, type: !107)
!390 = !DILocalVariable(name: "stack_buf", scope: !370, file: !226, line: 258, type: !391)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 256, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 32)
!394 = !DILocalVariable(name: "buf", scope: !370, file: !226, line: 259, type: !387)
!395 = !DILocalVariable(name: "buf_size", scope: !370, file: !226, line: 260, type: !108)
!396 = !DILocalVariable(name: "fmt_size", scope: !370, file: !226, line: 261, type: !108)
!397 = !DILocalVariable(name: "str", scope: !370, file: !226, line: 262, type: !387)
!398 = !DILocalVariable(name: "sign", scope: !370, file: !226, line: 267, type: !107)
!399 = !DILocalVariable(name: "spaces_before", scope: !370, file: !226, line: 282, type: !209)
!400 = !DILocalVariable(name: "spaces_after", scope: !370, file: !226, line: 283, type: !209)
!401 = !DILocalVariable(name: "prec_width", scope: !402, file: !226, line: 290, type: !209)
!402 = distinct !DILexicalBlock(scope: !403, file: !226, line: 285, column: 19)
!403 = distinct !DILexicalBlock(scope: !370, file: !226, line: 285, column: 9)
!404 = !DILocalVariable(name: "len", scope: !370, file: !226, line: 311, type: !209)
!405 = !DILocation(line: 204, column: 39, scope: !370)
!406 = !DILocation(line: 204, column: 55, scope: !370)
!407 = !DILocation(line: 204, column: 62, scope: !370)
!408 = !DILocation(line: 204, column: 72, scope: !370)
!409 = !DILocation(line: 204, column: 87, scope: !370)
!410 = !DILocation(line: 204, column: 99, scope: !370)
!411 = !DILocation(line: 204, column: 109, scope: !370)
!412 = !DILocation(line: 204, column: 120, scope: !370)
!413 = !DILocation(line: 210, column: 10, scope: !414)
!414 = distinct !DILexicalBlock(scope: !370, file: !226, line: 210, column: 9)
!415 = !{!416, !267, i64 0}
!416 = !{!"_mp_obj_base_t", !267, i64 0}
!417 = !DILocation(line: 210, column: 9, scope: !370)
!418 = !DILocation(line: 213, column: 13, scope: !419)
!419 = distinct !DILexicalBlock(scope: !414, file: !226, line: 210, column: 28)
!420 = !DILocation(line: 214, column: 5, scope: !419)
!421 = !DILocation(line: 216, column: 16, scope: !422)
!422 = distinct !DILexicalBlock(scope: !370, file: !226, line: 216, column: 9)
!423 = !DILocation(line: 216, column: 65, scope: !422)
!424 = !DILocation(line: 216, column: 78, scope: !422)
!425 = !DILocation(line: 216, column: 70, scope: !422)
!426 = !DILocation(line: 222, column: 5, scope: !370)
!427 = !DILocation(line: 222, column: 10, scope: !370)
!428 = !DILocation(line: 223, column: 11, scope: !370)
!429 = !DILocation(line: 225, column: 9, scope: !430)
!430 = distinct !DILexicalBlock(scope: !370, file: !226, line: 225, column: 9)
!431 = !DILocation(line: 225, column: 28, scope: !430)
!432 = !DILocation(line: 225, column: 9, scope: !370)
!433 = !DILocation(line: 226, column: 19, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !226, line: 226, column: 13)
!435 = distinct !DILexicalBlock(scope: !430, file: !226, line: 225, column: 34)
!436 = !DILocation(line: 226, column: 13, scope: !435)
!437 = !DILocation(line: 227, column: 20, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !226, line: 226, column: 40)
!439 = !DILocation(line: 227, column: 23, scope: !438)
!440 = !DILocation(line: 228, column: 9, scope: !438)
!441 = !DILocation(line: 228, column: 26, scope: !442)
!442 = distinct !DILexicalBlock(scope: !434, file: !226, line: 228, column: 20)
!443 = !DILocation(line: 228, column: 20, scope: !434)
!444 = !DILocation(line: 229, column: 20, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !226, line: 228, column: 48)
!446 = !DILocation(line: 229, column: 23, scope: !445)
!447 = !DILocation(line: 230, column: 9, scope: !445)
!448 = !DILocation(line: 0, scope: !370)
!449 = !DILocation(line: 233, column: 15, scope: !450)
!450 = distinct !DILexicalBlock(scope: !370, file: !226, line: 233, column: 9)
!451 = !DILocation(line: 233, column: 9, scope: !370)
!452 = !DILocation(line: 234, column: 13, scope: !453)
!453 = distinct !DILexicalBlock(scope: !450, file: !226, line: 233, column: 38)
!454 = !DILocation(line: 235, column: 20, scope: !455)
!455 = distinct !DILexicalBlock(scope: !456, file: !226, line: 234, column: 24)
!456 = distinct !DILexicalBlock(scope: !453, file: !226, line: 234, column: 13)
!457 = !DILocation(line: 235, column: 23, scope: !455)
!458 = !DILocation(line: 236, column: 25, scope: !455)
!459 = !DILocation(line: 236, column: 20, scope: !455)
!460 = !DILocation(line: 236, column: 23, scope: !455)
!461 = !DILocation(line: 237, column: 9, scope: !455)
!462 = !DILocation(line: 238, column: 20, scope: !463)
!463 = distinct !DILexicalBlock(scope: !464, file: !226, line: 237, column: 31)
!464 = distinct !DILexicalBlock(scope: !456, file: !226, line: 237, column: 20)
!465 = !DILocation(line: 238, column: 23, scope: !463)
!466 = !DILocation(line: 239, column: 23, scope: !467)
!467 = distinct !DILexicalBlock(scope: !463, file: !226, line: 239, column: 17)
!468 = !DILocation(line: 239, column: 17, scope: !463)
!469 = !DILocation(line: 240, column: 29, scope: !470)
!470 = distinct !DILexicalBlock(scope: !467, file: !226, line: 239, column: 52)
!471 = !DILocation(line: 240, column: 24, scope: !470)
!472 = !DILocation(line: 240, column: 27, scope: !470)
!473 = !DILocation(line: 241, column: 13, scope: !470)
!474 = !DILocation(line: 243, column: 20, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !226, line: 242, column: 32)
!476 = distinct !DILexicalBlock(scope: !464, file: !226, line: 242, column: 20)
!477 = !DILocation(line: 243, column: 23, scope: !475)
!478 = !DILocation(line: 244, column: 25, scope: !475)
!479 = !DILocation(line: 244, column: 20, scope: !475)
!480 = !DILocation(line: 244, column: 23, scope: !475)
!481 = !DILocation(line: 245, column: 9, scope: !475)
!482 = !DILocation(line: 247, column: 13, scope: !370)
!483 = !DILocation(line: 248, column: 29, scope: !370)
!484 = !DILocation(line: 248, column: 22, scope: !370)
!485 = !DILocation(line: 248, column: 9, scope: !370)
!486 = !DILocation(line: 251, column: 10, scope: !370)
!487 = !DILocation(line: 252, column: 15, scope: !488)
!488 = distinct !DILexicalBlock(scope: !370, file: !226, line: 252, column: 9)
!489 = !DILocation(line: 252, column: 9, scope: !370)
!490 = !DILocation(line: 258, column: 5, scope: !370)
!491 = !DILocation(line: 258, column: 10, scope: !370)
!492 = !DILocation(line: 259, column: 5, scope: !370)
!493 = !DILocation(line: 259, column: 11, scope: !370)
!494 = !{!267, !267, i64 0}
!495 = !DILocation(line: 260, column: 5, scope: !370)
!496 = !DILocation(line: 260, column: 12, scope: !370)
!497 = !{!498, !498, i64 0}
!498 = !{!"long", !268, i64 0}
!499 = !DILocation(line: 261, column: 5, scope: !370)
!500 = !DILocation(line: 261, column: 12, scope: !370)
!501 = !DILocation(line: 264, column: 14, scope: !502)
!502 = distinct !DILexicalBlock(scope: !370, file: !226, line: 264, column: 9)
!503 = !DILocation(line: 265, column: 15, scope: !504)
!504 = distinct !DILexicalBlock(scope: !502, file: !226, line: 264, column: 19)
!505 = !DILocation(line: 264, column: 9, scope: !370)
!506 = !DILocation(line: 267, column: 10, scope: !370)
!507 = !DILocation(line: 267, column: 5, scope: !370)
!508 = !DILocation(line: 268, column: 15, scope: !509)
!509 = distinct !DILexicalBlock(scope: !370, file: !226, line: 268, column: 9)
!510 = !DILocation(line: 0, scope: !509)
!511 = !DILocation(line: 268, column: 9, scope: !370)
!512 = !DILocation(line: 271, column: 15, scope: !513)
!513 = distinct !DILexicalBlock(scope: !509, file: !226, line: 268, column: 41)
!514 = !DILocation(line: 262, column: 11, scope: !370)
!515 = !DILocation(line: 273, column: 13, scope: !516)
!516 = distinct !DILexicalBlock(scope: !513, file: !226, line: 273, column: 13)
!517 = !DILocation(line: 273, column: 18, scope: !516)
!518 = !DILocation(line: 273, column: 13, scope: !513)
!519 = !DILocation(line: 274, column: 24, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !226, line: 273, column: 26)
!521 = !DILocation(line: 274, column: 18, scope: !520)
!522 = !DILocation(line: 275, column: 21, scope: !520)
!523 = !DILocation(line: 276, column: 9, scope: !520)
!524 = !DILocation(line: 278, column: 15, scope: !525)
!525 = distinct !DILexicalBlock(scope: !509, file: !226, line: 277, column: 12)
!526 = !DILocation(line: 282, column: 9, scope: !370)
!527 = !DILocation(line: 283, column: 9, scope: !370)
!528 = !DILocation(line: 285, column: 9, scope: !370)
!529 = !DILocation(line: 290, column: 26, scope: !402)
!530 = !DILocation(line: 290, column: 13, scope: !402)
!531 = !DILocation(line: 291, column: 24, scope: !532)
!532 = distinct !DILexicalBlock(scope: !402, file: !226, line: 291, column: 13)
!533 = !DILocation(line: 291, column: 13, scope: !402)
!534 = !DILocation(line: 294, column: 13, scope: !402)
!535 = !DILocation(line: 295, column: 17, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !226, line: 295, column: 17)
!537 = distinct !DILexicalBlock(scope: !538, file: !226, line: 294, column: 45)
!538 = distinct !DILexicalBlock(scope: !402, file: !226, line: 294, column: 13)
!539 = !DILocation(line: 295, column: 17, scope: !537)
!540 = !DILocation(line: 298, column: 24, scope: !537)
!541 = !DILocation(line: 299, column: 9, scope: !537)
!542 = !DILocation(line: 0, scope: !402)
!543 = !DILocation(line: 300, column: 24, scope: !544)
!544 = distinct !DILexicalBlock(scope: !402, file: !226, line: 300, column: 13)
!545 = !DILocation(line: 300, column: 13, scope: !402)
!546 = !DILocation(line: 301, column: 23, scope: !547)
!547 = distinct !DILexicalBlock(scope: !548, file: !226, line: 301, column: 17)
!548 = distinct !DILexicalBlock(scope: !544, file: !226, line: 300, column: 33)
!549 = !DILocation(line: 0, scope: !547)
!550 = !DILocation(line: 308, column: 15, scope: !402)
!551 = !DILocation(line: 311, column: 9, scope: !370)
!552 = !DILocation(line: 312, column: 9, scope: !370)
!553 = !DILocation(line: 312, column: 9, scope: !554)
!554 = distinct !DILexicalBlock(scope: !370, file: !226, line: 312, column: 9)
!555 = !DILocation(line: 313, column: 16, scope: !556)
!556 = distinct !DILexicalBlock(scope: !554, file: !226, line: 312, column: 24)
!557 = !DILocation(line: 314, column: 5, scope: !556)
!558 = !DILocation(line: 315, column: 15, scope: !559)
!559 = distinct !DILexicalBlock(scope: !370, file: !226, line: 315, column: 9)
!560 = !DILocation(line: 315, column: 9, scope: !370)
!561 = !DILocation(line: 317, column: 13, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !226, line: 317, column: 13)
!563 = distinct !DILexicalBlock(scope: !559, file: !226, line: 315, column: 41)
!564 = !DILocation(line: 317, column: 13, scope: !563)
!565 = !DILocation(line: 318, column: 20, scope: !566)
!566 = distinct !DILexicalBlock(scope: !562, file: !226, line: 317, column: 19)
!567 = !DILocation(line: 318, column: 17, scope: !566)
!568 = !DILocation(line: 319, column: 18, scope: !566)
!569 = !DILocation(line: 320, column: 9, scope: !566)
!570 = !DILocation(line: 321, column: 13, scope: !571)
!571 = distinct !DILexicalBlock(scope: !563, file: !226, line: 321, column: 13)
!572 = !DILocation(line: 321, column: 13, scope: !563)
!573 = !DILocation(line: 322, column: 49, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !226, line: 321, column: 25)
!575 = !DILocation(line: 322, column: 20, scope: !574)
!576 = !DILocation(line: 322, column: 17, scope: !574)
!577 = !DILocation(line: 323, column: 19, scope: !574)
!578 = !DILocation(line: 324, column: 9, scope: !574)
!579 = !DILocation(line: 326, column: 9, scope: !370)
!580 = !DILocation(line: 330, column: 38, scope: !370)
!581 = !DILocation(line: 330, column: 12, scope: !370)
!582 = !DILocation(line: 330, column: 9, scope: !370)
!583 = !DILocation(line: 332, column: 9, scope: !584)
!584 = distinct !DILexicalBlock(scope: !370, file: !226, line: 332, column: 9)
!585 = !DILocation(line: 332, column: 9, scope: !370)
!586 = !DILocation(line: 333, column: 16, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !226, line: 332, column: 23)
!588 = !DILocation(line: 333, column: 13, scope: !587)
!589 = !DILocation(line: 334, column: 5, scope: !587)
!590 = !DILocation(line: 336, column: 9, scope: !591)
!591 = distinct !DILexicalBlock(scope: !370, file: !226, line: 336, column: 9)
!592 = !DILocation(line: 336, column: 13, scope: !591)
!593 = !DILocation(line: 336, column: 9, scope: !370)
!594 = !DILocation(line: 337, column: 9, scope: !595)
!595 = distinct !DILexicalBlock(scope: !591, file: !226, line: 336, column: 27)
!596 = !DILocation(line: 338, column: 5, scope: !595)
!597 = !DILocation(line: 340, column: 1, scope: !370)
!598 = !DILocation(line: 339, column: 5, scope: !370)
!599 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !600, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !604)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !603}
!602 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !214)
!604 = !{!605}
!605 = !DILocalVariable(name: "o", arg: 1, scope: !599, file: !6, line: 88, type: !603)
!606 = !DILocation(line: 88, column: 55, scope: !599)
!607 = !DILocation(line: 89, column: 17, scope: !599)
!608 = !DILocation(line: 89, column: 32, scope: !599)
!609 = !DILocation(line: 89, column: 37, scope: !599)
!610 = !DILocation(line: 89, column: 7, scope: !599)
!611 = distinct !DISubprogram(name: "MP_OBJ_IS_OBJ", scope: !6, file: !6, line: 109, type: !600, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!612 = !{!613}
!613 = !DILocalVariable(name: "o", arg: 1, scope: !611, file: !6, line: 109, type: !603)
!614 = !DILocation(line: 109, column: 49, scope: !611)
!615 = !DILocation(line: 110, column: 17, scope: !611)
!616 = !DILocation(line: 110, column: 32, scope: !611)
!617 = !DILocation(line: 110, column: 37, scope: !611)
!618 = !DILocation(line: 110, column: 7, scope: !611)
!619 = distinct !DISubprogram(name: "mp_printf", scope: !226, file: !226, line: 380, type: !620, scopeLine: 380, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !622)
!620 = !DISubroutineType(types: !621)
!621 = !{!209, !92, !105, null}
!622 = !{!623, !624, !625, !639}
!623 = !DILocalVariable(name: "print", arg: 1, scope: !619, file: !226, line: 380, type: !92)
!624 = !DILocalVariable(name: "fmt", arg: 2, scope: !619, file: !226, line: 380, type: !105)
!625 = !DILocalVariable(name: "ap", scope: !619, file: !226, line: 381, type: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !627, line: 32, baseType: !628)
!627 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_va_list.h", directory: "")
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !111, line: 98, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 381, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 192, elements: !637)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 381, size: 192, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !631, file: !3, line: 381, baseType: !7, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !631, file: !3, line: 381, baseType: !7, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !631, file: !3, line: 381, baseType: !99, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !631, file: !3, line: 381, baseType: !99, size: 64, offset: 128)
!637 = !{!638}
!638 = !DISubrange(count: 1)
!639 = !DILocalVariable(name: "ret", scope: !619, file: !226, line: 383, type: !209)
!640 = !DILocation(line: 380, column: 33, scope: !619)
!641 = !DILocation(line: 380, column: 52, scope: !619)
!642 = !DILocation(line: 381, column: 5, scope: !619)
!643 = !DILocation(line: 381, column: 13, scope: !619)
!644 = !DILocation(line: 382, column: 5, scope: !619)
!645 = !DILocation(line: 383, column: 15, scope: !619)
!646 = !DILocation(line: 383, column: 9, scope: !619)
!647 = !DILocation(line: 384, column: 5, scope: !619)
!648 = !DILocation(line: 386, column: 1, scope: !619)
!649 = !DILocation(line: 385, column: 5, scope: !619)
!650 = distinct !DISubprogram(name: "mp_vprintf", scope: !226, file: !226, line: 388, type: !651, scopeLine: 388, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !654)
!651 = !DISubroutineType(types: !652)
!652 = !{!209, !92, !105, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!654 = !{!655, !656, !657, !658, !659, !664, !665, !666, !667, !668, !669, !672, !674, !675, !676, !678, !680}
!655 = !DILocalVariable(name: "print", arg: 1, scope: !650, file: !226, line: 388, type: !92)
!656 = !DILocalVariable(name: "fmt", arg: 2, scope: !650, file: !226, line: 388, type: !105)
!657 = !DILocalVariable(name: "args", arg: 3, scope: !650, file: !226, line: 388, type: !653)
!658 = !DILocalVariable(name: "chrs", scope: !650, file: !226, line: 389, type: !209)
!659 = !DILocalVariable(name: "f", scope: !660, file: !226, line: 392, type: !105)
!660 = distinct !DILexicalBlock(scope: !661, file: !226, line: 391, column: 9)
!661 = distinct !DILexicalBlock(scope: !662, file: !226, line: 390, column: 14)
!662 = distinct !DILexicalBlock(scope: !663, file: !226, line: 390, column: 5)
!663 = distinct !DILexicalBlock(scope: !650, file: !226, line: 390, column: 5)
!664 = !DILocalVariable(name: "flags", scope: !661, file: !226, line: 411, type: !209)
!665 = !DILocalVariable(name: "fill", scope: !661, file: !226, line: 412, type: !107)
!666 = !DILocalVariable(name: "width", scope: !661, file: !226, line: 426, type: !209)
!667 = !DILocalVariable(name: "prec", scope: !661, file: !226, line: 432, type: !209)
!668 = !DILocalVariable(name: "long_arg", scope: !661, file: !226, line: 453, type: !602)
!669 = !DILocalVariable(name: "str", scope: !670, file: !226, line: 475, type: !107)
!670 = distinct !DILexicalBlock(scope: !671, file: !226, line: 474, column: 13)
!671 = distinct !DILexicalBlock(scope: !661, file: !226, line: 465, column: 23)
!672 = !DILocalVariable(name: "qst", scope: !673, file: !226, line: 481, type: !161)
!673 = distinct !DILexicalBlock(scope: !671, file: !226, line: 480, column: 13)
!674 = !DILocalVariable(name: "len", scope: !673, file: !226, line: 483, type: !108)
!675 = !DILocalVariable(name: "str", scope: !673, file: !226, line: 484, type: !105)
!676 = !DILocalVariable(name: "str", scope: !677, file: !226, line: 493, type: !105)
!677 = distinct !DILexicalBlock(scope: !671, file: !226, line: 492, column: 13)
!678 = !DILocalVariable(name: "fmt_c", scope: !679, file: !226, line: 515, type: !107)
!679 = distinct !DILexicalBlock(scope: !671, file: !226, line: 514, column: 23)
!680 = !DILocalVariable(name: "val", scope: !679, file: !226, line: 516, type: !210)
!681 = !DILocation(line: 388, column: 34, scope: !650)
!682 = !DILocation(line: 388, column: 53, scope: !650)
!683 = !DILocation(line: 388, column: 66, scope: !650)
!684 = !DILocation(line: 389, column: 9, scope: !650)
!685 = !DILocation(line: 0, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !226, line: 396, column: 26)
!687 = distinct !DILexicalBlock(scope: !660, file: !226, line: 396, column: 17)
!688 = !DILocation(line: 0, scope: !689)
