; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/mpstate.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/mpstate.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!11 = !DIEnumerator(name: "PRINT_EXC", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PRINT_JSON", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PRINT_RAW", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 47, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime0.h", directory: "")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!18 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !{!0}
!71 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpstate.c", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_state_ctx_t", file: !73, line: 267, baseType: !74)
!73 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpstate.h", directory: "")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_state_ctx_t", file: !73, line: 263, size: 7424, elements: !75)
!75 = !{!76, !251, !318}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !74, file: !73, line: 264, baseType: !77, size: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_state_thread_t", file: !73, line: 259, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_state_thread_t", file: !73, line: 231, size: 256, elements: !79)
!79 = !{!80, !83, !236, !237}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "stack_top", scope: !78, file: !73, line: 233, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "dict_locals", scope: !78, file: !73, line: 255, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !87)
!87 = !{!88, !235}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !86, file: !6, line: 776, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !6, line: 57, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !97)
!97 = !{!98, !99, !103, !104, !131, !155, !160, !166, !172, !180, !185, !199, !204, !229, !232, !233}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !96, file: !6, line: 476, baseType: !89, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !6, line: 479, baseType: !100, size: 16, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !101, line: 31, baseType: !102)
!101 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !6, line: 482, baseType: !100, size: 16, offset: 80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !96, file: !6, line: 485, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !129, !130}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !112, line: 53, baseType: !113)
!112 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !112, line: 50, size: 128, elements: !114)
!114 = !{!115, !117}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !112, line: 51, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !113, file: !112, line: 52, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !112, line: 48, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !116, !122, !124}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 31, baseType: !126)
!125 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !127, line: 92, baseType: !128)
!127 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !116)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !96, file: !6, line: 488, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!129, !93, !124, !136, !138}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !140, file: !6, line: 366, baseType: !124, size: 1, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !140, file: !6, line: 367, baseType: !124, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !140, file: !6, line: 368, baseType: !124, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !140, file: !6, line: 369, baseType: !124, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !140, file: !6, line: 371, baseType: !124, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !140, file: !6, line: 372, baseType: !124, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !140, file: !6, line: 373, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !151, file: !6, line: 351, baseType: !129, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !151, file: !6, line: 352, baseType: !129, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !96, file: !6, line: 491, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!129, !129, !124, !124, !136}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !96, file: !6, line: 495, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!129, !165, !129}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !96, file: !6, line: 496, baseType: !167, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!129, !171, !129, !129}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !96, file: !6, line: 509, baseType: !173, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !129, !177, !179}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !178, line: 48, baseType: !124)
!178 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !96, file: !6, line: 516, baseType: !181, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!129, !129, !129, !129}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !96, file: !6, line: 521, baseType: !186, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!129, !129, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !192, file: !6, line: 433, baseType: !89, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !6, line: 434, baseType: !196, size: 192, offset: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 3)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !96, file: !6, line: 525, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!129, !129}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !96, file: !6, line: 528, baseType: !205, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !206, file: !6, line: 469, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !129, !218, !226}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !213, line: 69, baseType: !214)
!213 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !127, line: 49, baseType: !217)
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !6, line: 457, baseType: !116, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !220, file: !6, line: 458, baseType: !124, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !220, file: !6, line: 459, baseType: !225, size: 32, offset: 128)
!225 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !213, line: 70, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !228, line: 30, baseType: !128)
!228 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !96, file: !6, line: 531, baseType: !230, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !6, line: 537, baseType: !230, size: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !96, file: !6, line: 540, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !86, file: !6, line: 777, baseType: !139, size: 192, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dict_globals", scope: !78, file: !73, line: 256, baseType: !84, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nlr_top", scope: !78, file: !73, line: 258, baseType: !238, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !240, line: 72, baseType: !241)
!240 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/nlr.h", directory: "")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !240, line: 73, size: 1344, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !241, file: !240, line: 75, baseType: !238, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !241, file: !240, line: 76, baseType: !116, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !241, file: !240, line: 79, baseType: !246, size: 1184, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !247, line: 37, baseType: !248)
!247 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/setjmp.h", directory: "")
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 1184, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 37)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vm", scope: !74, file: !73, line: 265, baseType: !252, size: 2432, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_state_vm_t", file: !73, line: 227, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_state_vm_t", file: !73, line: 112, size: 2432, elements: !254)
!254 = !{!255, !274, !294, !295, !296, !298, !299, !308, !309, !313, !315, !316, !317}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_pool", scope: !253, file: !73, line: 120, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr_pool_t", file: !178, line: 56, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_qstr_pool_t", file: !178, line: 50, size: 256, elements: !259)
!259 = !{!260, !262, !263, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !258, file: !178, line: 51, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "total_prev_len", scope: !258, file: !178, line: 52, baseType: !124, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !258, file: !178, line: 53, baseType: !124, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !178, line: 54, baseType: !124, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "qstrs", scope: !258, file: !178, line: 55, baseType: !266, offset: 256)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, elements: !272)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !270, line: 39, baseType: !271)
!270 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!271 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!272 = !{!273}
!273 = !DISubrange(count: -1)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mp_emergency_exception_obj", scope: !253, file: !73, line: 123, baseType: !275, size: 256, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_exception_t", file: !276, line: 38, baseType: !277)
!276 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.h", directory: "")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_exception_t", file: !276, line: 32, size: 256, elements: !278)
!278 = !{!279, !280, !281, !282, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !277, file: !276, line: 33, baseType: !89, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_alloc", scope: !277, file: !276, line: 34, baseType: !124, size: 32, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_len", scope: !277, file: !276, line: 35, baseType: !124, size: 32, offset: 96, flags: DIFlagBitField, extraData: i64 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_data", scope: !277, file: !276, line: 36, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !277, file: !276, line: 37, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !287, line: 35, baseType: !288)
!287 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.h", directory: "")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !287, line: 31, size: 128, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !288, file: !287, line: 32, baseType: !89, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !288, file: !287, line: 33, baseType: !124, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !288, file: !287, line: 34, baseType: !293, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, elements: !272)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mp_reload_exception", scope: !253, file: !73, line: 142, baseType: !275, size: 256, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mp_loaded_modules_dict", scope: !253, file: !73, line: 145, baseType: !85, size: 256, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mp_pending_exception", scope: !253, file: !73, line: 148, baseType: !297, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !129)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dict_main", scope: !253, file: !73, line: 160, baseType: !85, size: 256, offset: 896)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mp_sys_path_obj", scope: !253, file: !73, line: 163, baseType: !300, size: 256, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_list_t", file: !301, line: 36, baseType: !302)
!301 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objlist.h", directory: "")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_list_t", file: !301, line: 31, size: 256, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !302, file: !301, line: 32, baseType: !89, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !302, file: !301, line: 33, baseType: !124, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !302, file: !301, line: 34, baseType: !124, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !302, file: !301, line: 35, baseType: !179, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mp_sys_argv_obj", scope: !253, file: !73, line: 164, baseType: !300, size: 256, offset: 1408)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "readline_hist", scope: !253, file: !73, line: 172, baseType: !310, size: 512, offset: 1664)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 512, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "qstr_last_chunk", scope: !253, file: !73, line: 200, baseType: !314, size: 64, offset: 2176)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "qstr_last_alloc", scope: !253, file: !73, line: 201, baseType: !124, size: 64, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "qstr_last_used", scope: !253, file: !73, line: 202, baseType: !124, size: 64, offset: 2304)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mp_optimise_value", scope: !253, file: !73, line: 210, baseType: !226, size: 64, offset: 2368)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !74, file: !73, line: 266, baseType: !319, size: 4736, offset: 2688)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_state_mem_t", file: !73, line: 108, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_state_mem_t", file: !73, line: 64, size: 4736, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !332, !333, !335, !336, !337}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gc_alloc_table_start", scope: !320, file: !73, line: 71, baseType: !314, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "gc_alloc_table_byte_len", scope: !320, file: !73, line: 72, baseType: !124, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gc_pool_start", scope: !320, file: !73, line: 76, baseType: !314, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gc_pool_end", scope: !320, file: !73, line: 77, baseType: !314, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gc_lowest_long_lived_ptr", scope: !320, file: !73, line: 79, baseType: !116, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gc_stack_overflow", scope: !320, file: !73, line: 81, baseType: !225, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gc_stack", scope: !320, file: !73, line: 82, baseType: !329, size: 4096, offset: 384)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 4096, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "gc_lock_depth", scope: !320, file: !73, line: 83, baseType: !100, size: 16, offset: 4480)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gc_auto_collect_enabled", scope: !320, file: !73, line: 88, baseType: !334, size: 8, offset: 4496)
!334 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gc_first_free_atb_index", scope: !320, file: !73, line: 95, baseType: !124, size: 64, offset: 4544)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "gc_last_free_atb_index", scope: !320, file: !73, line: 96, baseType: !124, size: 64, offset: 4608)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "permanent_pointers", scope: !320, file: !73, line: 107, baseType: !338, size: 64, offset: 4672)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!339 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!340 = !{i32 2, !"Dwarf Version", i32 4}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{i32 7, !"PIC Level", i32 2}
!344 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
