; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/obj.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/obj.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_none_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }

@mp_type_int = external constant %struct._mp_obj_type_t, align 8
@mp_type_str = external constant %struct._mp_obj_type_t, align 8
@.str = private unnamed_addr constant [5 x i8] c"<%q>\00", align 1

!238 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165, isUnsigned: true)
!239 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166, isUnsigned: true)
!240 = !DIEnumerator(name: "MP_QSTR_items", value: 167, isUnsigned: true)
!241 = !DIEnumerator(name: "MP_QSTR_iter", value: 168, isUnsigned: true)
!242 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169, isUnsigned: true)
!243 = !DIEnumerator(name: "MP_QSTR_join", value: 170, isUnsigned: true)
!244 = !DIEnumerator(name: "MP_QSTR_key", value: 171, isUnsigned: true)
!245 = !DIEnumerator(name: "MP_QSTR_keys", value: 172, isUnsigned: true)
!246 = !DIEnumerator(name: "MP_QSTR_len", value: 173, isUnsigned: true)
!247 = !DIEnumerator(name: "MP_QSTR_list", value: 174, isUnsigned: true)
!248 = !DIEnumerator(name: "MP_QSTR_little", value: 175, isUnsigned: true)
!249 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!250 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!251 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!252 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!253 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!254 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!255 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!256 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!257 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !{!305, !333, !456, !347, !429, !443, !457, !342, !458, !472}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !308)
!308 = !{!309, !316, !320, !321, !349, !373, !378, !384, !390, !397, !402, !416, !421, !446, !449, !450}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !6, line: 476, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !6, line: 57, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !6, line: 479, baseType: !317, size: 16, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !318, line: 31, baseType: !319)
!318 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!319 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !6, line: 482, baseType: !317, size: 16, offset: 80)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !307, file: !6, line: 485, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !326, !347, !348}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !329, line: 53, baseType: !330)
!329 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !329, line: 50, size: 128, elements: !331)
!331 = !{!332, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 51, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !330, file: !329, line: 52, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !329, line: 48, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !333, !339, !342}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !343, line: 31, baseType: !344)
!343 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !345, line: 92, baseType: !346)
!345 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !333)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !307, file: !6, line: 488, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!347, !314, !342, !354, !356}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !358, file: !6, line: 366, baseType: !342, size: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !358, file: !6, line: 367, baseType: !342, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !358, file: !6, line: 368, baseType: !342, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !358, file: !6, line: 369, baseType: !342, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !358, file: !6, line: 371, baseType: !342, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !358, file: !6, line: 372, baseType: !342, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !358, file: !6, line: 373, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !369, file: !6, line: 351, baseType: !347, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !6, line: 352, baseType: !347, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !307, file: !6, line: 491, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!347, !347, !342, !342, !354}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !307, file: !6, line: 495, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!347, !383, !347}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !307, file: !6, line: 496, baseType: !385, size: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!347, !389, !347, !347}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !307, file: !6, line: 509, baseType: !391, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !347, !395, !396}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !342)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !307, file: !6, line: 516, baseType: !398, size: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!347, !347, !347, !347}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !307, file: !6, line: 521, baseType: !403, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!347, !347, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !409, file: !6, line: 433, baseType: !310, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !409, file: !6, line: 434, baseType: !413, size: 192, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 3)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !307, file: !6, line: 525, baseType: !417, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!347, !347}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !307, file: !6, line: 528, baseType: !422, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !423, file: !6, line: 469, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !347, !435, !443}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !430, line: 69, baseType: !431)
!430 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !432, line: 32, baseType: !433)
!432 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !345, line: 49, baseType: !434)
!434 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !437, file: !6, line: 457, baseType: !333, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, file: !6, line: 458, baseType: !342, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !437, file: !6, line: 459, baseType: !442, size: 32, offset: 128)
!442 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !430, line: 70, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !445, line: 30, baseType: !346)
!445 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !307, file: !6, line: 531, baseType: !447, size: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !307, file: !6, line: 537, baseType: !447, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !307, file: !6, line: 540, baseType: !451, size: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !452, file: !6, line: 776, baseType: !310, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !452, file: !6, line: 777, baseType: !357, size: 192, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !460, line: 37, baseType: !461)
!460 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objstr.h", directory: "")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !460, line: 31, size: 256, elements: !462)
!462 = !{!463, !464, !465, !466}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !461, file: !460, line: 32, baseType: !310, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !461, file: !460, line: 33, baseType: !443, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !461, file: !460, line: 35, baseType: !342, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !460, line: 36, baseType: !467, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !470, line: 39, baseType: !471)
!470 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!471 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_generic_it_t", file: !474, line: 539, baseType: !475)
!474 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/obj.c", directory: "")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 534, size: 256, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !475, file: !474, line: 535, baseType: !310, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !475, file: !474, line: 536, baseType: !417, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !475, file: !474, line: 537, baseType: !347, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !475, file: !474, line: 538, baseType: !429, size: 64, offset: 192)
!481 = !{!0}
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !484, file: !6, line: 795, baseType: !310, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !484, file: !6, line: 801, baseType: !488, size: 64, offset: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !6, line: 796, size: 64, elements: !489)
!489 = !{!490, !495, !496, !501}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !488, file: !6, line: 797, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!347}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !488, file: !6, line: 798, baseType: !417, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !488, file: !6, line: 799, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!347, !347, !347}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !488, file: !6, line: 800, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !399)
!503 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!504 = !{i32 2, !"Dwarf Version", i32 4}
!505 = !{i32 2, !"Debug Info Version", i32 3}
!506 = !{i32 1, !"wchar_size", i32 4}
!507 = !{i32 7, !"PIC Level", i32 2}
!508 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!509 = distinct !DISubprogram(name: "mp_obj_get_type", scope: !474, file: !474, line: 44, type: !510, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !513)
!510 = !DISubroutineType(types: !511)
!511 = !{!305, !512}
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !447)
!513 = !{!514, !515}
!514 = !DILocalVariable(name: "o_in", arg: 1, scope: !509, file: !474, line: 44, type: !512)
!515 = !DILocalVariable(name: "o", scope: !516, file: !474, line: 54, type: !519)
!516 = distinct !DILexicalBlock(scope: !517, file: !474, line: 53, column: 12)
!517 = distinct !DILexicalBlock(scope: !518, file: !474, line: 47, column: 16)
!518 = distinct !DILexicalBlock(scope: !509, file: !474, line: 45, column: 9)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!521 = !DILocation(line: 44, column: 47, scope: !509)
!522 = !DILocation(line: 45, column: 9, scope: !518)
!523 = !DILocation(line: 45, column: 9, scope: !509)
!524 = !DILocation(line: 47, column: 16, scope: !517)
!525 = !DILocation(line: 47, column: 16, scope: !518)
!526 = !DILocation(line: 54, column: 30, scope: !516)
!527 = !DILocation(line: 55, column: 35, scope: !516)
!528 = !{!529, !530, i64 0}
!529 = !{!"_mp_obj_base_t", !530, i64 0}
!530 = !{!"any pointer", !531, i64 0}
!531 = !{!"omnipotent char", !532, i64 0}
!532 = !{!"Simple C/C++ TBAA"}
!533 = !DILocation(line: 0, scope: !518)
!534 = !DILocation(line: 57, column: 1, scope: !509)
!535 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !536, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !512}
!538 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!539 = !{!540}
!540 = !DILocalVariable(name: "o", arg: 1, scope: !535, file: !6, line: 88, type: !512)
!541 = !DILocation(line: 88, column: 55, scope: !535)
!542 = !DILocation(line: 89, column: 17, scope: !535)
!543 = !DILocation(line: 89, column: 32, scope: !535)
!544 = !DILocation(line: 89, column: 37, scope: !535)
!545 = !DILocation(line: 89, column: 7, scope: !535)
!546 = distinct !DISubprogram(name: "MP_OBJ_IS_QSTR", scope: !6, file: !6, line: 93, type: !536, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !547)
!547 = !{!548}
!548 = !DILocalVariable(name: "o", arg: 1, scope: !546, file: !6, line: 93, type: !512)
!549 = !DILocation(line: 93, column: 50, scope: !546)
!550 = !DILocation(line: 94, column: 17, scope: !546)
!551 = !DILocation(line: 94, column: 32, scope: !546)
!552 = !DILocation(line: 94, column: 37, scope: !546)
!553 = !DILocation(line: 94, column: 7, scope: !546)
!554 = distinct !DISubprogram(name: "mp_obj_get_type_str", scope: !474, file: !474, line: 59, type: !555, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!339, !512}
!557 = !{!558}
!558 = !DILocalVariable(name: "o_in", arg: 1, scope: !554, file: !474, line: 59, type: !512)
!559 = !DILocation(line: 59, column: 48, scope: !554)
!560 = !DILocation(line: 60, column: 21, scope: !554)
!561 = !DILocation(line: 60, column: 44, scope: !554)
!562 = !{!563, !564, i64 10}
!563 = !{!"_mp_obj_type_t", !529, i64 0, !564, i64 8, !564, i64 10, !530, i64 16, !530, i64 24, !530, i64 32, !530, i64 40, !530, i64 48, !530, i64 56, !530, i64 64, !530, i64 72, !530, i64 80, !565, i64 88, !530, i64 96, !530, i64 104, !530, i64 112}
!564 = !{!"short", !531, i64 0}
!565 = !{!"_mp_buffer_p_t", !530, i64 0}
!566 = !DILocation(line: 60, column: 12, scope: !554)
!567 = !DILocation(line: 60, column: 5, scope: !554)
!568 = distinct !DISubprogram(name: "mp_obj_print_helper", scope: !474, file: !474, line: 63, type: !324, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DILocalVariable(name: "print", arg: 1, scope: !568, file: !474, line: 63, type: !326)
!571 = !DILocalVariable(name: "o_in", arg: 2, scope: !568, file: !474, line: 63, type: !347)
!572 = !DILocalVariable(name: "kind", arg: 3, scope: !568, file: !474, line: 63, type: !348)
!573 = !DILocalVariable(name: "type", scope: !568, file: !474, line: 72, type: !305)
!574 = !DILocation(line: 63, column: 44, scope: !568)
!575 = !DILocation(line: 63, column: 60, scope: !568)
!576 = !DILocation(line: 63, column: 82, scope: !568)
!577 = !DILocation(line: 72, column: 27, scope: !568)
!578 = !DILocation(line: 72, column: 20, scope: !568)
!579 = !DILocation(line: 73, column: 15, scope: !580)
!580 = distinct !DILexicalBlock(scope: !568, file: !474, line: 73, column: 9)
!581 = !{!563, !530, i64 16}
!582 = !DILocation(line: 73, column: 21, scope: !580)
!583 = !DILocation(line: 73, column: 9, scope: !568)
!584 = !DILocation(line: 74, column: 9, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !474, line: 73, column: 30)
!586 = !DILocation(line: 75, column: 5, scope: !585)
!587 = !DILocation(line: 76, column: 40, scope: !588)
!588 = distinct !DILexicalBlock(scope: !580, file: !474, line: 75, column: 12)
!589 = !DILocation(line: 76, column: 34, scope: !588)
!590 = !DILocation(line: 76, column: 9, scope: !588)
!591 = !DILocation(line: 78, column: 1, scope: !568)
!592 = distinct !DISubprogram(name: "mp_obj_print", scope: !474, file: !474, line: 80, type: !593, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !347, !348}
!595 = !{!596, !597}
!596 = !DILocalVariable(name: "o_in", arg: 1, scope: !592, file: !474, line: 80, type: !347)
!597 = !DILocalVariable(name: "kind", arg: 2, scope: !592, file: !474, line: 80, type: !348)
!598 = !DILocation(line: 80, column: 28, scope: !592)
!599 = !DILocation(line: 80, column: 50, scope: !592)
!600 = !DILocation(line: 81, column: 5, scope: !592)
!601 = !DILocation(line: 82, column: 1, scope: !592)
!602 = distinct !DISubprogram(name: "mp_obj_print_exception", scope: !474, file: !474, line: 85, type: !603, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !326, !347}
!605 = !{!606, !607, !608, !611, !613, !630, !631, !635, !636, !637, !641, !642, !643, !647, !649}
!606 = !DILocalVariable(name: "print", arg: 1, scope: !602, file: !474, line: 85, type: !326)
!607 = !DILocalVariable(name: "exc", arg: 2, scope: !602, file: !474, line: 85, type: !347)
!608 = !DILocalVariable(name: "n", scope: !609, file: !474, line: 87, type: !342)
!609 = distinct !DILexicalBlock(scope: !610, file: !474, line: 86, column: 58)
!610 = distinct !DILexicalBlock(scope: !602, file: !474, line: 86, column: 9)
!611 = !DILocalVariable(name: "values", scope: !609, file: !474, line: 87, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!613 = !DILocalVariable(name: "traceback", scope: !614, file: !474, line: 92, type: !616)
!614 = distinct !DILexicalBlock(scope: !615, file: !474, line: 89, column: 20)
!615 = distinct !DILexicalBlock(scope: !609, file: !474, line: 89, column: 13)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressed_string_t", file: !619, line: 35, baseType: !620)
!619 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/supervisor/shared/translate.h", directory: "")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 32, size: 16, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !620, file: !619, line: 33, baseType: !317, size: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !620, file: !619, line: 34, baseType: !624, offset: 16)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, elements: !628)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !627, line: 31, baseType: !471)
!627 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!628 = !{!629}
!629 = !DISubrange(count: -1)
!630 = !DILocalVariable(name: "__vla_expr0", scope: !614, type: !346, flags: DIFlagArtificial)
!631 = !DILocalVariable(name: "decompressed", scope: !614, file: !474, line: 93, type: !632)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: !630)
!635 = !DILocalVariable(name: "frame", scope: !614, file: !474, line: 98, type: !616)
!636 = !DILocalVariable(name: "__vla_expr1", scope: !614, type: !346, flags: DIFlagArtificial)
!637 = !DILocalVariable(name: "decompressed_frame", scope: !614, file: !474, line: 100, type: !638)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: !636)
!641 = !DILocalVariable(name: "block_fmt", scope: !614, file: !474, line: 102, type: !616)
!642 = !DILocalVariable(name: "__vla_expr2", scope: !614, type: !346, flags: DIFlagArtificial)
!643 = !DILocalVariable(name: "decompressed_block", scope: !614, file: !474, line: 103, type: !644)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: !642)
!647 = !DILocalVariable(name: "i", scope: !648, file: !474, line: 108, type: !442)
!648 = distinct !DILexicalBlock(scope: !614, file: !474, line: 108, column: 13)
!649 = !DILocalVariable(name: "block", scope: !650, file: !474, line: 115, type: !395)
!650 = distinct !DILexicalBlock(scope: !651, file: !474, line: 108, column: 49)
!651 = distinct !DILexicalBlock(scope: !648, file: !474, line: 108, column: 13)
!652 = !DILocation(line: 85, column: 47, scope: !602)
!653 = !DILocation(line: 85, column: 63, scope: !602)
!654 = !DILocation(line: 86, column: 9, scope: !610)
!655 = !DILocation(line: 86, column: 43, scope: !610)
!656 = !DILocation(line: 86, column: 46, scope: !610)
!657 = !DILocation(line: 86, column: 9, scope: !602)
!658 = !DILocation(line: 87, column: 9, scope: !609)
!659 = !DILocation(line: 87, column: 16, scope: !609)
!660 = !DILocation(line: 87, column: 20, scope: !609)
!661 = !DILocation(line: 88, column: 9, scope: !609)
!662 = !DILocation(line: 89, column: 13, scope: !615)
!663 = !{!664, !664, i64 0}
!664 = !{!"long", !531, i64 0}
!665 = !DILocation(line: 89, column: 15, scope: !615)
!666 = !DILocation(line: 89, column: 13, scope: !609)
!667 = !DILocation(line: 92, column: 52, scope: !614)
!668 = !DILocation(line: 92, column: 40, scope: !614)
!669 = !DILocation(line: 93, column: 42, scope: !614)
!670 = !{!564, !564, i64 0}
!671 = !DILocation(line: 93, column: 13, scope: !614)
!672 = !DILocation(line: 0, scope: !614)
!673 = !DILocation(line: 93, column: 18, scope: !614)
!674 = !DILocation(line: 94, column: 13, scope: !614)
!675 = !DILocation(line: 98, column: 48, scope: !614)
!676 = !DILocation(line: 98, column: 40, scope: !614)
!677 = !DILocation(line: 100, column: 44, scope: !614)
!678 = !DILocation(line: 100, column: 13, scope: !614)
!679 = !DILocation(line: 100, column: 18, scope: !614)
!680 = !DILocation(line: 101, column: 13, scope: !614)
!681 = !DILocation(line: 102, column: 52, scope: !614)
!682 = !DILocation(line: 102, column: 40, scope: !614)
!683 = !DILocation(line: 103, column: 48, scope: !614)
!684 = !DILocation(line: 103, column: 13, scope: !614)
!685 = !DILocation(line: 103, column: 18, scope: !614)
!686 = !DILocation(line: 104, column: 13, scope: !614)
!687 = !DILocation(line: 107, column: 13, scope: !614)
!688 = !DILocation(line: 108, column: 26, scope: !648)
