; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/obj.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/obj.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_none_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }

@mp_type_int = external constant %struct._mp_obj_type_t, align 8
@mp_type_str = external constant %struct._mp_obj_type_t, align 8
@.str = private unnamed_addr constant [5 x i8] c"<%q>\00", align 1

!217 = !DIEnumerator(name: "MP_QSTR_function", value: 145)
!218 = !DIEnumerator(name: "MP_QSTR_generator", value: 146)
!219 = !DIEnumerator(name: "MP_QSTR_get", value: 147)
!220 = !DIEnumerator(name: "MP_QSTR_getattr", value: 148)
!221 = !DIEnumerator(name: "MP_QSTR_getter", value: 149)
!222 = !DIEnumerator(name: "MP_QSTR_globals", value: 150)
!223 = !DIEnumerator(name: "MP_QSTR_hasattr", value: 151)
!224 = !DIEnumerator(name: "MP_QSTR_hash", value: 152)
!225 = !DIEnumerator(name: "MP_QSTR_heap_lock", value: 153)
!226 = !DIEnumerator(name: "MP_QSTR_heap_unlock", value: 154)
!227 = !DIEnumerator(name: "MP_QSTR_hex", value: 155)
!228 = !DIEnumerator(name: "MP_QSTR_id", value: 156)
!229 = !DIEnumerator(name: "MP_QSTR_index", value: 157)
!230 = !DIEnumerator(name: "MP_QSTR_insert", value: 158)
!231 = !DIEnumerator(name: "MP_QSTR_int", value: 159)
!232 = !DIEnumerator(name: "MP_QSTR_isalpha", value: 160)
!233 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!234 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!235 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!236 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!237 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!238 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!239 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!240 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!241 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!242 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!243 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!244 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!245 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!246 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!247 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!248 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!249 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!250 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!251 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!252 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!253 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!254 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!255 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!256 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!257 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!258 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!259 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!260 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!261 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!262 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!263 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!264 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!265 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!266 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!267 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!268 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!269 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!270 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!271 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!272 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!273 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!274 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!275 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!276 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!277 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!278 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!279 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!280 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!281 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!282 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!283 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!284 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!285 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!286 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!287 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!288 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!289 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!290 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!291 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!292 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!293 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!294 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!295 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!296 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!297 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!298 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!299 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!300 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!301 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!302 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!303 = !{!304, !332, !455, !346, !428, !442, !456, !341, !457, !471}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !307)
!307 = !{!308, !315, !319, !320, !348, !372, !377, !383, !389, !396, !401, !415, !420, !445, !448, !449}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !306, file: !6, line: 476, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !6, line: 57, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !6, line: 479, baseType: !316, size: 16, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !317, line: 31, baseType: !318)
!317 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!318 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !6, line: 482, baseType: !316, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !306, file: !6, line: 485, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !325, !346, !347}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !328, line: 53, baseType: !329)
!328 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !328, line: 50, size: 128, elements: !330)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !329, file: !328, line: 51, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !329, file: !328, line: 52, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !328, line: 48, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !332, !338, !341}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!340 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !342, line: 31, baseType: !343)
!342 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !344, line: 92, baseType: !345)
!344 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!345 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !332)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !306, file: !6, line: 488, baseType: !349, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!346, !313, !341, !353, !355}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !357, file: !6, line: 366, baseType: !341, size: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !357, file: !6, line: 367, baseType: !341, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !357, file: !6, line: 368, baseType: !341, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !357, file: !6, line: 369, baseType: !341, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !357, file: !6, line: 371, baseType: !341, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !357, file: !6, line: 372, baseType: !341, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !357, file: !6, line: 373, baseType: !366, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !368, file: !6, line: 351, baseType: !346, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !6, line: 352, baseType: !346, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !306, file: !6, line: 491, baseType: !373, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!346, !346, !341, !341, !353}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !306, file: !6, line: 495, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!346, !382, !346}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !306, file: !6, line: 496, baseType: !384, size: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!346, !388, !346, !346}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !306, file: !6, line: 509, baseType: !390, size: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !346, !394, !395}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !70, line: 48, baseType: !341)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !306, file: !6, line: 516, baseType: !397, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!346, !346, !346, !346}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !306, file: !6, line: 521, baseType: !402, size: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!346, !346, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !408, file: !6, line: 433, baseType: !309, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !408, file: !6, line: 434, baseType: !412, size: 192, offset: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 192, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 3)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !306, file: !6, line: 525, baseType: !416, size: 64, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!346, !346}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !306, file: !6, line: 528, baseType: !421, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !422, file: !6, line: 469, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!428, !346, !434, !442}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !429, line: 70, baseType: !430)
!429 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !431, line: 32, baseType: !432)
!431 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !344, line: 49, baseType: !433)
!433 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !436, file: !6, line: 457, baseType: !332, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !436, file: !6, line: 458, baseType: !341, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !436, file: !6, line: 459, baseType: !441, size: 32, offset: 128)
!441 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !429, line: 71, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !444, line: 30, baseType: !345)
!444 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !306, file: !6, line: 531, baseType: !446, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !306, file: !6, line: 537, baseType: !446, size: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !306, file: !6, line: 540, baseType: !450, size: 64, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !451, file: !6, line: 776, baseType: !309, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !451, file: !6, line: 777, baseType: !356, size: 192, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !459, line: 37, baseType: !460)
!459 = !DIFile(filename: "../../py/objstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !459, line: 31, size: 256, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !460, file: !459, line: 32, baseType: !309, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !460, file: !459, line: 33, baseType: !442, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !460, file: !459, line: 35, baseType: !341, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !459, line: 36, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !469, line: 39, baseType: !470)
!469 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!470 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_generic_it_t", file: !3, line: 539, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 534, size: 256, elements: !474)
!474 = !{!475, !476, !477, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !3, line: 535, baseType: !309, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !473, file: !3, line: 536, baseType: !416, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !473, file: !3, line: 537, baseType: !346, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !473, file: !3, line: 538, baseType: !428, size: 64, offset: 192)
!479 = !{!0}
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !482, file: !6, line: 795, baseType: !309, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !482, file: !6, line: 801, baseType: !486, size: 64, offset: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !482, file: !6, line: 796, size: 64, elements: !487)
!487 = !{!488, !493, !494, !499}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !486, file: !6, line: 797, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!346}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !486, file: !6, line: 798, baseType: !416, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !486, file: !6, line: 799, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!346, !346, !346}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !486, file: !6, line: 800, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !398)
!501 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!502 = !{i32 2, !"Dwarf Version", i32 4}
!503 = !{i32 2, !"Debug Info Version", i32 3}
!504 = !{i32 1, !"wchar_size", i32 4}
!505 = !{i32 7, !"PIC Level", i32 2}
!506 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!507 = distinct !DISubprogram(name: "mp_obj_get_type", scope: !3, file: !3, line: 44, type: !508, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !511)
!508 = !DISubroutineType(types: !509)
!509 = !{!304, !510}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !446)
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "o_in", arg: 1, scope: !507, file: !3, line: 44, type: !510)
!513 = !DILocalVariable(name: "o", scope: !514, file: !3, line: 54, type: !517)
!514 = distinct !DILexicalBlock(scope: !515, file: !3, line: 53, column: 12)
!515 = distinct !DILexicalBlock(scope: !516, file: !3, line: 47, column: 16)
!516 = distinct !DILexicalBlock(scope: !507, file: !3, line: 45, column: 9)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!519 = !DILocation(line: 44, column: 47, scope: !507)
!520 = !DILocation(line: 45, column: 9, scope: !516)
!521 = !DILocation(line: 45, column: 9, scope: !507)
!522 = !DILocation(line: 47, column: 16, scope: !515)
!523 = !DILocation(line: 47, column: 16, scope: !516)
!524 = !DILocation(line: 54, column: 30, scope: !514)
!525 = !DILocation(line: 55, column: 35, scope: !514)
!526 = !{!527, !528, i64 0}
!527 = !{!"_mp_obj_base_t", !528, i64 0}
!528 = !{!"any pointer", !529, i64 0}
!529 = !{!"omnipotent char", !530, i64 0}
!530 = !{!"Simple C/C++ TBAA"}
!531 = !DILocation(line: 0, scope: !514)
!532 = !DILocation(line: 57, column: 1, scope: !507)
!533 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !534, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !537)
!534 = !DISubroutineType(types: !535)
!535 = !{!536, !510}
!536 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!537 = !{!538}
!538 = !DILocalVariable(name: "o", arg: 1, scope: !533, file: !6, line: 88, type: !510)
!539 = !DILocation(line: 88, column: 55, scope: !533)
!540 = !DILocation(line: 89, column: 17, scope: !533)
!541 = !DILocation(line: 89, column: 32, scope: !533)
!542 = !DILocation(line: 89, column: 37, scope: !533)
!543 = !DILocation(line: 89, column: 7, scope: !533)
!544 = distinct !DISubprogram(name: "MP_OBJ_IS_QSTR", scope: !6, file: !6, line: 93, type: !534, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !545)
!545 = !{!546}
!546 = !DILocalVariable(name: "o", arg: 1, scope: !544, file: !6, line: 93, type: !510)
!547 = !DILocation(line: 93, column: 50, scope: !544)
!548 = !DILocation(line: 94, column: 17, scope: !544)
!549 = !DILocation(line: 94, column: 32, scope: !544)
!550 = !DILocation(line: 94, column: 37, scope: !544)
!551 = !DILocation(line: 94, column: 7, scope: !544)
!552 = distinct !DISubprogram(name: "mp_obj_get_type_str", scope: !3, file: !3, line: 59, type: !553, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{!338, !510}
!555 = !{!556}
!556 = !DILocalVariable(name: "o_in", arg: 1, scope: !552, file: !3, line: 59, type: !510)
!557 = !DILocation(line: 59, column: 48, scope: !552)
!558 = !DILocation(line: 60, column: 21, scope: !552)
!559 = !DILocation(line: 60, column: 44, scope: !552)
!560 = !{!561, !562, i64 10}
!561 = !{!"_mp_obj_type_t", !527, i64 0, !562, i64 8, !562, i64 10, !528, i64 16, !528, i64 24, !528, i64 32, !528, i64 40, !528, i64 48, !528, i64 56, !528, i64 64, !528, i64 72, !528, i64 80, !563, i64 88, !528, i64 96, !528, i64 104, !528, i64 112}
!562 = !{!"short", !529, i64 0}
!563 = !{!"_mp_buffer_p_t", !528, i64 0}
!564 = !DILocation(line: 60, column: 12, scope: !552)
!565 = !DILocation(line: 60, column: 5, scope: !552)
!566 = distinct !DISubprogram(name: "mp_obj_print_helper", scope: !3, file: !3, line: 63, type: !323, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DILocalVariable(name: "print", arg: 1, scope: !566, file: !3, line: 63, type: !325)
!569 = !DILocalVariable(name: "o_in", arg: 2, scope: !566, file: !3, line: 63, type: !346)
!570 = !DILocalVariable(name: "kind", arg: 3, scope: !566, file: !3, line: 63, type: !347)
!571 = !DILocalVariable(name: "type", scope: !566, file: !3, line: 72, type: !304)
!572 = !DILocation(line: 63, column: 44, scope: !566)
!573 = !DILocation(line: 63, column: 60, scope: !566)
!574 = !DILocation(line: 63, column: 82, scope: !566)
!575 = !DILocation(line: 72, column: 27, scope: !566)
!576 = !DILocation(line: 72, column: 20, scope: !566)
!577 = !DILocation(line: 73, column: 15, scope: !578)
!578 = distinct !DILexicalBlock(scope: !566, file: !3, line: 73, column: 9)
!579 = !{!561, !528, i64 16}
!580 = !DILocation(line: 73, column: 21, scope: !578)
!581 = !DILocation(line: 73, column: 9, scope: !566)
!582 = !DILocation(line: 74, column: 9, scope: !583)
!583 = distinct !DILexicalBlock(scope: !578, file: !3, line: 73, column: 30)
!584 = !DILocation(line: 75, column: 5, scope: !583)
!585 = !DILocation(line: 76, column: 40, scope: !586)
!586 = distinct !DILexicalBlock(scope: !578, file: !3, line: 75, column: 12)
!587 = !DILocation(line: 76, column: 34, scope: !586)
!588 = !DILocation(line: 76, column: 9, scope: !586)
!589 = !DILocation(line: 78, column: 1, scope: !566)
!590 = distinct !DISubprogram(name: "mp_obj_print", scope: !3, file: !3, line: 80, type: !591, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !593)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !346, !347}
!593 = !{!594, !595}
!594 = !DILocalVariable(name: "o_in", arg: 1, scope: !590, file: !3, line: 80, type: !346)
!595 = !DILocalVariable(name: "kind", arg: 2, scope: !590, file: !3, line: 80, type: !347)
!596 = !DILocation(line: 80, column: 28, scope: !590)
!597 = !DILocation(line: 80, column: 50, scope: !590)
!598 = !DILocation(line: 81, column: 5, scope: !590)
!599 = !DILocation(line: 82, column: 1, scope: !590)
!600 = distinct !DISubprogram(name: "mp_obj_print_exception", scope: !3, file: !3, line: 85, type: !601, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !325, !346}
!603 = !{!604, !605, !606, !609, !611, !628, !629, !633, !634, !635, !639, !640, !641, !645, !647}
!604 = !DILocalVariable(name: "print", arg: 1, scope: !600, file: !3, line: 85, type: !325)
!605 = !DILocalVariable(name: "exc", arg: 2, scope: !600, file: !3, line: 85, type: !346)
!606 = !DILocalVariable(name: "n", scope: !607, file: !3, line: 87, type: !341)
!607 = distinct !DILexicalBlock(scope: !608, file: !3, line: 86, column: 58)
!608 = distinct !DILexicalBlock(scope: !600, file: !3, line: 86, column: 9)
!609 = !DILocalVariable(name: "values", scope: !607, file: !3, line: 87, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!611 = !DILocalVariable(name: "traceback", scope: !612, file: !3, line: 92, type: !614)
!612 = distinct !DILexicalBlock(scope: !613, file: !3, line: 89, column: 20)
!613 = distinct !DILexicalBlock(scope: !607, file: !3, line: 89, column: 13)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressed_string_t", file: !617, line: 35, baseType: !618)
!617 = !DIFile(filename: "../../supervisor/shared/translate.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 32, size: 16, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !618, file: !617, line: 33, baseType: !316, size: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !618, file: !617, line: 34, baseType: !622, offset: 16)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, elements: !626)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !625, line: 31, baseType: !470)
!625 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!626 = !{!627}
!627 = !DISubrange(count: -1)
!628 = !DILocalVariable(name: "__vla_expr0", scope: !612, type: !345, flags: DIFlagArtificial)
!629 = !DILocalVariable(name: "decompressed", scope: !612, file: !3, line: 93, type: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: !628)
!633 = !DILocalVariable(name: "frame", scope: !612, file: !3, line: 98, type: !614)
!634 = !DILocalVariable(name: "__vla_expr1", scope: !612, type: !345, flags: DIFlagArtificial)
!635 = !DILocalVariable(name: "decompressed_frame", scope: !612, file: !3, line: 100, type: !636)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: !634)
!639 = !DILocalVariable(name: "block_fmt", scope: !612, file: !3, line: 102, type: !614)
!640 = !DILocalVariable(name: "__vla_expr2", scope: !612, type: !345, flags: DIFlagArtificial)
!641 = !DILocalVariable(name: "decompressed_block", scope: !612, file: !3, line: 103, type: !642)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: !640)
!645 = !DILocalVariable(name: "i", scope: !646, file: !3, line: 108, type: !441)
!646 = distinct !DILexicalBlock(scope: !612, file: !3, line: 108, column: 13)
!647 = !DILocalVariable(name: "block", scope: !648, file: !3, line: 115, type: !394)
!648 = distinct !DILexicalBlock(scope: !649, file: !3, line: 108, column: 49)
!649 = distinct !DILexicalBlock(scope: !646, file: !3, line: 108, column: 13)
!650 = !DILocation(line: 85, column: 47, scope: !600)
!651 = !DILocation(line: 85, column: 63, scope: !600)
!652 = !DILocation(line: 86, column: 9, scope: !608)
!653 = !DILocation(line: 86, column: 43, scope: !608)
!654 = !DILocation(line: 86, column: 46, scope: !608)
!655 = !DILocation(line: 86, column: 9, scope: !600)
!656 = !DILocation(line: 87, column: 9, scope: !607)
!657 = !DILocation(line: 87, column: 16, scope: !607)
!658 = !DILocation(line: 87, column: 20, scope: !607)
!659 = !DILocation(line: 88, column: 9, scope: !607)
!660 = !DILocation(line: 89, column: 13, scope: !613)
!661 = !{!662, !662, i64 0}
!662 = !{!"long", !529, i64 0}
!663 = !DILocation(line: 89, column: 15, scope: !613)
!664 = !DILocation(line: 89, column: 13, scope: !607)
!665 = !DILocation(line: 92, column: 52, scope: !612)
!666 = !DILocation(line: 92, column: 40, scope: !612)
!667 = !DILocation(line: 93, column: 42, scope: !612)
!668 = !{!562, !562, i64 0}
!669 = !DILocation(line: 93, column: 13, scope: !612)
!670 = !DILocation(line: 0, scope: !612)
!671 = !DILocation(line: 93, column: 18, scope: !612)
!672 = !DILocation(line: 94, column: 13, scope: !612)
!673 = !DILocation(line: 98, column: 48, scope: !612)
!674 = !DILocation(line: 98, column: 40, scope: !612)
!675 = !DILocation(line: 100, column: 44, scope: !612)
!676 = !DILocation(line: 100, column: 13, scope: !612)
!677 = !DILocation(line: 100, column: 18, scope: !612)
!678 = !DILocation(line: 101, column: 13, scope: !612)
!679 = !DILocation(line: 102, column: 52, scope: !612)
!680 = !DILocation(line: 102, column: 40, scope: !612)
!681 = !DILocation(line: 103, column: 48, scope: !612)
!682 = !DILocation(line: 103, column: 13, scope: !612)
!683 = !DILocation(line: 103, column: 18, scope: !612)
!684 = !DILocation(line: 104, column: 13, scope: !612)
!685 = !DILocation(line: 107, column: 13, scope: !612)
