; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objdict.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objdict.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_bool_t = type opaque
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%struct._mp_rom_obj_static_class_method_t = type { %struct._mp_obj_base_t, i8* }
%struct._mp_obj_fun_builtin_fixed_t = type { %struct._mp_obj_base_t, %union.anon }
%union.anon = type { i8* ()* }

!13 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 47, size: 32, elements: !16)
!15 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!18 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!19 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!20 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!22 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!23 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!24 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!25 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!26 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !6, line: 377, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0)
!72 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1)
!73 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2)
!74 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_dict_view_kind_t", file: !3, line: 384, size: 32, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "MP_DICT_VIEW_ITEMS", value: 0)
!78 = !DIEnumerator(name: "MP_DICT_VIEW_KEYS", value: 1)
!79 = !DIEnumerator(name: "MP_DICT_VIEW_VALUES", value: 2)
!80 = !{!81, !82, !127, !234, !210, !224, !235, !244}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !85)
!85 = !{!86, !233}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !84, file: !6, line: 776, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !6, line: 57, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !95)
!95 = !{!96, !97, !101, !102, !129, !153, !158, !164, !170, !178, !183, !197, !202, !227, !230, !231}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !6, line: 476, baseType: !87, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !6, line: 479, baseType: !98, size: 16, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !99, line: 31, baseType: !100)
!99 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!100 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !6, line: 482, baseType: !98, size: 16, offset: 80)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !94, file: !6, line: 485, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !127, !128}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !110, line: 53, baseType: !111)
!110 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !110, line: 50, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !110, line: 51, baseType: !81, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !111, file: !110, line: 52, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !110, line: 48, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !81, !119, !122}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 31, baseType: !124)
!123 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !125, line: 92, baseType: !126)
!125 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!126 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !81)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !94, file: !6, line: 488, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!127, !91, !122, !134, !136}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !138, file: !6, line: 366, baseType: !122, size: 1, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !138, file: !6, line: 367, baseType: !122, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !138, file: !6, line: 368, baseType: !122, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !138, file: !6, line: 369, baseType: !122, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !138, file: !6, line: 371, baseType: !122, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !138, file: !6, line: 372, baseType: !122, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !138, file: !6, line: 373, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !149, file: !6, line: 351, baseType: !127, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !6, line: 352, baseType: !127, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !94, file: !6, line: 491, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!127, !127, !122, !122, !134}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !94, file: !6, line: 495, baseType: !159, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!127, !163, !127}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !94, file: !6, line: 496, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!127, !169, !127, !127}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !94, file: !6, line: 509, baseType: !171, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !127, !175, !177}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !176, line: 48, baseType: !122)
!176 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !94, file: !6, line: 516, baseType: !179, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!127, !127, !127, !127}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !94, file: !6, line: 521, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!127, !127, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !190, file: !6, line: 433, baseType: !87, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !190, file: !6, line: 434, baseType: !194, size: 192, offset: 64)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 192, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !94, file: !6, line: 525, baseType: !198, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!127, !127}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !94, file: !6, line: 528, baseType: !203, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !204, file: !6, line: 469, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !127, !216, !224}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !211, line: 70, baseType: !212)
!211 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !213, line: 32, baseType: !214)
!213 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !125, line: 49, baseType: !215)
!215 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !218, file: !6, line: 457, baseType: !81, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !6, line: 458, baseType: !122, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !218, file: !6, line: 459, baseType: !223, size: 32, offset: 128)
!223 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !211, line: 71, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !226, line: 30, baseType: !126)
!226 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !94, file: !6, line: 531, baseType: !228, size: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !94, file: !6, line: 537, baseType: !228, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !94, file: !6, line: 540, baseType: !232, size: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !84, file: !6, line: 777, baseType: !137, size: 192, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_view_it_t", file: !3, line: 397, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_view_it_t", file: !3, line: 392, size: 256, elements: !238)
!238 = !{!239, !240, !242, !243}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !237, file: !3, line: 393, baseType: !87, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !237, file: !3, line: 394, baseType: !241, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_dict_view_kind_t", file: !3, line: 388, baseType: !75)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !237, file: !3, line: 395, baseType: !127, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !237, file: !3, line: 396, baseType: !122, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_view_t", file: !3, line: 403, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_view_t", file: !3, line: 399, size: 192, elements: !247)
!247 = !{!248, !249, !250}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !246, file: !3, line: 400, baseType: !87, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !246, file: !3, line: 401, baseType: !127, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !246, file: !3, line: 402, baseType: !241, size: 32, offset: 128)
!251 = !{!0, !252, !254, !257, !270, !293, !295, !303, !327, !329, !331, !333, !337, !339, !341, !343, !345, !347}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "dict_view_it_type", scope: !2, file: !3, line: 427, type: !92, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "dict_locals_dict", scope: !2, file: !3, line: 548, type: !256, isLocal: true, isDefinition: true)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "dict_locals_dict_table", scope: !2, file: !3, line: 531, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1792, elements: !268)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !263)
!263 = !{!264, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !262, file: !6, line: 356, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !228)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !262, file: !6, line: 357, baseType: !265, size: 64, offset: 64)
!268 = !{!269}
!269 = !DISubrange(count: 14)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "dict_clear_obj", scope: !2, file: !3, line: 216, type: !272, isLocal: true, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !274, file: !6, line: 795, baseType: !87, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !274, file: !6, line: 801, baseType: !278, size: 64, offset: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !6, line: 796, size: 64, elements: !279)
!279 = !{!280, !285, !286, !291}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !278, file: !6, line: 797, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!127}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !278, file: !6, line: 798, baseType: !198, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !278, file: !6, line: 799, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!127, !127, !127}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !278, file: !6, line: 800, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !180)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "dict_copy_obj", scope: !2, file: !3, line: 231, type: !272, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "dict_fromkeys_obj", scope: !2, file: !3, line: 261, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_static_class_method_t", file: !6, line: 846, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_obj_static_class_method_t", file: !6, line: 843, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !299, file: !6, line: 844, baseType: !87, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !299, file: !6, line: 845, baseType: !265, size: 64, offset: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "dict_fromkeys_fun_obj", scope: !2, file: !3, line: 260, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !308)
!308 = !{!309, !310, !312, !313, !314}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !6, line: 806, baseType: !87, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !307, file: !6, line: 807, baseType: !311, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!311 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !307, file: !6, line: 808, baseType: !224, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !307, file: !6, line: 809, baseType: !224, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !307, file: !6, line: 813, baseType: !315, size: 64, offset: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !307, file: !6, line: 810, size: 64, elements: !316)
!316 = !{!317, !322}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !315, file: !6, line: 811, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!127, !122, !134}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !315, file: !6, line: 812, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!127, !122, !134, !136}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "dict_get_obj", scope: !2, file: !3, line: 296, type: !305, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "dict_items_obj", scope: !2, file: !3, line: 502, type: !272, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "dict_view_type", scope: !2, file: !3, line: 478, type: !92, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "mp_dict_view_names", scope: !2, file: !3, line: 390, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 192, elements: !195)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "dict_keys_obj", scope: !2, file: !3, line: 507, type: !272, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "dict_pop_obj", scope: !2, file: !3, line: 301, type: !305, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "dict_popitem_obj", scope: !2, file: !3, line: 325, type: !272, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "dict_setdefault_obj", scope: !2, file: !3, line: 306, type: !305, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "dict_update_obj", scope: !2, file: !3, line: 375, type: !305, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "dict_values_obj", scope: !2, file: !3, line: 512, type: !272, isLocal: true, isDefinition: true)
!349 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!350 = !{i32 2, !"Dwarf Version", i32 4}
!351 = !{i32 2, !"Debug Info Version", i32 3}
!352 = !{i32 1, !"wchar_size", i32 4}
!353 = !{i32 7, !"PIC Level", i32 2}
!354 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!355 = distinct !DISubprogram(name: "mp_obj_dict_get", scope: !3, file: !3, line: 167, type: !289, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DILocalVariable(name: "self_in", arg: 1, scope: !355, file: !3, line: 167, type: !127)
!358 = !DILocalVariable(name: "index", arg: 2, scope: !355, file: !3, line: 167, type: !127)
