; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objdict.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objdict.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_bool_t = type opaque
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%struct._mp_rom_obj_static_class_method_t = type { %struct._mp_obj_base_t, i8* }
%struct._mp_obj_fun_builtin_fixed_t = type { %struct._mp_obj_base_t, %union.anon }
%union.anon = type { i8* ()* }

!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !6, line: 377, baseType: !7, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_dict_view_kind_t", file: !77, line: 384, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objdict.c", directory: "")
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "MP_DICT_VIEW_ITEMS", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "MP_DICT_VIEW_KEYS", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "MP_DICT_VIEW_VALUES", value: 2, isUnsigned: true)
!82 = !{!83, !84, !129, !236, !212, !226, !237, !246}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !87)
!87 = !{!88, !235}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !86, file: !6, line: 776, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !6, line: 57, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !97)
!97 = !{!98, !99, !103, !104, !131, !155, !160, !166, !172, !180, !185, !199, !204, !229, !232, !233}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !96, file: !6, line: 476, baseType: !89, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !6, line: 479, baseType: !100, size: 16, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !101, line: 31, baseType: !102)
!101 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !6, line: 482, baseType: !100, size: 16, offset: 80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !96, file: !6, line: 485, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !129, !130}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !112, line: 53, baseType: !113)
!112 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !112, line: 50, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !112, line: 51, baseType: !83, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !113, file: !112, line: 52, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !112, line: 48, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !83, !121, !124}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 31, baseType: !126)
!125 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !127, line: 92, baseType: !128)
!127 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !83)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !96, file: !6, line: 488, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!129, !93, !124, !136, !138}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !140, file: !6, line: 366, baseType: !124, size: 1, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !140, file: !6, line: 367, baseType: !124, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !140, file: !6, line: 368, baseType: !124, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !140, file: !6, line: 369, baseType: !124, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !140, file: !6, line: 371, baseType: !124, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !140, file: !6, line: 372, baseType: !124, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !140, file: !6, line: 373, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !151, file: !6, line: 351, baseType: !129, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !151, file: !6, line: 352, baseType: !129, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !96, file: !6, line: 491, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!129, !129, !124, !124, !136}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !96, file: !6, line: 495, baseType: !161, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!129, !165, !129}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !96, file: !6, line: 496, baseType: !167, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!129, !171, !129, !129}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !96, file: !6, line: 509, baseType: !173, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !129, !177, !179}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !178, line: 48, baseType: !124)
!178 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !96, file: !6, line: 516, baseType: !181, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!129, !129, !129, !129}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !96, file: !6, line: 521, baseType: !186, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!129, !129, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !192, file: !6, line: 433, baseType: !89, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !6, line: 434, baseType: !196, size: 192, offset: 64)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 3)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !96, file: !6, line: 525, baseType: !200, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!129, !129}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !96, file: !6, line: 528, baseType: !205, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !206, file: !6, line: 469, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !129, !218, !226}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !213, line: 69, baseType: !214)
!213 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !127, line: 49, baseType: !217)
!217 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !6, line: 457, baseType: !83, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !220, file: !6, line: 458, baseType: !124, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !220, file: !6, line: 459, baseType: !225, size: 32, offset: 128)
!225 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !213, line: 70, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !228, line: 30, baseType: !128)
!228 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!229 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !96, file: !6, line: 531, baseType: !230, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !6, line: 537, baseType: !230, size: 64, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !96, file: !6, line: 540, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !86, file: !6, line: 777, baseType: !139, size: 192, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_view_it_t", file: !77, line: 397, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_view_it_t", file: !77, line: 392, size: 256, elements: !240)
!240 = !{!241, !242, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !239, file: !77, line: 393, baseType: !89, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !239, file: !77, line: 394, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_dict_view_kind_t", file: !77, line: 388, baseType: !76)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !239, file: !77, line: 395, baseType: !129, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !239, file: !77, line: 396, baseType: !124, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_view_t", file: !77, line: 403, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_view_t", file: !77, line: 399, size: 192, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !248, file: !77, line: 400, baseType: !89, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !248, file: !77, line: 401, baseType: !129, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !248, file: !77, line: 402, baseType: !243, size: 32, offset: 128)
!253 = !{!0, !254, !256, !259, !272, !295, !297, !305, !329, !331, !333, !335, !339, !341, !343, !345, !347, !349}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "dict_view_it_type", scope: !2, file: !77, line: 427, type: !94, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "dict_locals_dict", scope: !2, file: !77, line: 548, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "dict_locals_dict_table", scope: !2, file: !77, line: 531, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1792, elements: !270)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !265)
!265 = !{!266, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !264, file: !6, line: 356, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !230)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !264, file: !6, line: 357, baseType: !267, size: 64, offset: 64)
!270 = !{!271}
!271 = !DISubrange(count: 14)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "dict_clear_obj", scope: !2, file: !77, line: 216, type: !274, isLocal: true, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !276, file: !6, line: 795, baseType: !89, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !276, file: !6, line: 801, baseType: !280, size: 64, offset: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !276, file: !6, line: 796, size: 64, elements: !281)
!281 = !{!282, !287, !288, !293}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !280, file: !6, line: 797, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!129}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !280, file: !6, line: 798, baseType: !200, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !280, file: !6, line: 799, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!129, !129, !129}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !280, file: !6, line: 800, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !182)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "dict_copy_obj", scope: !2, file: !77, line: 231, type: !274, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "dict_fromkeys_obj", scope: !2, file: !77, line: 261, type: !299, isLocal: true, isDefinition: true)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_static_class_method_t", file: !6, line: 846, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_obj_static_class_method_t", file: !6, line: 843, size: 128, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !301, file: !6, line: 844, baseType: !89, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !301, file: !6, line: 845, baseType: !267, size: 64, offset: 64)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "dict_fromkeys_fun_obj", scope: !2, file: !77, line: 260, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !310)
!310 = !{!311, !312, !314, !315, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !309, file: !6, line: 806, baseType: !89, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !309, file: !6, line: 807, baseType: !313, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!313 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !309, file: !6, line: 808, baseType: !226, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !309, file: !6, line: 809, baseType: !226, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !309, file: !6, line: 813, baseType: !317, size: 64, offset: 128)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !6, line: 810, size: 64, elements: !318)
!318 = !{!319, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !317, file: !6, line: 811, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!129, !124, !136}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !317, file: !6, line: 812, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!129, !124, !136, !138}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "dict_get_obj", scope: !2, file: !77, line: 296, type: !307, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "dict_items_obj", scope: !2, file: !77, line: 502, type: !274, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "dict_view_type", scope: !2, file: !77, line: 478, type: !94, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "mp_dict_view_names", scope: !2, file: !77, line: 390, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 192, elements: !197)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "dict_keys_obj", scope: !2, file: !77, line: 507, type: !274, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "dict_pop_obj", scope: !2, file: !77, line: 301, type: !307, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "dict_popitem_obj", scope: !2, file: !77, line: 325, type: !274, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "dict_setdefault_obj", scope: !2, file: !77, line: 306, type: !307, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "dict_update_obj", scope: !2, file: !77, line: 375, type: !307, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "dict_values_obj", scope: !2, file: !77, line: 512, type: !274, isLocal: true, isDefinition: true)
!351 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!352 = !{i32 2, !"Dwarf Version", i32 4}
!353 = !{i32 2, !"Debug Info Version", i32 3}
!354 = !{i32 1, !"wchar_size", i32 4}
!355 = !{i32 7, !"PIC Level", i32 2}
!356 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!357 = distinct !DISubprogram(name: "mp_obj_dict_get", scope: !77, file: !77, line: 167, type: !291, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DILocalVariable(name: "self_in", arg: 1, scope: !357, file: !77, line: 167, type: !129)
!360 = !DILocalVariable(name: "index", arg: 2, scope: !357, file: !77, line: 167, type: !129)
