; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!257 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !{!305, !306, !307, !314, !466, !477, !491, !492, !493, !464}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !305)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !308, line: 69, baseType: !309)
!308 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !310, line: 32, baseType: !311)
!310 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !312, line: 49, baseType: !313)
!312 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!313 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_exception_t", file: !316, line: 38, baseType: !317)
!316 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.h", directory: "")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_exception_t", file: !316, line: 32, size: 256, elements: !318)
!318 = !{!319, !461, !462, !463, !465}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !317, file: !316, line: 33, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !321, file: !6, line: 57, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !328)
!328 = !{!329, !330, !334, !335, !360, !384, !389, !395, !401, !408, !413, !427, !432, !451, !454, !455}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !327, file: !6, line: 476, baseType: !320, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !327, file: !6, line: 479, baseType: !331, size: 16, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !332, line: 31, baseType: !333)
!332 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !6, line: 482, baseType: !331, size: 16, offset: 80)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !327, file: !6, line: 485, baseType: !336, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340, !306, !359}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !343, line: 53, baseType: !344)
!343 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !343, line: 50, size: 128, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !343, line: 51, baseType: !305, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !344, file: !343, line: 52, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !343, line: 48, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !305, !352, !355}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !356, line: 31, baseType: !357)
!356 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !312, line: 92, baseType: !358)
!358 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !327, file: !6, line: 488, baseType: !361, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!306, !324, !355, !365, !367}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !369, file: !6, line: 366, baseType: !355, size: 1, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !369, file: !6, line: 367, baseType: !355, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !369, file: !6, line: 368, baseType: !355, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !369, file: !6, line: 369, baseType: !355, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !369, file: !6, line: 371, baseType: !355, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !369, file: !6, line: 372, baseType: !355, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !369, file: !6, line: 373, baseType: !378, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !380, file: !6, line: 351, baseType: !306, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !380, file: !6, line: 352, baseType: !306, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !327, file: !6, line: 491, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!306, !306, !355, !355, !365}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !327, file: !6, line: 495, baseType: !390, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!306, !394, !306}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !327, file: !6, line: 496, baseType: !396, size: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!306, !400, !306, !306}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !327, file: !6, line: 509, baseType: !402, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !306, !406, !407}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !355)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !327, file: !6, line: 516, baseType: !409, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!306, !306, !306, !306}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !327, file: !6, line: 521, baseType: !414, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!306, !306, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !420, file: !6, line: 433, baseType: !320, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !420, file: !6, line: 434, baseType: !424, size: 192, offset: 64)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 192, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 3)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !327, file: !6, line: 525, baseType: !428, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!306, !306}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !327, file: !6, line: 528, baseType: !433, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !435)
!435 = !{!436}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !434, file: !6, line: 469, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!307, !306, !440, !448}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !442, file: !6, line: 457, baseType: !305, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !442, file: !6, line: 458, baseType: !355, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !442, file: !6, line: 459, baseType: !447, size: 32, offset: 128)
!447 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !308, line: 70, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !450, line: 30, baseType: !358)
!450 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !327, file: !6, line: 531, baseType: !452, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !327, file: !6, line: 537, baseType: !452, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !327, file: !6, line: 540, baseType: !456, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !457, file: !6, line: 776, baseType: !320, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !457, file: !6, line: 777, baseType: !368, size: 192, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_alloc", scope: !317, file: !316, line: 34, baseType: !355, size: 32, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_len", scope: !317, file: !316, line: 35, baseType: !355, size: 32, offset: 96, flags: DIFlagBitField, extraData: i64 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_data", scope: !317, file: !316, line: 36, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !317, file: !316, line: 37, baseType: !466, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !468, line: 35, baseType: !469)
!468 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.h", directory: "")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !468, line: 31, size: 128, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !469, file: !468, line: 32, baseType: !320, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !469, file: !468, line: 33, baseType: !355, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !469, file: !468, line: 34, baseType: !474, offset: 128)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: -1)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !479, line: 37, baseType: !480)
!479 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objstr.h", directory: "")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !479, line: 31, size: 256, elements: !481)
!481 = !{!482, !483, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !480, file: !479, line: 32, baseType: !320, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !480, file: !479, line: 33, baseType: !448, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !480, file: !479, line: 35, baseType: !355, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !480, file: !479, line: 36, baseType: !486, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !489, line: 39, baseType: !490)
!489 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!490 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_instance_t", file: !495, line: 38, baseType: !496)
!495 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtype.h", directory: "")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_instance_t", file: !495, line: 33, size: 256, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !496, file: !495, line: 34, baseType: !320, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !496, file: !495, line: 35, baseType: !368, size: 192, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "subobj", scope: !496, file: !495, line: 36, baseType: !474, offset: 256)
!501 = !{!502, !506, !508, !510, !512, !0, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !558}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "mp_const_GeneratorExit_obj", scope: !2, file: !504, line: 97, type: !505, isLocal: false, isDefinition: true)
!504 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.c", directory: "")
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "mp_type_BaseException", scope: !2, file: !504, line: 240, type: !325, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "mp_type_SystemExit", scope: !2, file: !504, line: 250, type: !325, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "mp_type_KeyboardInterrupt", scope: !2, file: !504, line: 251, type: !325, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "mp_type_ReloadException", scope: !2, file: !504, line: 252, type: !325, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "mp_type_Exception", scope: !2, file: !504, line: 254, type: !325, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "mp_type_StopIteration", scope: !2, file: !504, line: 258, type: !325, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "mp_type_ArithmeticError", scope: !2, file: !504, line: 259, type: !325, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "mp_type_OverflowError", scope: !2, file: !504, line: 261, type: !325, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "mp_type_ZeroDivisionError", scope: !2, file: !504, line: 262, type: !325, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "mp_type_AssertionError", scope: !2, file: !504, line: 263, type: !325, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "mp_type_AttributeError", scope: !2, file: !504, line: 264, type: !325, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "mp_type_EOFError", scope: !2, file: !504, line: 267, type: !325, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "mp_type_ImportError", scope: !2, file: !504, line: 268, type: !325, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "mp_type_LookupError", scope: !2, file: !504, line: 270, type: !325, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mp_type_IndexError", scope: !2, file: !504, line: 271, type: !325, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "mp_type_KeyError", scope: !2, file: !504, line: 272, type: !325, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "mp_type_MemoryError", scope: !2, file: !504, line: 273, type: !325, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "mp_type_NameError", scope: !2, file: !504, line: 274, type: !325, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "mp_type_OSError", scope: !2, file: !504, line: 278, type: !325, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "mp_type_TimeoutError", scope: !2, file: !504, line: 279, type: !325, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "mp_type_RuntimeError", scope: !2, file: !504, line: 297, type: !325, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "mp_type_NotImplementedError", scope: !2, file: !504, line: 298, type: !325, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "mp_type_SyntaxError", scope: !2, file: !504, line: 299, type: !325, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "mp_type_IndentationError", scope: !2, file: !504, line: 300, type: !325, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "mp_type_TypeError", scope: !2, file: !504, line: 305, type: !325, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "mp_type_ValueError", scope: !2, file: !504, line: 309, type: !325, isLocal: false, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "mp_type_MpyError", scope: !2, file: !504, line: 314, type: !325, isLocal: false, isDefinition: true)
!560 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!561 = !{i32 2, !"Dwarf Version", i32 4}
!562 = !{i32 2, !"Debug Info Version", i32 3}
!563 = !{i32 1, !"wchar_size", i32 4}
!564 = !{i32 7, !"PIC Level", i32 2}
!565 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!566 = distinct !DISubprogram(name: "mp_obj_exception_print", scope: !504, file: !504, line: 99, type: !338, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !575, !586}
!568 = !DILocalVariable(name: "print", arg: 1, scope: !566, file: !504, line: 99, type: !340)
!569 = !DILocalVariable(name: "o_in", arg: 2, scope: !566, file: !504, line: 99, type: !306)
!570 = !DILocalVariable(name: "kind", arg: 3, scope: !566, file: !504, line: 99, type: !359)
!571 = !DILocalVariable(name: "o", scope: !566, file: !504, line: 100, type: !314)
!572 = !DILocalVariable(name: "k", scope: !566, file: !504, line: 101, type: !359)
!573 = !DILocalVariable(name: "is_subclass", scope: !566, file: !504, line: 102, type: !574)
!574 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!575 = !DILocalVariable(name: "decompressed", scope: !576, file: !504, line: 119, type: !583)
!576 = distinct !DILexicalBlock(scope: !577, file: !504, line: 118, column: 108)
!577 = distinct !DILexicalBlock(scope: !578, file: !504, line: 117, column: 17)
!578 = distinct !DILexicalBlock(scope: !579, file: !504, line: 115, column: 39)
!579 = distinct !DILexicalBlock(scope: !580, file: !504, line: 115, column: 20)
!580 = distinct !DILexicalBlock(scope: !581, file: !504, line: 112, column: 13)
!581 = distinct !DILexicalBlock(scope: !582, file: !504, line: 111, column: 43)
!582 = distinct !DILexicalBlock(scope: !566, file: !504, line: 111, column: 9)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 400, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 50)
!586 = !DILocalVariable(name: "msg", scope: !576, file: !504, line: 120, type: !352)
!587 = !DILocation(line: 99, column: 47, scope: !566)
!588 = !DILocation(line: 99, column: 63, scope: !566)
!589 = !DILocation(line: 99, column: 85, scope: !566)
!590 = !DILocation(line: 100, column: 25, scope: !566)
!591 = !DILocation(line: 101, column: 30, scope: !566)
!592 = !DILocation(line: 101, column: 21, scope: !566)
!593 = !DILocation(line: 102, column: 24, scope: !566)
!594 = !DILocation(line: 103, column: 42, scope: !595)
!595 = distinct !DILexicalBlock(scope: !566, file: !504, line: 103, column: 9)
!596 = !DILocation(line: 103, column: 22, scope: !595)
!597 = !DILocation(line: 104, column: 46, scope: !598)
!598 = distinct !DILexicalBlock(scope: !595, file: !504, line: 103, column: 62)
!599 = !{!600, !602, i64 0}
!600 = !{!"_mp_obj_exception_t", !601, i64 0, !605, i64 8, !605, i64 12, !602, i64 16, !602, i64 24}
!601 = !{!"_mp_obj_base_t", !602, i64 0}
!602 = !{!"any pointer", !603, i64 0}
!603 = !{!"omnipotent char", !604, i64 0}
!604 = !{!"Simple C/C++ TBAA"}
!605 = !{!"long", !603, i64 0}
!606 = !DILocation(line: 104, column: 52, scope: !598)
!607 = !{!608, !609, i64 10}
!608 = !{!"_mp_obj_type_t", !601, i64 0, !609, i64 8, !609, i64 10, !602, i64 16, !602, i64 24, !602, i64 32, !602, i64 40, !602, i64 48, !602, i64 56, !602, i64 64, !602, i64 72, !602, i64 80, !610, i64 88, !602, i64 96, !602, i64 104, !602, i64 112}
!609 = !{!"short", !603, i64 0}
!610 = !{!"_mp_buffer_p_t", !602, i64 0}
!611 = !DILocation(line: 104, column: 38, scope: !598)
!612 = !DILocation(line: 104, column: 29, scope: !598)
!613 = !DILocation(line: 104, column: 9, scope: !598)
!614 = !DILocation(line: 105, column: 5, scope: !598)
!615 = !DILocation(line: 107, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !566, file: !504, line: 107, column: 9)
!617 = !DILocation(line: 107, column: 9, scope: !566)
!618 = !DILocation(line: 108, column: 9, scope: !619)
!619 = distinct !DILexicalBlock(scope: !616, file: !504, line: 107, column: 25)
!620 = !DILocation(line: 111, column: 24, scope: !582)
!621 = !DILocation(line: 112, column: 16, scope: !580)
!622 = !{!600, !602, i64 24}
!623 = !DILocation(line: 112, column: 21, scope: !580)
!624 = !DILocation(line: 112, column: 29, scope: !580)
!625 = !DILocation(line: 112, column: 41, scope: !580)
!626 = !{!605, !605, i64 0}
!627 = !DILocation(line: 112, column: 13, scope: !581)
!628 = !DILocation(line: 113, column: 13, scope: !629)
!629 = distinct !DILexicalBlock(scope: !580, file: !504, line: 112, column: 51)
!630 = !DILocation(line: 114, column: 13, scope: !629)
!631 = !DILocation(line: 117, column: 37, scope: !577)
!632 = !{!602, !602, i64 0}
!633 = !DILocation(line: 117, column: 17, scope: !577)
!634 = !DILocation(line: 117, column: 56, scope: !577)
!635 = !DILocation(line: 118, column: 41, scope: !577)
!636 = !DILocation(line: 118, column: 17, scope: !577)
!637 = !DILocation(line: 117, column: 17, scope: !578)
!638 = !DILocation(line: 119, column: 17, scope: !576)
!639 = !DILocation(line: 119, column: 22, scope: !576)
!640 = !DILocation(line: 120, column: 61, scope: !576)
!641 = !DILocation(line: 120, column: 58, scope: !576)
!642 = !DILocation(line: 120, column: 35, scope: !576)
!643 = !DILocation(line: 120, column: 29, scope: !576)
!644 = !DILocation(line: 121, column: 25, scope: !645)
!645 = distinct !DILexicalBlock(scope: !576, file: !504, line: 121, column: 21)
!646 = !DILocation(line: 121, column: 21, scope: !576)
!647 = !DILocation(line: 122, column: 64, scope: !648)
!648 = distinct !DILexicalBlock(scope: !645, file: !504, line: 121, column: 34)
!649 = !DILocation(line: 122, column: 21, scope: !648)
!650 = !DILocation(line: 125, column: 13, scope: !577)
!651 = !DILocation(line: 126, column: 43, scope: !578)
!652 = !DILocation(line: 126, column: 40, scope: !578)
!653 = !DILocation(line: 126, column: 13, scope: !578)
!654 = !DILocation(line: 127, column: 13, scope: !578)
!655 = !DILocation(line: 130, column: 31, scope: !566)
!656 = !DILocation(line: 130, column: 5, scope: !566)
!657 = !DILocation(line: 131, column: 1, scope: !566)
!658 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !659, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !662)
!659 = !DISubroutineType(types: !660)
!660 = !{!574, !661}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !452)
!662 = !{!663}
!663 = !DILocalVariable(name: "o", arg: 1, scope: !658, file: !6, line: 88, type: !661)
!664 = !DILocation(line: 88, column: 55, scope: !658)
!665 = !DILocation(line: 89, column: 17, scope: !658)
!666 = !DILocation(line: 89, column: 32, scope: !658)
!667 = !DILocation(line: 89, column: 37, scope: !658)
!668 = !DILocation(line: 89, column: 7, scope: !658)
!669 = distinct !DISubprogram(name: "mp_obj_exception_make_new", scope: !504, file: !504, line: 133, type: !363, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !670)
!670 = !{!671, !672, !673, !674, !675, !676}
!671 = !DILocalVariable(name: "type", arg: 1, scope: !669, file: !504, line: 133, type: !324)
!672 = !DILocalVariable(name: "n_args", arg: 2, scope: !669, file: !504, line: 133, type: !355)
!673 = !DILocalVariable(name: "args", arg: 3, scope: !669, file: !504, line: 133, type: !365)
!674 = !DILocalVariable(name: "kw_args", arg: 4, scope: !669, file: !504, line: 133, type: !367)
!675 = !DILocalVariable(name: "o_exc", scope: !669, file: !504, line: 137, type: !314)
!676 = !DILocalVariable(name: "o_tuple", scope: !669, file: !504, line: 146, type: !466)
!677 = !DILocation(line: 133, column: 57, scope: !669)
!678 = !DILocation(line: 133, column: 70, scope: !669)
!679 = !DILocation(line: 133, column: 94, scope: !669)
!680 = !DILocation(line: 133, column: 110, scope: !669)
!681 = !DILocation(line: 134, column: 5, scope: !669)
!682 = !DILocation(line: 137, column: 33, scope: !669)
!683 = !DILocation(line: 137, column: 25, scope: !669)
!684 = !DILocation(line: 138, column: 15, scope: !685)
!685 = distinct !DILexicalBlock(scope: !669, file: !504, line: 138, column: 9)
!686 = !DILocation(line: 138, column: 9, scope: !669)
!687 = !DILocation(line: 143, column: 17, scope: !669)
!688 = !DILocation(line: 143, column: 22, scope: !669)
!689 = !DILocation(line: 144, column: 12, scope: !669)
!690 = !DILocation(line: 144, column: 27, scope: !669)
!691 = !{!600, !602, i64 16}
!692 = !DILocation(line: 147, column: 16, scope: !693)
!693 = distinct !DILexicalBlock(scope: !669, file: !504, line: 147, column: 9)
!694 = !DILocation(line: 147, column: 9, scope: !669)
!695 = !DILocation(line: 152, column: 19, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !504, line: 150, column: 12)
!697 = !DILocation(line: 165, column: 21, scope: !698)
!698 = distinct !DILexicalBlock(scope: !696, file: !504, line: 165, column: 13)
!699 = !DILocation(line: 165, column: 13, scope: !696)
!700 = !DILocation(line: 146, column: 21, scope: !669)
!701 = !DILocation(line: 170, column: 27, scope: !702)
!702 = distinct !DILexicalBlock(scope: !698, file: !504, line: 168, column: 16)
!703 = !DILocation(line: 170, column: 32, scope: !702)
!704 = !{!601, !602, i64 0}
!705 = !DILocation(line: 171, column: 22, scope: !702)
!706 = !DILocation(line: 171, column: 26, scope: !702)
!707 = !DILocation(line: 172, column: 13, scope: !702)
!708 = !DILocation(line: 0, scope: !693)
!709 = !DILocation(line: 177, column: 12, scope: !669)
!710 = !DILocation(line: 177, column: 17, scope: !669)
!711 = !DILocation(line: 179, column: 12, scope: !669)
!712 = !DILocation(line: 179, column: 5, scope: !669)
!713 = distinct !DISubprogram(name: "mp_obj_exception_get_value", scope: !504, file: !504, line: 183, type: !430, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!714 = !{!715, !716}
!715 = !DILocalVariable(name: "self_in", arg: 1, scope: !713, file: !504, line: 183, type: !306)
!716 = !DILocalVariable(name: "self", scope: !713, file: !504, line: 184, type: !314)
!717 = !DILocation(line: 183, column: 46, scope: !713)
!718 = !DILocation(line: 184, column: 25, scope: !713)
!719 = !DILocation(line: 185, column: 15, scope: !720)
!720 = distinct !DILexicalBlock(scope: !713, file: !504, line: 185, column: 9)
!721 = !DILocation(line: 185, column: 21, scope: !720)
!722 = !DILocation(line: 185, column: 25, scope: !720)
!723 = !DILocation(line: 185, column: 9, scope: !713)
!724 = !DILocation(line: 188, column: 16, scope: !725)
!725 = distinct !DILexicalBlock(scope: !720, file: !504, line: 187, column: 12)
!726 = !DILocation(line: 188, column: 9, scope: !725)
!727 = !DILocation(line: 0, scope: !720)
!728 = !DILocation(line: 190, column: 1, scope: !713)
!729 = distinct !DISubprogram(name: "mp_obj_exception_attr", scope: !504, file: !504, line: 192, type: !404, scopeLine: 192, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !730)
!730 = !{!731, !732, !733, !734}
!731 = !DILocalVariable(name: "self_in", arg: 1, scope: !729, file: !504, line: 192, type: !306)
!732 = !DILocalVariable(name: "attr", arg: 2, scope: !729, file: !504, line: 192, type: !406)
!733 = !DILocalVariable(name: "dest", arg: 3, scope: !729, file: !504, line: 192, type: !407)
!734 = !DILocalVariable(name: "self", scope: !729, file: !504, line: 193, type: !314)
!735 = !DILocation(line: 192, column: 37, scope: !729)
!736 = !DILocation(line: 192, column: 51, scope: !729)
!737 = !DILocation(line: 192, column: 67, scope: !729)
!738 = !DILocation(line: 193, column: 25, scope: !729)
!739 = !DILocation(line: 194, column: 9, scope: !740)
!740 = distinct !DILexicalBlock(scope: !729, file: !504, line: 194, column: 9)
!741 = !DILocation(line: 194, column: 17, scope: !740)
!742 = !DILocation(line: 194, column: 9, scope: !729)
!743 = !DILocation(line: 196, column: 18, scope: !744)
!744 = distinct !DILexicalBlock(scope: !745, file: !504, line: 196, column: 13)
!745 = distinct !DILexicalBlock(scope: !740, file: !504, line: 194, column: 33)
!746 = !DILocation(line: 196, column: 43, scope: !744)
!747 = !DILocation(line: 196, column: 46, scope: !744)
!748 = !DILocation(line: 196, column: 54, scope: !744)
!749 = !DILocation(line: 196, column: 13, scope: !745)
!750 = !DILocation(line: 203, column: 19, scope: !751)
!751 = distinct !DILexicalBlock(scope: !744, file: !504, line: 196, column: 72)
!752 = !DILocation(line: 203, column: 33, scope: !751)
!753 = !DILocation(line: 204, column: 21, scope: !751)
!754 = !DILocation(line: 205, column: 9, scope: !751)
!755 = !DILocation(line: 208, column: 14, scope: !756)
!756 = distinct !DILexicalBlock(scope: !729, file: !504, line: 208, column: 9)
!757 = !DILocation(line: 208, column: 9, scope: !729)
!758 = !DILocation(line: 209, column: 19, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !504, line: 208, column: 31)
!760 = !DILocation(line: 209, column: 17, scope: !759)
!761 = !DILocation(line: 210, column: 5, scope: !759)
!762 = !DILocation(line: 210, column: 27, scope: !763)
!763 = distinct !DILexicalBlock(scope: !756, file: !504, line: 210, column: 16)
!764 = !DILocation(line: 210, column: 32, scope: !763)
!765 = !DILocation(line: 210, column: 66, scope: !763)
!766 = !DILocation(line: 210, column: 58, scope: !763)
!767 = !DILocation(line: 211, column: 19, scope: !768)
!768 = distinct !DILexicalBlock(scope: !763, file: !504, line: 210, column: 84)
!769 = !DILocation(line: 211, column: 17, scope: !768)
!770 = !DILocation(line: 237, column: 5, scope: !768)
!771 = !DILocation(line: 238, column: 1, scope: !729)
!772 = distinct !DISubprogram(name: "mp_obj_new_exception", scope: !504, file: !504, line: 329, type: !773, scopeLine: 329, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!306, !324}
!775 = !{!776}
!776 = !DILocalVariable(name: "exc_type", arg: 1, scope: !772, file: !504, line: 329, type: !324)
!777 = !DILocation(line: 329, column: 52, scope: !772)
!778 = !DILocation(line: 330, column: 12, scope: !772)
!779 = !DILocation(line: 330, column: 5, scope: !772)
!780 = distinct !DISubprogram(name: "mp_obj_new_exception_args", scope: !504, file: !504, line: 338, type: !781, scopeLine: 338, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{!306, !324, !355, !365}
!783 = !{!784, !785, !786}
!784 = !DILocalVariable(name: "exc_type", arg: 1, scope: !780, file: !504, line: 338, type: !324)
!785 = !DILocalVariable(name: "n_args", arg: 2, scope: !780, file: !504, line: 338, type: !355)
!786 = !DILocalVariable(name: "args", arg: 3, scope: !780, file: !504, line: 338, type: !365)
!787 = !DILocation(line: 338, column: 57, scope: !780)
!788 = !DILocation(line: 338, column: 74, scope: !780)
!789 = !DILocation(line: 338, column: 98, scope: !780)
!790 = !DILocation(line: 340, column: 22, scope: !780)
!791 = !DILocation(line: 340, column: 12, scope: !780)
!792 = !{!608, !602, i64 24}
!793 = !DILocation(line: 340, column: 5, scope: !780)
!794 = distinct !DISubprogram(name: "mp_obj_new_exception_arg1", scope: !504, file: !504, line: 334, type: !795, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!306, !324, !306}
!797 = !{!798, !799}
!798 = !DILocalVariable(name: "exc_type", arg: 1, scope: !794, file: !504, line: 334, type: !324)
!799 = !DILocalVariable(name: "arg", arg: 2, scope: !794, file: !504, line: 334, type: !306)
!800 = !DILocation(line: 334, column: 57, scope: !794)
!801 = !DILocation(line: 334, column: 76, scope: !794)
!802 = !DILocation(line: 335, column: 12, scope: !794)
!803 = !DILocation(line: 335, column: 5, scope: !794)
!804 = distinct !DISubprogram(name: "mp_obj_new_exception_msg", scope: !504, file: !504, line: 343, type: !805, scopeLine: 343, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !819)
!805 = !DISubroutineType(types: !806)
!806 = !{!306, !324, !807}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressed_string_t", file: !810, line: 35, baseType: !811)
!810 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/supervisor/shared/translate.h", directory: "")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 32, size: 16, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !811, file: !810, line: 33, baseType: !331, size: 16)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !811, file: !810, line: 34, baseType: !815, offset: 16)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, elements: !475)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !818, line: 31, baseType: !490)
!818 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!819 = !{!820, !821}
!820 = !DILocalVariable(name: "exc_type", arg: 1, scope: !804, file: !504, line: 343, type: !324)
!821 = !DILocalVariable(name: "msg", arg: 2, scope: !804, file: !504, line: 343, type: !807)
!822 = !DILocation(line: 343, column: 56, scope: !804)
!823 = !DILocation(line: 343, column: 93, scope: !804)
!824 = !DILocation(line: 344, column: 12, scope: !804)
!825 = !DILocation(line: 344, column: 5, scope: !804)
!826 = distinct !DISubprogram(name: "mp_obj_new_exception_msg_varg", scope: !504, file: !504, line: 381, type: !827, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!306, !324, !807, null}
!829 = !{!830, !831, !832, !846}
!830 = !DILocalVariable(name: "exc_type", arg: 1, scope: !826, file: !504, line: 381, type: !324)
!831 = !DILocalVariable(name: "fmt", arg: 2, scope: !826, file: !504, line: 381, type: !807)
!832 = !DILocalVariable(name: "ap", scope: !826, file: !504, line: 382, type: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !834, line: 32, baseType: !835)
!834 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_va_list.h", directory: "")
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !312, line: 98, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 382, baseType: !837)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 192, elements: !844)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 382, size: 192, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !838, file: !3, line: 382, baseType: !7, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !838, file: !3, line: 382, baseType: !7, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !838, file: !3, line: 382, baseType: !305, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !838, file: !3, line: 382, baseType: !305, size: 64, offset: 128)
!844 = !{!845}
!845 = !DISubrange(count: 1)
!846 = !DILocalVariable(name: "exception", scope: !826, file: !504, line: 384, type: !306)
!847 = !DILocation(line: 381, column: 61, scope: !826)
!848 = !DILocation(line: 381, column: 98, scope: !826)
!849 = !DILocation(line: 382, column: 5, scope: !826)
!850 = !DILocation(line: 382, column: 13, scope: !826)
!851 = !DILocation(line: 383, column: 5, scope: !826)
!852 = !DILocation(line: 384, column: 26, scope: !826)
!853 = !DILocation(line: 384, column: 14, scope: !826)
!854 = !DILocation(line: 385, column: 5, scope: !826)
!855 = !DILocation(line: 387, column: 1, scope: !826)
!856 = !DILocation(line: 386, column: 5, scope: !826)
!857 = distinct !DISubprogram(name: "mp_obj_new_exception_msg_vlist", scope: !504, file: !504, line: 389, type: !858, scopeLine: 389, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !861)
!858 = !DISubroutineType(types: !859)
!859 = !{!306, !324, !807, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !878, !879, !880, !884}
!862 = !DILocalVariable(name: "exc_type", arg: 1, scope: !857, file: !504, line: 389, type: !324)
!863 = !DILocalVariable(name: "fmt", arg: 2, scope: !857, file: !504, line: 389, type: !807)
!864 = !DILocalVariable(name: "ap", arg: 3, scope: !857, file: !504, line: 389, type: !860)
!865 = !DILocalVariable(name: "o_str", scope: !857, file: !504, line: 396, type: !477)
!866 = !DILocalVariable(name: "o_str_alloc", scope: !857, file: !504, line: 397, type: !355)
!867 = !DILocalVariable(name: "o_str_buf", scope: !857, file: !504, line: 398, type: !491)
!868 = !DILocalVariable(name: "used_emg_buf", scope: !857, file: !504, line: 400, type: !574)
!869 = !DILocalVariable(name: "exc_pr", scope: !870, file: !504, line: 428, type: !872)
!870 = distinct !DILexicalBlock(scope: !871, file: !504, line: 426, column: 12)
!871 = distinct !DILexicalBlock(scope: !857, file: !504, line: 422, column: 9)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_exc_printer_t", file: !504, line: 351, size: 256, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "allow_realloc", scope: !872, file: !504, line: 352, baseType: !574, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !872, file: !504, line: 353, baseType: !355, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !872, file: !504, line: 354, baseType: !355, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !872, file: !504, line: 355, baseType: !491, size: 64, offset: 192)
!878 = !DILocalVariable(name: "print", scope: !870, file: !504, line: 429, type: !342)
!879 = !DILocalVariable(name: "__vla_expr0", scope: !870, type: !358, flags: DIFlagArtificial)
!880 = !DILocalVariable(name: "fmt_decompressed", scope: !870, file: !504, line: 430, type: !881)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: !879)
!884 = !DILocalVariable(name: "arg", scope: !857, file: !504, line: 441, type: !306)
!885 = !DILocation(line: 389, column: 62, scope: !857)
!886 = !DILocation(line: 389, column: 99, scope: !857)
!887 = !DILocation(line: 389, column: 112, scope: !857)
!888 = !DILocation(line: 396, column: 27, scope: !857)
!889 = !DILocation(line: 396, column: 19, scope: !857)
!890 = !DILocation(line: 397, column: 31, scope: !857)
!891 = !{!609, !609, i64 0}
!892 = !DILocation(line: 397, column: 26, scope: !857)
!893 = !DILocation(line: 397, column: 38, scope: !857)
!894 = !DILocation(line: 397, column: 12, scope: !857)
!895 = !DILocation(line: 398, column: 23, scope: !857)
!896 = !DILocation(line: 398, column: 11, scope: !857)
!897 = !DILocation(line: 400, column: 10, scope: !857)
!898 = !DILocation(line: 417, column: 15, scope: !899)
!899 = distinct !DILexicalBlock(scope: !857, file: !504, line: 417, column: 9)
!900 = !DILocation(line: 417, column: 9, scope: !857)
!901 = !DILocation(line: 419, column: 16, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !504, line: 417, column: 24)
!903 = !DILocation(line: 419, column: 9, scope: !902)
!904 = !DILocation(line: 422, column: 19, scope: !871)
!905 = !DILocation(line: 422, column: 9, scope: !857)
!906 = !DILocation(line: 424, column: 16, scope: !907)
!907 = distinct !DILexicalBlock(scope: !871, file: !504, line: 422, column: 28)
!908 = !DILocation(line: 425, column: 21, scope: !907)
!909 = !DILocation(line: 426, column: 5, scope: !907)
!910 = !DILocation(line: 428, column: 9, scope: !870)
!911 = !DILocation(line: 428, column: 40, scope: !870)
!912 = !{!913, !914, i64 0}
!913 = !{!"_exc_printer_t", !914, i64 0, !605, i64 8, !605, i64 16, !602, i64 24}
!914 = !{!"_Bool", !603, i64 0}
!915 = !{!913, !605, i64 8}
!916 = !{!913, !605, i64 16}
!917 = !{!913, !602, i64 24}
!918 = !DILocation(line: 429, column: 9, scope: !870)
!919 = !DILocation(line: 429, column: 28, scope: !870)
!920 = !{!921, !602, i64 0}
!921 = !{!"_mp_print_t", !602, i64 0, !602, i64 8}
!922 = !{!921, !602, i64 8}
!923 = !DILocation(line: 430, column: 36, scope: !870)
!924 = !DILocation(line: 430, column: 9, scope: !870)
!925 = !DILocation(line: 0, scope: !870)
!926 = !DILocation(line: 430, column: 14, scope: !870)
!927 = !DILocation(line: 431, column: 9, scope: !870)
!928 = !DILocation(line: 429, column: 20, scope: !870)
!929 = !DILocation(line: 432, column: 9, scope: !870)
!930 = !DILocation(line: 433, column: 16, scope: !870)
!931 = !DILocation(line: 433, column: 27, scope: !870)
!932 = !DILocation(line: 433, column: 9, scope: !870)
!933 = !DILocation(line: 433, column: 32, scope: !870)
!934 = !{!603, !603, i64 0}
!935 = !DILocation(line: 434, column: 29, scope: !870)
!936 = !DILocation(line: 434, column: 16, scope: !870)
!937 = !DILocation(line: 434, column: 20, scope: !870)
!938 = !{!939, !605, i64 16}
!939 = !{!"_mp_obj_str_t", !601, i64 0, !605, i64 8, !605, i64 16, !602, i64 24}
!940 = !DILocation(line: 435, column: 30, scope: !870)
!941 = !DILocation(line: 435, column: 16, scope: !870)
!942 = !DILocation(line: 435, column: 21, scope: !870)
!943 = !{!939, !602, i64 24}
!944 = !DILocation(line: 436, column: 5, scope: !871)
!945 = !DILocation(line: 439, column: 17, scope: !857)
!946 = !DILocation(line: 439, column: 22, scope: !857)
!947 = !{!939, !602, i64 0}
!948 = !DILocation(line: 440, column: 44, scope: !857)
!949 = !DILocation(line: 440, column: 57, scope: !857)
