; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objexcept.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }

!245 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!246 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!247 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!248 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!249 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!250 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!251 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!252 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!253 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!254 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!255 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!256 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!257 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!258 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!259 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!260 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!261 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!262 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!263 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!264 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!265 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!266 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!267 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!268 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!269 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!270 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!271 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!272 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!273 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!274 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!275 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!276 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!277 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!278 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!279 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!280 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!281 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!282 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!283 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!284 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!285 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!286 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!287 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!288 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!289 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!290 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!291 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!292 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!293 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!294 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!295 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!296 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!297 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!298 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!299 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!300 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!301 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!302 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!303 = !{!304, !305, !306, !313, !465, !476, !490, !491, !492, !463}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !304)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !307, line: 70, baseType: !308)
!307 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !309, line: 32, baseType: !310)
!309 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !311, line: 49, baseType: !312)
!311 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!312 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_exception_t", file: !315, line: 38, baseType: !316)
!315 = !DIFile(filename: "../../py/objexcept.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_exception_t", file: !315, line: 32, size: 256, elements: !317)
!317 = !{!318, !460, !461, !462, !464}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !316, file: !315, line: 33, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !6, line: 57, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !327)
!327 = !{!328, !329, !333, !334, !359, !383, !388, !394, !400, !407, !412, !426, !431, !450, !453, !454}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !326, file: !6, line: 476, baseType: !319, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !6, line: 479, baseType: !330, size: 16, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !331, line: 31, baseType: !332)
!331 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!332 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !6, line: 482, baseType: !330, size: 16, offset: 80)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !326, file: !6, line: 485, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !305, !358}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !342, line: 53, baseType: !343)
!342 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !342, line: 50, size: 128, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !342, line: 51, baseType: !304, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !343, file: !342, line: 52, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !342, line: 48, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !304, !351, !354}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !355, line: 31, baseType: !356)
!355 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !311, line: 92, baseType: !357)
!357 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !326, file: !6, line: 488, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!305, !323, !354, !364, !366}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !368, file: !6, line: 366, baseType: !354, size: 1, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !368, file: !6, line: 367, baseType: !354, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !368, file: !6, line: 368, baseType: !354, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !368, file: !6, line: 369, baseType: !354, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !368, file: !6, line: 371, baseType: !354, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !368, file: !6, line: 372, baseType: !354, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !368, file: !6, line: 373, baseType: !377, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !379, file: !6, line: 351, baseType: !305, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !379, file: !6, line: 352, baseType: !305, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !326, file: !6, line: 491, baseType: !384, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!305, !305, !354, !354, !364}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !326, file: !6, line: 495, baseType: !389, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!305, !393, !305}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !326, file: !6, line: 496, baseType: !395, size: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!305, !399, !305, !305}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !326, file: !6, line: 509, baseType: !401, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !305, !405, !406}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !70, line: 48, baseType: !354)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !326, file: !6, line: 516, baseType: !408, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!305, !305, !305, !305}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !326, file: !6, line: 521, baseType: !413, size: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!305, !305, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !6, line: 433, baseType: !319, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !419, file: !6, line: 434, baseType: !423, size: 192, offset: 64)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 192, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 3)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !326, file: !6, line: 525, baseType: !427, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!305, !305}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !326, file: !6, line: 528, baseType: !432, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !433, file: !6, line: 469, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!306, !305, !439, !447}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !441, file: !6, line: 457, baseType: !304, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !441, file: !6, line: 458, baseType: !354, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !441, file: !6, line: 459, baseType: !446, size: 32, offset: 128)
!446 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !307, line: 71, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !449, line: 30, baseType: !357)
!449 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !326, file: !6, line: 531, baseType: !451, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !326, file: !6, line: 537, baseType: !451, size: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !326, file: !6, line: 540, baseType: !455, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !6, line: 776, baseType: !319, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !456, file: !6, line: 777, baseType: !367, size: 192, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_alloc", scope: !316, file: !315, line: 34, baseType: !354, size: 32, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_len", scope: !316, file: !315, line: 35, baseType: !354, size: 32, offset: 96, flags: DIFlagBitField, extraData: i64 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "traceback_data", scope: !316, file: !315, line: 36, baseType: !463, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !316, file: !315, line: 37, baseType: !465, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !467, line: 35, baseType: !468)
!467 = !DIFile(filename: "../../py/objtuple.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !467, line: 31, size: 128, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !468, file: !467, line: 32, baseType: !319, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !468, file: !467, line: 33, baseType: !354, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !468, file: !467, line: 34, baseType: !473, offset: 128)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: -1)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_str_t", file: !478, line: 37, baseType: !479)
!478 = !DIFile(filename: "../../py/objstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_str_t", file: !478, line: 31, size: 256, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !479, file: !478, line: 32, baseType: !319, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !479, file: !478, line: 33, baseType: !447, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !479, file: !478, line: 35, baseType: !354, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !478, line: 36, baseType: !485, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !488, line: 39, baseType: !489)
!488 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!489 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_instance_t", file: !494, line: 38, baseType: !495)
!494 = !DIFile(filename: "../../py/objtype.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_instance_t", file: !494, line: 33, size: 256, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !495, file: !494, line: 34, baseType: !319, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !495, file: !494, line: 35, baseType: !367, size: 192, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "subobj", scope: !495, file: !494, line: 36, baseType: !473, offset: 256)
!500 = !{!501, !504, !506, !508, !510, !0, !512, !514, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "mp_const_GeneratorExit_obj", scope: !2, file: !3, line: 97, type: !503, isLocal: false, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "mp_type_BaseException", scope: !2, file: !3, line: 240, type: !324, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "mp_type_SystemExit", scope: !2, file: !3, line: 250, type: !324, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "mp_type_KeyboardInterrupt", scope: !2, file: !3, line: 251, type: !324, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "mp_type_ReloadException", scope: !2, file: !3, line: 252, type: !324, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "mp_type_Exception", scope: !2, file: !3, line: 254, type: !324, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "mp_type_StopIteration", scope: !2, file: !3, line: 258, type: !324, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "mp_type_ArithmeticError", scope: !2, file: !3, line: 259, type: !324, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "mp_type_OverflowError", scope: !2, file: !3, line: 261, type: !324, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "mp_type_ZeroDivisionError", scope: !2, file: !3, line: 262, type: !324, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "mp_type_AssertionError", scope: !2, file: !3, line: 263, type: !324, isLocal: false, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "mp_type_AttributeError", scope: !2, file: !3, line: 264, type: !324, isLocal: false, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "mp_type_EOFError", scope: !2, file: !3, line: 267, type: !324, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "mp_type_ImportError", scope: !2, file: !3, line: 268, type: !324, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "mp_type_LookupError", scope: !2, file: !3, line: 270, type: !324, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "mp_type_IndexError", scope: !2, file: !3, line: 271, type: !324, isLocal: false, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mp_type_KeyError", scope: !2, file: !3, line: 272, type: !324, isLocal: false, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "mp_type_MemoryError", scope: !2, file: !3, line: 273, type: !324, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "mp_type_NameError", scope: !2, file: !3, line: 274, type: !324, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "mp_type_OSError", scope: !2, file: !3, line: 278, type: !324, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "mp_type_TimeoutError", scope: !2, file: !3, line: 279, type: !324, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "mp_type_RuntimeError", scope: !2, file: !3, line: 297, type: !324, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "mp_type_NotImplementedError", scope: !2, file: !3, line: 298, type: !324, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "mp_type_SyntaxError", scope: !2, file: !3, line: 299, type: !324, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "mp_type_IndentationError", scope: !2, file: !3, line: 300, type: !324, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "mp_type_TypeError", scope: !2, file: !3, line: 305, type: !324, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "mp_type_ValueError", scope: !2, file: !3, line: 309, type: !324, isLocal: false, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "mp_type_MpyError", scope: !2, file: !3, line: 314, type: !324, isLocal: false, isDefinition: true)
!558 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!559 = !{i32 2, !"Dwarf Version", i32 4}
!560 = !{i32 2, !"Debug Info Version", i32 3}
!561 = !{i32 1, !"wchar_size", i32 4}
!562 = !{i32 7, !"PIC Level", i32 2}
!563 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!564 = distinct !DISubprogram(name: "mp_obj_exception_print", scope: !3, file: !3, line: 99, type: !337, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !573, !584}
!566 = !DILocalVariable(name: "print", arg: 1, scope: !564, file: !3, line: 99, type: !339)
!567 = !DILocalVariable(name: "o_in", arg: 2, scope: !564, file: !3, line: 99, type: !305)
!568 = !DILocalVariable(name: "kind", arg: 3, scope: !564, file: !3, line: 99, type: !358)
!569 = !DILocalVariable(name: "o", scope: !564, file: !3, line: 100, type: !313)
!570 = !DILocalVariable(name: "k", scope: !564, file: !3, line: 101, type: !358)
!571 = !DILocalVariable(name: "is_subclass", scope: !564, file: !3, line: 102, type: !572)
!572 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!573 = !DILocalVariable(name: "decompressed", scope: !574, file: !3, line: 119, type: !581)
!574 = distinct !DILexicalBlock(scope: !575, file: !3, line: 118, column: 108)
!575 = distinct !DILexicalBlock(scope: !576, file: !3, line: 117, column: 17)
!576 = distinct !DILexicalBlock(scope: !577, file: !3, line: 115, column: 39)
!577 = distinct !DILexicalBlock(scope: !578, file: !3, line: 115, column: 20)
!578 = distinct !DILexicalBlock(scope: !579, file: !3, line: 112, column: 13)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 111, column: 43)
!580 = distinct !DILexicalBlock(scope: !564, file: !3, line: 111, column: 9)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 400, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 50)
!584 = !DILocalVariable(name: "msg", scope: !574, file: !3, line: 120, type: !351)
!585 = !DILocation(line: 99, column: 47, scope: !564)
!586 = !DILocation(line: 99, column: 63, scope: !564)
!587 = !DILocation(line: 99, column: 85, scope: !564)
!588 = !DILocation(line: 100, column: 25, scope: !564)
!589 = !DILocation(line: 101, column: 30, scope: !564)
!590 = !DILocation(line: 101, column: 21, scope: !564)
!591 = !DILocation(line: 102, column: 24, scope: !564)
!592 = !DILocation(line: 103, column: 42, scope: !593)
!593 = distinct !DILexicalBlock(scope: !564, file: !3, line: 103, column: 9)
!594 = !DILocation(line: 103, column: 22, scope: !593)
!595 = !DILocation(line: 104, column: 46, scope: !596)
!596 = distinct !DILexicalBlock(scope: !593, file: !3, line: 103, column: 62)
!597 = !{!598, !600, i64 0}
!598 = !{!"_mp_obj_exception_t", !599, i64 0, !603, i64 8, !603, i64 12, !600, i64 16, !600, i64 24}
!599 = !{!"_mp_obj_base_t", !600, i64 0}
!600 = !{!"any pointer", !601, i64 0}
!601 = !{!"omnipotent char", !602, i64 0}
!602 = !{!"Simple C/C++ TBAA"}
!603 = !{!"long", !601, i64 0}
!604 = !DILocation(line: 104, column: 52, scope: !596)
!605 = !{!606, !607, i64 10}
!606 = !{!"_mp_obj_type_t", !599, i64 0, !607, i64 8, !607, i64 10, !600, i64 16, !600, i64 24, !600, i64 32, !600, i64 40, !600, i64 48, !600, i64 56, !600, i64 64, !600, i64 72, !600, i64 80, !608, i64 88, !600, i64 96, !600, i64 104, !600, i64 112}
!607 = !{!"short", !601, i64 0}
!608 = !{!"_mp_buffer_p_t", !600, i64 0}
!609 = !DILocation(line: 104, column: 38, scope: !596)
!610 = !DILocation(line: 104, column: 29, scope: !596)
!611 = !DILocation(line: 104, column: 9, scope: !596)
!612 = !DILocation(line: 105, column: 5, scope: !596)
!613 = !DILocation(line: 107, column: 11, scope: !614)
!614 = distinct !DILexicalBlock(scope: !564, file: !3, line: 107, column: 9)
!615 = !DILocation(line: 107, column: 9, scope: !564)
!616 = !DILocation(line: 108, column: 9, scope: !617)
!617 = distinct !DILexicalBlock(scope: !614, file: !3, line: 107, column: 25)
!618 = !DILocation(line: 111, column: 24, scope: !580)
!619 = !DILocation(line: 112, column: 16, scope: !578)
!620 = !{!598, !600, i64 24}
!621 = !DILocation(line: 112, column: 21, scope: !578)
!622 = !DILocation(line: 112, column: 29, scope: !578)
!623 = !DILocation(line: 112, column: 41, scope: !578)
!624 = !{!603, !603, i64 0}
!625 = !DILocation(line: 112, column: 13, scope: !579)
!626 = !DILocation(line: 113, column: 13, scope: !627)
!627 = distinct !DILexicalBlock(scope: !578, file: !3, line: 112, column: 51)
!628 = !DILocation(line: 114, column: 13, scope: !627)
!629 = !DILocation(line: 117, column: 37, scope: !575)
!630 = !{!600, !600, i64 0}
!631 = !DILocation(line: 117, column: 17, scope: !575)
!632 = !DILocation(line: 117, column: 56, scope: !575)
!633 = !DILocation(line: 118, column: 41, scope: !575)
!634 = !DILocation(line: 118, column: 17, scope: !575)
!635 = !DILocation(line: 117, column: 17, scope: !576)
!636 = !DILocation(line: 119, column: 17, scope: !574)
!637 = !DILocation(line: 119, column: 22, scope: !574)
!638 = !DILocation(line: 120, column: 61, scope: !574)
!639 = !DILocation(line: 120, column: 58, scope: !574)
!640 = !DILocation(line: 120, column: 35, scope: !574)
!641 = !DILocation(line: 120, column: 29, scope: !574)
!642 = !DILocation(line: 121, column: 25, scope: !643)
!643 = distinct !DILexicalBlock(scope: !574, file: !3, line: 121, column: 21)
!644 = !DILocation(line: 121, column: 21, scope: !574)
!645 = !DILocation(line: 122, column: 64, scope: !646)
!646 = distinct !DILexicalBlock(scope: !643, file: !3, line: 121, column: 34)
!647 = !DILocation(line: 122, column: 21, scope: !646)
!648 = !DILocation(line: 125, column: 13, scope: !575)
!649 = !DILocation(line: 126, column: 43, scope: !576)
!650 = !DILocation(line: 126, column: 40, scope: !576)
!651 = !DILocation(line: 126, column: 13, scope: !576)
!652 = !DILocation(line: 127, column: 13, scope: !576)
!653 = !DILocation(line: 130, column: 31, scope: !564)
!654 = !DILocation(line: 130, column: 5, scope: !564)
!655 = !DILocation(line: 131, column: 1, scope: !564)
!656 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !657, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !660)
!657 = !DISubroutineType(types: !658)
!658 = !{!572, !659}
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !451)
!660 = !{!661}
!661 = !DILocalVariable(name: "o", arg: 1, scope: !656, file: !6, line: 88, type: !659)
!662 = !DILocation(line: 88, column: 55, scope: !656)
!663 = !DILocation(line: 89, column: 17, scope: !656)
!664 = !DILocation(line: 89, column: 32, scope: !656)
!665 = !DILocation(line: 89, column: 37, scope: !656)
!666 = !DILocation(line: 89, column: 7, scope: !656)
!667 = distinct !DISubprogram(name: "mp_obj_exception_make_new", scope: !3, file: !3, line: 133, type: !362, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !668)
!668 = !{!669, !670, !671, !672, !673, !674}
!669 = !DILocalVariable(name: "type", arg: 1, scope: !667, file: !3, line: 133, type: !323)
!670 = !DILocalVariable(name: "n_args", arg: 2, scope: !667, file: !3, line: 133, type: !354)
!671 = !DILocalVariable(name: "args", arg: 3, scope: !667, file: !3, line: 133, type: !364)
!672 = !DILocalVariable(name: "kw_args", arg: 4, scope: !667, file: !3, line: 133, type: !366)
!673 = !DILocalVariable(name: "o_exc", scope: !667, file: !3, line: 137, type: !313)
!674 = !DILocalVariable(name: "o_tuple", scope: !667, file: !3, line: 146, type: !465)
!675 = !DILocation(line: 133, column: 57, scope: !667)
!676 = !DILocation(line: 133, column: 70, scope: !667)
!677 = !DILocation(line: 133, column: 94, scope: !667)
!678 = !DILocation(line: 133, column: 110, scope: !667)
!679 = !DILocation(line: 134, column: 5, scope: !667)
!680 = !DILocation(line: 137, column: 33, scope: !667)
!681 = !DILocation(line: 137, column: 25, scope: !667)
!682 = !DILocation(line: 138, column: 15, scope: !683)
!683 = distinct !DILexicalBlock(scope: !667, file: !3, line: 138, column: 9)
!684 = !DILocation(line: 138, column: 9, scope: !667)
!685 = !DILocation(line: 143, column: 17, scope: !667)
!686 = !DILocation(line: 143, column: 22, scope: !667)
!687 = !DILocation(line: 144, column: 12, scope: !667)
!688 = !DILocation(line: 144, column: 27, scope: !667)
!689 = !{!598, !600, i64 16}
!690 = !DILocation(line: 147, column: 16, scope: !691)
!691 = distinct !DILexicalBlock(scope: !667, file: !3, line: 147, column: 9)
!692 = !DILocation(line: 147, column: 9, scope: !667)
!693 = !DILocation(line: 152, column: 19, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !3, line: 150, column: 12)
!695 = !DILocation(line: 165, column: 21, scope: !696)
!696 = distinct !DILexicalBlock(scope: !694, file: !3, line: 165, column: 13)
!697 = !DILocation(line: 165, column: 13, scope: !694)
!698 = !DILocation(line: 146, column: 21, scope: !667)
!699 = !DILocation(line: 170, column: 27, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !3, line: 168, column: 16)
!701 = !DILocation(line: 170, column: 32, scope: !700)
!702 = !{!599, !600, i64 0}
!703 = !DILocation(line: 171, column: 22, scope: !700)
!704 = !DILocation(line: 171, column: 26, scope: !700)
!705 = !DILocation(line: 172, column: 13, scope: !700)
!706 = !DILocation(line: 0, scope: !694)
!707 = !DILocation(line: 177, column: 12, scope: !667)
!708 = !DILocation(line: 177, column: 17, scope: !667)
!709 = !DILocation(line: 179, column: 12, scope: !667)
!710 = !DILocation(line: 179, column: 5, scope: !667)
!711 = distinct !DISubprogram(name: "mp_obj_exception_get_value", scope: !3, file: !3, line: 183, type: !429, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !712)
!712 = !{!713, !714}
!713 = !DILocalVariable(name: "self_in", arg: 1, scope: !711, file: !3, line: 183, type: !305)
!714 = !DILocalVariable(name: "self", scope: !711, file: !3, line: 184, type: !313)
!715 = !DILocation(line: 183, column: 46, scope: !711)
!716 = !DILocation(line: 184, column: 25, scope: !711)
!717 = !DILocation(line: 185, column: 15, scope: !718)
!718 = distinct !DILexicalBlock(scope: !711, file: !3, line: 185, column: 9)
!719 = !DILocation(line: 185, column: 21, scope: !718)
!720 = !DILocation(line: 185, column: 25, scope: !718)
!721 = !DILocation(line: 185, column: 9, scope: !711)
!722 = !DILocation(line: 188, column: 16, scope: !723)
!723 = distinct !DILexicalBlock(scope: !718, file: !3, line: 187, column: 12)
!724 = !DILocation(line: 188, column: 9, scope: !723)
!725 = !DILocation(line: 0, scope: !723)
!726 = !DILocation(line: 190, column: 1, scope: !711)
!727 = distinct !DISubprogram(name: "mp_obj_exception_attr", scope: !3, file: !3, line: 192, type: !403, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DILocalVariable(name: "self_in", arg: 1, scope: !727, file: !3, line: 192, type: !305)
!730 = !DILocalVariable(name: "attr", arg: 2, scope: !727, file: !3, line: 192, type: !405)
!731 = !DILocalVariable(name: "dest", arg: 3, scope: !727, file: !3, line: 192, type: !406)
!732 = !DILocalVariable(name: "self", scope: !727, file: !3, line: 193, type: !313)
!733 = !DILocation(line: 192, column: 37, scope: !727)
!734 = !DILocation(line: 192, column: 51, scope: !727)
!735 = !DILocation(line: 192, column: 67, scope: !727)
!736 = !DILocation(line: 193, column: 25, scope: !727)
!737 = !DILocation(line: 194, column: 9, scope: !738)
!738 = distinct !DILexicalBlock(scope: !727, file: !3, line: 194, column: 9)
!739 = !DILocation(line: 194, column: 17, scope: !738)
!740 = !DILocation(line: 194, column: 9, scope: !727)
!741 = !DILocation(line: 196, column: 18, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 196, column: 13)
!743 = distinct !DILexicalBlock(scope: !738, file: !3, line: 194, column: 33)
!744 = !DILocation(line: 196, column: 43, scope: !742)
!745 = !DILocation(line: 196, column: 46, scope: !742)
!746 = !DILocation(line: 196, column: 54, scope: !742)
!747 = !DILocation(line: 196, column: 13, scope: !743)
!748 = !DILocation(line: 203, column: 19, scope: !749)
!749 = distinct !DILexicalBlock(scope: !742, file: !3, line: 196, column: 72)
!750 = !DILocation(line: 203, column: 33, scope: !749)
!751 = !DILocation(line: 204, column: 21, scope: !749)
!752 = !DILocation(line: 205, column: 9, scope: !749)
!753 = !DILocation(line: 208, column: 14, scope: !754)
!754 = distinct !DILexicalBlock(scope: !727, file: !3, line: 208, column: 9)
!755 = !DILocation(line: 208, column: 9, scope: !727)
!756 = !DILocation(line: 209, column: 19, scope: !757)
!757 = distinct !DILexicalBlock(scope: !754, file: !3, line: 208, column: 31)
!758 = !DILocation(line: 209, column: 17, scope: !757)
!759 = !DILocation(line: 210, column: 5, scope: !757)
!760 = !DILocation(line: 210, column: 27, scope: !761)
!761 = distinct !DILexicalBlock(scope: !754, file: !3, line: 210, column: 16)
!762 = !DILocation(line: 210, column: 32, scope: !761)
!763 = !DILocation(line: 210, column: 66, scope: !761)
!764 = !DILocation(line: 210, column: 58, scope: !761)
!765 = !DILocation(line: 211, column: 19, scope: !766)
!766 = distinct !DILexicalBlock(scope: !761, file: !3, line: 210, column: 84)
!767 = !DILocation(line: 211, column: 17, scope: !766)
!768 = !DILocation(line: 237, column: 5, scope: !766)
!769 = !DILocation(line: 238, column: 1, scope: !727)
!770 = distinct !DISubprogram(name: "mp_obj_new_exception", scope: !3, file: !3, line: 329, type: !771, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!305, !323}
!773 = !{!774}
!774 = !DILocalVariable(name: "exc_type", arg: 1, scope: !770, file: !3, line: 329, type: !323)
!775 = !DILocation(line: 329, column: 52, scope: !770)
!776 = !DILocation(line: 330, column: 12, scope: !770)
!777 = !DILocation(line: 330, column: 5, scope: !770)
!778 = distinct !DISubprogram(name: "mp_obj_new_exception_args", scope: !3, file: !3, line: 338, type: !779, isLocal: false, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!305, !323, !354, !364}
!781 = !{!782, !783, !784}
!782 = !DILocalVariable(name: "exc_type", arg: 1, scope: !778, file: !3, line: 338, type: !323)
!783 = !DILocalVariable(name: "n_args", arg: 2, scope: !778, file: !3, line: 338, type: !354)
!784 = !DILocalVariable(name: "args", arg: 3, scope: !778, file: !3, line: 338, type: !364)
!785 = !DILocation(line: 338, column: 57, scope: !778)
!786 = !DILocation(line: 338, column: 74, scope: !778)
!787 = !DILocation(line: 338, column: 98, scope: !778)
!788 = !DILocation(line: 340, column: 22, scope: !778)
!789 = !DILocation(line: 340, column: 12, scope: !778)
!790 = !{!606, !600, i64 24}
!791 = !DILocation(line: 340, column: 5, scope: !778)
!792 = distinct !DISubprogram(name: "mp_obj_new_exception_arg1", scope: !3, file: !3, line: 334, type: !793, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!305, !323, !305}
!795 = !{!796, !797}
!796 = !DILocalVariable(name: "exc_type", arg: 1, scope: !792, file: !3, line: 334, type: !323)
!797 = !DILocalVariable(name: "arg", arg: 2, scope: !792, file: !3, line: 334, type: !305)
!798 = !DILocation(line: 334, column: 57, scope: !792)
!799 = !DILocation(line: 334, column: 76, scope: !792)
!800 = !DILocation(line: 335, column: 12, scope: !792)
!801 = !DILocation(line: 335, column: 5, scope: !792)
!802 = distinct !DISubprogram(name: "mp_obj_new_exception_msg", scope: !3, file: !3, line: 343, type: !803, isLocal: false, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !817)
!803 = !DISubroutineType(types: !804)
!804 = !{!305, !323, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressed_string_t", file: !808, line: 35, baseType: !809)
!808 = !DIFile(filename: "../../supervisor/shared/translate.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !808, line: 32, size: 16, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !809, file: !808, line: 33, baseType: !330, size: 16)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !809, file: !808, line: 34, baseType: !813, offset: 16)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, elements: !474)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !816, line: 31, baseType: !489)
!816 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "exc_type", arg: 1, scope: !802, file: !3, line: 343, type: !323)
!819 = !DILocalVariable(name: "msg", arg: 2, scope: !802, file: !3, line: 343, type: !805)
!820 = !DILocation(line: 343, column: 56, scope: !802)
!821 = !DILocation(line: 343, column: 93, scope: !802)
!822 = !DILocation(line: 344, column: 12, scope: !802)
!823 = !DILocation(line: 344, column: 5, scope: !802)
!824 = distinct !DISubprogram(name: "mp_obj_new_exception_msg_varg", scope: !3, file: !3, line: 381, type: !825, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{!305, !323, !805, null}
!827 = !{!828, !829, !830, !845}
!828 = !DILocalVariable(name: "exc_type", arg: 1, scope: !824, file: !3, line: 381, type: !323)
!829 = !DILocalVariable(name: "fmt", arg: 2, scope: !824, file: !3, line: 381, type: !805)
!830 = !DILocalVariable(name: "ap", scope: !824, file: !3, line: 382, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !832, line: 32, baseType: !833)
!832 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_va_list.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !311, line: 98, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 382, baseType: !835)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 192, elements: !843)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 382, size: 192, elements: !837)
!837 = !{!838, !840, !841, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !836, file: !3, line: 382, baseType: !839, size: 32)
!839 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !836, file: !3, line: 382, baseType: !839, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !836, file: !3, line: 382, baseType: !304, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !836, file: !3, line: 382, baseType: !304, size: 64, offset: 128)
!843 = !{!844}
!844 = !DISubrange(count: 1)
!845 = !DILocalVariable(name: "exception", scope: !824, file: !3, line: 384, type: !305)
!846 = !DILocation(line: 381, column: 61, scope: !824)
!847 = !DILocation(line: 381, column: 98, scope: !824)
!848 = !DILocation(line: 382, column: 5, scope: !824)
!849 = !DILocation(line: 382, column: 13, scope: !824)
!850 = !DILocation(line: 383, column: 5, scope: !824)
!851 = !DILocation(line: 384, column: 26, scope: !824)
!852 = !DILocation(line: 384, column: 14, scope: !824)
!853 = !DILocation(line: 385, column: 5, scope: !824)
!854 = !DILocation(line: 387, column: 1, scope: !824)
!855 = !DILocation(line: 386, column: 5, scope: !824)
!856 = distinct !DISubprogram(name: "mp_obj_new_exception_msg_vlist", scope: !3, file: !3, line: 389, type: !857, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !860)
!857 = !DISubroutineType(types: !858)
!858 = !{!305, !323, !805, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !877, !878, !879, !883}
!861 = !DILocalVariable(name: "exc_type", arg: 1, scope: !856, file: !3, line: 389, type: !323)
!862 = !DILocalVariable(name: "fmt", arg: 2, scope: !856, file: !3, line: 389, type: !805)
!863 = !DILocalVariable(name: "ap", arg: 3, scope: !856, file: !3, line: 389, type: !859)
!864 = !DILocalVariable(name: "o_str", scope: !856, file: !3, line: 396, type: !476)
!865 = !DILocalVariable(name: "o_str_alloc", scope: !856, file: !3, line: 397, type: !354)
!866 = !DILocalVariable(name: "o_str_buf", scope: !856, file: !3, line: 398, type: !490)
!867 = !DILocalVariable(name: "used_emg_buf", scope: !856, file: !3, line: 400, type: !572)
!868 = !DILocalVariable(name: "exc_pr", scope: !869, file: !3, line: 428, type: !871)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 426, column: 12)
!870 = distinct !DILexicalBlock(scope: !856, file: !3, line: 422, column: 9)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_exc_printer_t", file: !3, line: 351, size: 256, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "allow_realloc", scope: !871, file: !3, line: 352, baseType: !572, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !871, file: !3, line: 353, baseType: !354, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !871, file: !3, line: 354, baseType: !354, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !871, file: !3, line: 355, baseType: !490, size: 64, offset: 192)
!877 = !DILocalVariable(name: "print", scope: !869, file: !3, line: 429, type: !341)
!878 = !DILocalVariable(name: "__vla_expr0", scope: !869, type: !357, flags: DIFlagArtificial)
!879 = !DILocalVariable(name: "fmt_decompressed", scope: !869, file: !3, line: 430, type: !880)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: !878)
!883 = !DILocalVariable(name: "arg", scope: !856, file: !3, line: 441, type: !305)
!884 = !DILocation(line: 389, column: 62, scope: !856)
!885 = !DILocation(line: 389, column: 99, scope: !856)
!886 = !DILocation(line: 389, column: 112, scope: !856)
!887 = !DILocation(line: 396, column: 27, scope: !856)
!888 = !DILocation(line: 396, column: 19, scope: !856)
!889 = !DILocation(line: 397, column: 31, scope: !856)
!890 = !{!607, !607, i64 0}
!891 = !DILocation(line: 397, column: 26, scope: !856)
!892 = !DILocation(line: 397, column: 38, scope: !856)
!893 = !DILocation(line: 397, column: 12, scope: !856)
!894 = !DILocation(line: 398, column: 23, scope: !856)
!895 = !DILocation(line: 398, column: 11, scope: !856)
!896 = !DILocation(line: 400, column: 10, scope: !856)
!897 = !DILocation(line: 417, column: 15, scope: !898)
!898 = distinct !DILexicalBlock(scope: !856, file: !3, line: 417, column: 9)
!899 = !DILocation(line: 417, column: 9, scope: !856)
!900 = !DILocation(line: 419, column: 16, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !3, line: 417, column: 24)
!902 = !DILocation(line: 419, column: 9, scope: !901)
!903 = !DILocation(line: 422, column: 19, scope: !870)
!904 = !DILocation(line: 422, column: 9, scope: !856)
!905 = !DILocation(line: 424, column: 16, scope: !906)
!906 = distinct !DILexicalBlock(scope: !870, file: !3, line: 422, column: 28)
!907 = !DILocation(line: 425, column: 21, scope: !906)
!908 = !DILocation(line: 426, column: 5, scope: !906)
!909 = !DILocation(line: 428, column: 9, scope: !869)
!910 = !DILocation(line: 428, column: 40, scope: !869)
!911 = !{!912, !913, i64 0}
!912 = !{!"_exc_printer_t", !913, i64 0, !603, i64 8, !603, i64 16, !600, i64 24}
!913 = !{!"_Bool", !601, i64 0}
!914 = !{!912, !603, i64 8}
!915 = !{!912, !603, i64 16}
!916 = !{!912, !600, i64 24}
!917 = !DILocation(line: 429, column: 9, scope: !869)
!918 = !DILocation(line: 429, column: 28, scope: !869)
!919 = !{!920, !600, i64 0}
!920 = !{!"_mp_print_t", !600, i64 0, !600, i64 8}
!921 = !{!920, !600, i64 8}
!922 = !DILocation(line: 430, column: 36, scope: !869)
!923 = !DILocation(line: 430, column: 9, scope: !869)
!924 = !DILocation(line: 0, scope: !869)
!925 = !DILocation(line: 430, column: 14, scope: !869)
!926 = !DILocation(line: 431, column: 9, scope: !869)
!927 = !DILocation(line: 429, column: 20, scope: !869)
!928 = !DILocation(line: 432, column: 9, scope: !869)
!929 = !DILocation(line: 433, column: 16, scope: !869)
!930 = !DILocation(line: 433, column: 27, scope: !869)
!931 = !DILocation(line: 433, column: 9, scope: !869)
!932 = !DILocation(line: 433, column: 32, scope: !869)
!933 = !{!601, !601, i64 0}
!934 = !DILocation(line: 434, column: 29, scope: !869)
!935 = !DILocation(line: 434, column: 16, scope: !869)
!936 = !DILocation(line: 434, column: 20, scope: !869)
!937 = !{!938, !603, i64 16}
!938 = !{!"_mp_obj_str_t", !599, i64 0, !603, i64 8, !603, i64 16, !600, i64 24}
!939 = !DILocation(line: 435, column: 30, scope: !869)
!940 = !DILocation(line: 435, column: 16, scope: !869)
!941 = !DILocation(line: 435, column: 21, scope: !869)
!942 = !{!938, !600, i64 24}
!943 = !DILocation(line: 436, column: 5, scope: !870)
!944 = !DILocation(line: 439, column: 17, scope: !856)
!945 = !DILocation(line: 439, column: 22, scope: !856)
!946 = !{!938, !600, i64 0}
!947 = !DILocation(line: 440, column: 44, scope: !856)
!948 = !DILocation(line: 440, column: 57, scope: !856)
!949 = !DILocation(line: 440, column: 19, scope: !856)
