; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objgenerator.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objgenerator.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_none_t = type opaque
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 423, size: 32, elements: !7)
!6 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "PRINT_STR", value: 0)
!9 = !DIEnumerator(name: "PRINT_REPR", value: 1)
!10 = !DIEnumerator(name: "PRINT_EXC", value: 2)
!11 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!12 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!13 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 47, size: 32, elements: !16)
!15 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!18 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!19 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!20 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!21 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!22 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!23 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!24 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!25 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!26 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 32, size: 32, elements: !71)
!70 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "MP_VM_RETURN_NORMAL", value: 0)
!73 = !DIEnumerator(name: "MP_VM_RETURN_YIELD", value: 1)
!74 = !DIEnumerator(name: "MP_VM_RETURN_EXCEPTION", value: 2)
!75 = !{!76, !108, !122, !233, !255}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_gen_wrap_t", file: !3, line: 45, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_gen_wrap_t", file: !3, line: 42, size: 128, elements: !79)
!79 = !{!80, !232}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !78, file: !3, line: 43, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !83)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !6, line: 57, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !89)
!89 = !{!90, !91, !95, !96, !124, !148, !153, !159, !165, !173, !178, !192, !197, !222, !225, !226}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !88, file: !6, line: 476, baseType: !81, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !6, line: 479, baseType: !92, size: 16, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !93, line: 31, baseType: !94)
!93 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !6, line: 482, baseType: !92, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !88, file: !6, line: 485, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !122, !123}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !104, line: 53, baseType: !105)
!104 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !104, line: 50, size: 128, elements: !106)
!106 = !{!107, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !104, line: 51, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !105, file: !104, line: 52, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !104, line: 48, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !108, !114, !117}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 31, baseType: !119)
!118 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !120, line: 92, baseType: !121)
!120 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !108)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !88, file: !6, line: 488, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!122, !85, !117, !129, !131}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !133, file: !6, line: 366, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !133, file: !6, line: 367, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !133, file: !6, line: 368, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !133, file: !6, line: 369, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !133, file: !6, line: 371, baseType: !117, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !133, file: !6, line: 372, baseType: !117, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !133, file: !6, line: 373, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !144, file: !6, line: 351, baseType: !122, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !144, file: !6, line: 352, baseType: !122, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !88, file: !6, line: 491, baseType: !149, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!122, !122, !117, !117, !129}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !88, file: !6, line: 495, baseType: !154, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!122, !158, !122}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !88, file: !6, line: 496, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!122, !164, !122, !122}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !88, file: !6, line: 509, baseType: !166, size: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !122, !170, !172}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !171, line: 48, baseType: !117)
!171 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !88, file: !6, line: 516, baseType: !174, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!122, !122, !122, !122}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !88, file: !6, line: 521, baseType: !179, size: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!122, !122, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !6, line: 433, baseType: !81, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !6, line: 434, baseType: !189, size: 192, offset: 64)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 192, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 3)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !88, file: !6, line: 525, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!122, !122}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !88, file: !6, line: 528, baseType: !198, size: 64, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !199, file: !6, line: 469, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !122, !211, !219}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !206, line: 70, baseType: !207)
!206 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !208, line: 32, baseType: !209)
!208 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !120, line: 49, baseType: !210)
!210 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !213, file: !6, line: 457, baseType: !108, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !6, line: 458, baseType: !117, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !213, file: !6, line: 459, baseType: !218, size: 32, offset: 128)
!218 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !206, line: 71, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !221, line: 30, baseType: !121)
!221 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !88, file: !6, line: 531, baseType: !223, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !88, file: !6, line: 537, baseType: !223, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !88, file: !6, line: 540, baseType: !227, size: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !228, file: !6, line: 776, baseType: !81, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !228, file: !6, line: 777, baseType: !132, size: 192, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !78, file: !3, line: 44, baseType: !172, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !235, line: 42, baseType: !236)
!235 = !DIFile(filename: "../../py/objfun.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !235, line: 31, size: 256, elements: !237)
!237 = !{!238, !239, !242, !248, !251}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !236, file: !235, line: 32, baseType: !81, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !236, file: !235, line: 33, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !228)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !236, file: !235, line: 34, baseType: !243, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !246, line: 39, baseType: !247)
!246 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!247 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !236, file: !235, line: 35, baseType: !249, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !236, file: !235, line: 41, baseType: !252, offset: 256)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: -1)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_gen_instance_t", file: !3, line: 51, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_gen_instance_t", file: !3, line: 47, size: 448, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !257, file: !3, line: 48, baseType: !81, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !257, file: !3, line: 49, baseType: !240, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "code_state", scope: !257, file: !3, line: 50, baseType: !262, size: 320, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !263, line: 90, baseType: !264)
!263 = !DIFile(filename: "../../py/bc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !263, line: 72, size: 320, elements: !265)
!265 = !{!266, !267, !268, !269, !278, !279}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !264, file: !263, line: 77, baseType: !233, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !264, file: !263, line: 78, baseType: !243, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !264, file: !263, line: 79, baseType: !172, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !264, file: !263, line: 81, baseType: !270, size: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !263, line: 70, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !263, line: 63, size: 192, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !272, file: !263, line: 64, baseType: !243, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !272, file: !263, line: 67, baseType: !172, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !272, file: !263, line: 69, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !264, file: !263, line: 82, baseType: !240, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !263, line: 87, baseType: !280, offset: 320)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 0)
!283 = !{!0, !284, !286, !289, !302, !325, !327, !351}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "mp_type_gen_instance", scope: !2, file: !3, line: 270, type: !86, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "gen_instance_locals_dict", scope: !2, file: !3, line: 268, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "gen_instance_locals_dict_table", scope: !2, file: !3, line: 259, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 512, elements: !300)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !295)
!295 = !{!296, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !294, file: !6, line: 356, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !223)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !294, file: !6, line: 357, baseType: !297, size: 64, offset: 64)
!300 = !{!301}
!301 = !DISubrange(count: 4)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "gen_instance_close_obj", scope: !2, file: !3, line: 246, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !306, file: !6, line: 795, baseType: !81, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !306, file: !6, line: 801, baseType: !310, size: 64, offset: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !306, file: !6, line: 796, size: 64, elements: !311)
!311 = !{!312, !317, !318, !323}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !310, file: !6, line: 797, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!122}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !310, file: !6, line: 798, baseType: !193, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !310, file: !6, line: 799, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!122, !122, !122}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !310, file: !6, line: 800, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !175)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "gen_instance_send_obj", scope: !2, file: !3, line: 209, type: !304, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "gen_instance_throw_obj", scope: !2, file: !3, line: 223, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !332)
!332 = !{!333, !334, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !331, file: !6, line: 806, baseType: !81, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !331, file: !6, line: 807, baseType: !335, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!335 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !331, file: !6, line: 808, baseType: !219, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !331, file: !6, line: 809, baseType: !219, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !331, file: !6, line: 813, baseType: !339, size: 64, offset: 128)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !6, line: 810, size: 64, elements: !340)
!340 = !{!341, !346}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !339, file: !6, line: 811, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!122, !117, !129}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !339, file: !6, line: 812, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!122, !117, !129, !131}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gen_instance_pend_throw_obj", scope: !2, file: !3, line: 257, type: !304, isLocal: true, isDefinition: true)
!353 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!354 = !{i32 2, !"Dwarf Version", i32 4}
!355 = !{i32 2, !"Debug Info Version", i32 3}
!356 = !{i32 1, !"wchar_size", i32 4}
!357 = !{i32 7, !"PIC Level", i32 2}
!358 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!359 = distinct !DISubprogram(name: "gen_wrap_call", scope: !3, file: !3, line: 53, type: !151, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !360)
!360 = !{!361, !362, !363, !364, !365, !366, !367, !368, !369}
!361 = !DILocalVariable(name: "self_in", arg: 1, scope: !359, file: !3, line: 53, type: !122)
!362 = !DILocalVariable(name: "n_args", arg: 2, scope: !359, file: !3, line: 53, type: !117)
!363 = !DILocalVariable(name: "n_kw", arg: 3, scope: !359, file: !3, line: 53, type: !117)
!364 = !DILocalVariable(name: "args", arg: 4, scope: !359, file: !3, line: 53, type: !129)
!365 = !DILocalVariable(name: "self", scope: !359, file: !3, line: 54, type: !76)
!366 = !DILocalVariable(name: "self_fun", scope: !359, file: !3, line: 55, type: !233)
!367 = !DILocalVariable(name: "n_state", scope: !359, file: !3, line: 59, type: !117)
!368 = !DILocalVariable(name: "n_exc_stack", scope: !359, file: !3, line: 60, type: !117)
!369 = !DILocalVariable(name: "o", scope: !359, file: !3, line: 63, type: !255)
!370 = !DILocation(line: 53, column: 40, scope: !359)
!371 = !DILocation(line: 53, column: 56, scope: !359)
!372 = !DILocation(line: 53, column: 71, scope: !359)
!373 = !DILocation(line: 53, column: 93, scope: !359)
!374 = !DILocation(line: 54, column: 24, scope: !359)
!375 = !DILocation(line: 55, column: 57, scope: !359)
!376 = !{!377, !379, i64 8}
!377 = !{!"_mp_obj_gen_wrap_t", !378, i64 0, !379, i64 8}
!378 = !{!"_mp_obj_base_t", !379, i64 0}
!379 = !{!"any pointer", !380, i64 0}
!380 = !{!"omnipotent char", !381, i64 0}
!381 = !{!"Simple C/C++ TBAA"}
!382 = !DILocation(line: 55, column: 22, scope: !359)
!383 = !DILocation(line: 59, column: 53, scope: !359)
!384 = !{!379, !379, i64 0}
!385 = !DILocation(line: 59, column: 22, scope: !359)
!386 = !DILocation(line: 59, column: 12, scope: !359)
!387 = !DILocation(line: 60, column: 77, scope: !359)
!388 = !DILocation(line: 60, column: 47, scope: !359)
!389 = !DILocation(line: 60, column: 26, scope: !359)
!390 = !DILocation(line: 60, column: 12, scope: !359)
!391 = !DILocation(line: 63, column: 32, scope: !359)
!392 = !DILocation(line: 63, column: 28, scope: !359)
!393 = !DILocation(line: 65, column: 13, scope: !359)
!394 = !DILocation(line: 65, column: 18, scope: !359)
!395 = !{!396, !379, i64 0}
!396 = !{!"_mp_obj_gen_instance_t", !378, i64 0, !379, i64 8, !397, i64 16}
