; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objgenerator.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objgenerator.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_none_t = type opaque
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!22 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4, isUnsigned: true)
!24 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5, isUnsigned: true)
!25 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6, isUnsigned: true)
!26 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7, isUnsigned: true)
!27 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 32, baseType: !7, size: 32, elements: !72)
!71 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/runtime.h", directory: "")
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "MP_VM_RETURN_NORMAL", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "MP_VM_RETURN_YIELD", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "MP_VM_RETURN_EXCEPTION", value: 2, isUnsigned: true)
!76 = !{!77, !110, !124, !235, !257}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_gen_wrap_t", file: !79, line: 45, baseType: !80)
!79 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objgenerator.c", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_gen_wrap_t", file: !79, line: 42, size: 128, elements: !81)
!81 = !{!82, !234}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !80, file: !79, line: 43, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !6, line: 57, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !91)
!91 = !{!92, !93, !97, !98, !126, !150, !155, !161, !167, !175, !180, !194, !199, !224, !227, !228}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !90, file: !6, line: 476, baseType: !83, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !6, line: 479, baseType: !94, size: 16, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !95, line: 31, baseType: !96)
!95 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !6, line: 482, baseType: !94, size: 16, offset: 80)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !90, file: !6, line: 485, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !124, !125}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !106, line: 53, baseType: !107)
!106 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !106, line: 50, size: 128, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !106, line: 51, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !107, file: !106, line: 52, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !106, line: 48, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !110, !116, !119}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 31, baseType: !121)
!120 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !122, line: 92, baseType: !123)
!122 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !110)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !90, file: !6, line: 488, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!124, !87, !119, !131, !133}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !135, file: !6, line: 366, baseType: !119, size: 1, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !135, file: !6, line: 367, baseType: !119, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !135, file: !6, line: 368, baseType: !119, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !135, file: !6, line: 369, baseType: !119, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !135, file: !6, line: 371, baseType: !119, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !135, file: !6, line: 372, baseType: !119, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !135, file: !6, line: 373, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !146, file: !6, line: 351, baseType: !124, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !146, file: !6, line: 352, baseType: !124, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !90, file: !6, line: 491, baseType: !151, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!124, !124, !119, !119, !131}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !90, file: !6, line: 495, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!124, !160, !124}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !90, file: !6, line: 496, baseType: !162, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!124, !166, !124, !124}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !90, file: !6, line: 509, baseType: !168, size: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !124, !172, !174}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !173, line: 48, baseType: !119)
!173 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !90, file: !6, line: 516, baseType: !176, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!124, !124, !124, !124}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !90, file: !6, line: 521, baseType: !181, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!124, !124, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !187, file: !6, line: 433, baseType: !83, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !187, file: !6, line: 434, baseType: !191, size: 192, offset: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 192, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 3)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !90, file: !6, line: 525, baseType: !195, size: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!124, !124}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !90, file: !6, line: 528, baseType: !200, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !201, file: !6, line: 469, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !124, !213, !221}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !208, line: 69, baseType: !209)
!208 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !210, line: 32, baseType: !211)
!210 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !122, line: 49, baseType: !212)
!212 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !215, file: !6, line: 457, baseType: !110, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !6, line: 458, baseType: !119, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !215, file: !6, line: 459, baseType: !220, size: 32, offset: 128)
!220 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !208, line: 70, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !223, line: 30, baseType: !123)
!223 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!224 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !90, file: !6, line: 531, baseType: !225, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !6, line: 537, baseType: !225, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !90, file: !6, line: 540, baseType: !229, size: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !230, file: !6, line: 776, baseType: !83, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !230, file: !6, line: 777, baseType: !134, size: 192, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !80, file: !79, line: 44, baseType: !174, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !237, line: 42, baseType: !238)
!237 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objfun.h", directory: "")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !237, line: 31, size: 256, elements: !239)
!239 = !{!240, !241, !244, !250, !253}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !238, file: !237, line: 32, baseType: !83, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !238, file: !237, line: 33, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !230)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !238, file: !237, line: 34, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !248, line: 39, baseType: !249)
!248 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!249 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !238, file: !237, line: 35, baseType: !251, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !238, file: !237, line: 41, baseType: !254, offset: 256)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: -1)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_gen_instance_t", file: !79, line: 51, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_gen_instance_t", file: !79, line: 47, size: 448, elements: !260)
!260 = !{!261, !262, !263}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !259, file: !79, line: 48, baseType: !83, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !259, file: !79, line: 49, baseType: !242, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "code_state", scope: !259, file: !79, line: 50, baseType: !264, size: 320, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !265, line: 90, baseType: !266)
!265 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/bc.h", directory: "")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !265, line: 72, size: 320, elements: !267)
!267 = !{!268, !269, !270, !271, !280, !281}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !266, file: !265, line: 77, baseType: !235, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !266, file: !265, line: 78, baseType: !245, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !266, file: !265, line: 79, baseType: !174, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !266, file: !265, line: 81, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !265, line: 70, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !265, line: 63, size: 192, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !274, file: !265, line: 64, baseType: !245, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !274, file: !265, line: 67, baseType: !174, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !274, file: !265, line: 69, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !266, file: !265, line: 82, baseType: !242, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !265, line: 87, baseType: !282, offset: 320)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 0)
!285 = !{!0, !286, !288, !291, !304, !327, !329, !353}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "mp_type_gen_instance", scope: !2, file: !79, line: 270, type: !88, isLocal: false, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "gen_instance_locals_dict", scope: !2, file: !79, line: 268, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "gen_instance_locals_dict_table", scope: !2, file: !79, line: 259, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 512, elements: !302)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !297)
!297 = !{!298, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !296, file: !6, line: 356, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !225)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !6, line: 357, baseType: !299, size: 64, offset: 64)
!302 = !{!303}
!303 = !DISubrange(count: 4)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "gen_instance_close_obj", scope: !2, file: !79, line: 246, type: !306, isLocal: true, isDefinition: true)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !308, file: !6, line: 795, baseType: !83, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !308, file: !6, line: 801, baseType: !312, size: 64, offset: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !308, file: !6, line: 796, size: 64, elements: !313)
!313 = !{!314, !319, !320, !325}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !312, file: !6, line: 797, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!124}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !312, file: !6, line: 798, baseType: !195, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !312, file: !6, line: 799, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!124, !124, !124}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !312, file: !6, line: 800, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !177)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "gen_instance_send_obj", scope: !2, file: !79, line: 209, type: !306, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "gen_instance_throw_obj", scope: !2, file: !79, line: 223, type: !331, isLocal: true, isDefinition: true)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !334)
!334 = !{!335, !336, !338, !339, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !333, file: !6, line: 806, baseType: !83, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !333, file: !6, line: 807, baseType: !337, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!337 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !333, file: !6, line: 808, baseType: !221, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !333, file: !6, line: 809, baseType: !221, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !333, file: !6, line: 813, baseType: !341, size: 64, offset: 128)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !6, line: 810, size: 64, elements: !342)
!342 = !{!343, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !341, file: !6, line: 811, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!124, !119, !131}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !341, file: !6, line: 812, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!124, !119, !131, !133}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "gen_instance_pend_throw_obj", scope: !2, file: !79, line: 257, type: !306, isLocal: true, isDefinition: true)
!355 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!356 = !{i32 2, !"Dwarf Version", i32 4}
!357 = !{i32 2, !"Debug Info Version", i32 3}
!358 = !{i32 1, !"wchar_size", i32 4}
!359 = !{i32 7, !"PIC Level", i32 2}
!360 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!361 = distinct !DISubprogram(name: "gen_wrap_call", scope: !79, file: !79, line: 53, type: !153, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DILocalVariable(name: "self_in", arg: 1, scope: !361, file: !79, line: 53, type: !124)
!364 = !DILocalVariable(name: "n_args", arg: 2, scope: !361, file: !79, line: 53, type: !119)
!365 = !DILocalVariable(name: "n_kw", arg: 3, scope: !361, file: !79, line: 53, type: !119)
!366 = !DILocalVariable(name: "args", arg: 4, scope: !361, file: !79, line: 53, type: !131)
!367 = !DILocalVariable(name: "self", scope: !361, file: !79, line: 54, type: !77)
!368 = !DILocalVariable(name: "self_fun", scope: !361, file: !79, line: 55, type: !235)
!369 = !DILocalVariable(name: "n_state", scope: !361, file: !79, line: 59, type: !119)
!370 = !DILocalVariable(name: "n_exc_stack", scope: !361, file: !79, line: 60, type: !119)
!371 = !DILocalVariable(name: "o", scope: !361, file: !79, line: 63, type: !257)
!372 = !DILocation(line: 53, column: 40, scope: !361)
!373 = !DILocation(line: 53, column: 56, scope: !361)
!374 = !DILocation(line: 53, column: 71, scope: !361)
!375 = !DILocation(line: 53, column: 93, scope: !361)
!376 = !DILocation(line: 54, column: 24, scope: !361)
!377 = !DILocation(line: 55, column: 57, scope: !361)
!378 = !{!379, !381, i64 8}
!379 = !{!"_mp_obj_gen_wrap_t", !380, i64 0, !381, i64 8}
!380 = !{!"_mp_obj_base_t", !381, i64 0}
!381 = !{!"any pointer", !382, i64 0}
!382 = !{!"omnipotent char", !383, i64 0}
!383 = !{!"Simple C/C++ TBAA"}
!384 = !DILocation(line: 55, column: 22, scope: !361)
!385 = !DILocation(line: 59, column: 53, scope: !361)
!386 = !{!381, !381, i64 0}
!387 = !DILocation(line: 59, column: 22, scope: !361)
!388 = !DILocation(line: 59, column: 12, scope: !361)
!389 = !DILocation(line: 60, column: 77, scope: !361)
!390 = !DILocation(line: 60, column: 47, scope: !361)
!391 = !DILocation(line: 60, column: 26, scope: !361)
!392 = !DILocation(line: 60, column: 12, scope: !361)
!393 = !DILocation(line: 63, column: 32, scope: !361)
!394 = !DILocation(line: 63, column: 28, scope: !361)
!395 = !DILocation(line: 65, column: 13, scope: !361)
!396 = !DILocation(line: 65, column: 18, scope: !361)
!397 = !{!398, !381, i64 0}
!398 = !{!"_mp_obj_gen_instance_t", !380, i64 0, !381, i64 8, !399, i64 16}
