; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objint.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objint.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%struct._mp_rom_obj_static_class_method_t = type { %struct._mp_obj_base_t, i8* }
%union.anon = type { i8* (i64, i8**)* }
%struct.compressed_string_t = type { i16, [0 x i8] }

!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !{!305, !312, !314, !320, !321, !316, !322, !459, !464, !357}
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !306, line: 69, baseType: !307)
!306 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !308, line: 32, baseType: !309)
!308 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !310, line: 49, baseType: !311)
!310 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!311 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmt_uint_t", file: !315, line: 176, baseType: !316)
!315 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objint.c", directory: "")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !306, line: 70, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !318, line: 30, baseType: !319)
!318 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!319 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !6, line: 57, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !331)
!331 = !{!332, !333, !337, !338, !361, !385, !390, !396, !402, !409, !414, !428, !433, !449, !452, !453}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !330, file: !6, line: 476, baseType: !323, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !6, line: 479, baseType: !334, size: 16, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !335, line: 31, baseType: !336)
!335 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!336 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !6, line: 482, baseType: !334, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !330, file: !6, line: 485, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !343, !320, !360}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !346, line: 53, baseType: !347)
!346 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !346, line: 50, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !346, line: 51, baseType: !321, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !347, file: !346, line: 52, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !346, line: 48, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !321, !355, !357}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 31, baseType: !359)
!358 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !310, line: 92, baseType: !319)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !330, file: !6, line: 488, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!320, !327, !357, !366, !368}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !370, file: !6, line: 366, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !370, file: !6, line: 367, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !370, file: !6, line: 368, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !370, file: !6, line: 369, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !370, file: !6, line: 371, baseType: !357, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !370, file: !6, line: 372, baseType: !357, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !370, file: !6, line: 373, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !381, file: !6, line: 351, baseType: !320, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !381, file: !6, line: 352, baseType: !320, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !330, file: !6, line: 491, baseType: !386, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!320, !320, !357, !357, !366}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !330, file: !6, line: 495, baseType: !391, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!320, !395, !320}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !330, file: !6, line: 496, baseType: !397, size: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!320, !401, !320, !320}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !330, file: !6, line: 509, baseType: !403, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !320, !407, !408}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !357)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !330, file: !6, line: 516, baseType: !410, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!320, !320, !320, !320}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !330, file: !6, line: 521, baseType: !415, size: 64, offset: 576)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!320, !320, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !421, file: !6, line: 433, baseType: !323, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !421, file: !6, line: 434, baseType: !425, size: 192, offset: 64)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 192, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 3)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !330, file: !6, line: 525, baseType: !429, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!320, !320}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !330, file: !6, line: 528, baseType: !434, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !435, file: !6, line: 469, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!305, !320, !441, !316}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !443, file: !6, line: 457, baseType: !321, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !443, file: !6, line: 458, baseType: !357, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !443, file: !6, line: 459, baseType: !448, size: 32, offset: 128)
!448 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !330, file: !6, line: 531, baseType: !450, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !6, line: 537, baseType: !450, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !330, file: !6, line: 540, baseType: !454, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !455, file: !6, line: 776, baseType: !323, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !455, file: !6, line: 777, baseType: !369, size: 192, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !462, line: 39, baseType: !463)
!462 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!463 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!465 = !{!466, !0, !468, !472, !485, !493, !517}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "mp_type_int", scope: !2, file: !315, line: 533, type: !328, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "int_locals_dict", scope: !2, file: !315, line: 531, type: !470, isLocal: true, isDefinition: true)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !455)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "int_locals_dict_table", scope: !2, file: !315, line: 526, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 256, elements: !483)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !478)
!478 = !{!479, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !477, file: !6, line: 356, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !450)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !477, file: !6, line: 357, baseType: !480, size: 64, offset: 64)
!483 = !{!484}
!484 = !DISubrange(count: 2)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "int_from_bytes_obj", scope: !2, file: !315, line: 491, type: !487, isLocal: true, isDefinition: true)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_static_class_method_t", file: !6, line: 846, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_obj_static_class_method_t", file: !6, line: 843, size: 128, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !489, file: !6, line: 844, baseType: !323, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !489, file: !6, line: 845, baseType: !480, size: 64, offset: 64)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "int_from_bytes_fun_obj", scope: !2, file: !315, line: 490, type: !495, isLocal: true, isDefinition: true)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !498)
!498 = !{!499, !500, !502, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !497, file: !6, line: 806, baseType: !323, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !497, file: !6, line: 807, baseType: !501, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!501 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !497, file: !6, line: 808, baseType: !316, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !497, file: !6, line: 809, baseType: !316, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !497, file: !6, line: 813, baseType: !505, size: 64, offset: 128)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !6, line: 810, size: 64, elements: !506)
!506 = !{!507, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !505, file: !6, line: 811, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!320, !357, !366}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !505, file: !6, line: 812, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!320, !357, !366, !368}
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "int_to_bytes_obj", scope: !2, file: !315, line: 524, type: !495, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 128, elements: !523)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !522, line: 31, baseType: !463)
!522 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!523 = !{!524}
!524 = !DISubrange(count: 16)
!525 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!526 = !{i32 2, !"Dwarf Version", i32 4}
!527 = !{i32 2, !"Debug Info Version", i32 3}
!528 = !{i32 1, !"wchar_size", i32 4}
!529 = !{i32 7, !"PIC Level", i32 2}
!530 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!531 = distinct !DISubprogram(name: "mp_obj_int_print", scope: !315, file: !315, line: 179, type: !341, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !532)
!532 = !{!533, !534, !535, !536, !540, !541, !542, !543}
!533 = !DILocalVariable(name: "print", arg: 1, scope: !531, file: !315, line: 179, type: !343)
!534 = !DILocalVariable(name: "self_in", arg: 2, scope: !531, file: !315, line: 179, type: !320)
!535 = !DILocalVariable(name: "kind", arg: 3, scope: !531, file: !315, line: 179, type: !360)
!536 = !DILocalVariable(name: "stack_buf", scope: !531, file: !315, line: 183, type: !537)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 256, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 32)
!540 = !DILocalVariable(name: "buf", scope: !531, file: !315, line: 184, type: !312)
!541 = !DILocalVariable(name: "buf_size", scope: !531, file: !315, line: 185, type: !357)
!542 = !DILocalVariable(name: "fmt_size", scope: !531, file: !315, line: 186, type: !357)
!543 = !DILocalVariable(name: "str", scope: !531, file: !315, line: 188, type: !312)
!544 = !DILocation(line: 179, column: 41, scope: !531)
!545 = !DILocation(line: 179, column: 57, scope: !531)
!546 = !DILocation(line: 179, column: 82, scope: !531)
!547 = !DILocation(line: 183, column: 5, scope: !531)
!548 = !DILocation(line: 183, column: 10, scope: !531)
!549 = !DILocation(line: 184, column: 5, scope: !531)
!550 = !DILocation(line: 184, column: 11, scope: !531)
!551 = !{!552, !552, i64 0}
!552 = !{!"any pointer", !553, i64 0}
!553 = !{!"omnipotent char", !554, i64 0}
!554 = !{!"Simple C/C++ TBAA"}
!555 = !DILocation(line: 185, column: 5, scope: !531)
!556 = !DILocation(line: 185, column: 12, scope: !531)
!557 = !{!558, !558, i64 0}
!558 = !{!"long", !553, i64 0}
!559 = !DILocation(line: 186, column: 5, scope: !531)
!560 = !DILocation(line: 186, column: 12, scope: !531)
!561 = !DILocation(line: 188, column: 17, scope: !531)
!562 = !DILocation(line: 188, column: 11, scope: !531)
!563 = !DILocation(line: 189, column: 5, scope: !531)
!564 = !DILocation(line: 191, column: 9, scope: !565)
!565 = distinct !DILexicalBlock(scope: !531, file: !315, line: 191, column: 9)
!566 = !DILocation(line: 191, column: 13, scope: !565)
!567 = !DILocation(line: 191, column: 9, scope: !531)
!568 = !DILocation(line: 192, column: 9, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !315, line: 191, column: 27)
!570 = !DILocation(line: 193, column: 5, scope: !569)
!571 = !DILocation(line: 194, column: 1, scope: !531)
!572 = distinct !DISubprogram(name: "mp_obj_int_formatted", scope: !315, file: !315, line: 224, type: !573, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !577)
!573 = !DISubroutineType(types: !574)
!574 = !{!312, !575, !576, !576, !481, !448, !355, !313, !313}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !588, !589, !590, !591, !592, !593, !597, !600}
!578 = !DILocalVariable(name: "buf", arg: 1, scope: !572, file: !315, line: 224, type: !575)
!579 = !DILocalVariable(name: "buf_size", arg: 2, scope: !572, file: !315, line: 224, type: !576)
!580 = !DILocalVariable(name: "fmt_size", arg: 3, scope: !572, file: !315, line: 224, type: !576)
!581 = !DILocalVariable(name: "self_in", arg: 4, scope: !572, file: !315, line: 224, type: !481)
!582 = !DILocalVariable(name: "base", arg: 5, scope: !572, file: !315, line: 225, type: !448)
!583 = !DILocalVariable(name: "prefix", arg: 6, scope: !572, file: !315, line: 225, type: !355)
!584 = !DILocalVariable(name: "base_char", arg: 7, scope: !572, file: !315, line: 225, type: !313)
!585 = !DILocalVariable(name: "comma", arg: 8, scope: !572, file: !315, line: 225, type: !313)
!586 = !DILocalVariable(name: "num", scope: !572, file: !315, line: 226, type: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "fmt_int_t", file: !315, line: 175, baseType: !305)
!588 = !DILocalVariable(name: "sign", scope: !572, file: !315, line: 248, type: !313)
!589 = !DILocalVariable(name: "needed_size", scope: !572, file: !315, line: 254, type: !357)
!590 = !DILocalVariable(name: "str", scope: !572, file: !315, line: 259, type: !312)
!591 = !DILocalVariable(name: "b", scope: !572, file: !315, line: 261, type: !312)
!592 = !DILocalVariable(name: "last_comma", scope: !572, file: !315, line: 263, type: !312)
!593 = !DILocalVariable(name: "c", scope: !594, file: !315, line: 270, type: !448)
!594 = distinct !DILexicalBlock(scope: !595, file: !315, line: 268, column: 12)
!595 = distinct !DILexicalBlock(scope: !596, file: !315, line: 267, column: 12)
!596 = distinct !DILexicalBlock(scope: !572, file: !315, line: 265, column: 9)
!597 = !DILocalVariable(name: "prefix_len", scope: !598, file: !315, line: 286, type: !357)
!598 = distinct !DILexicalBlock(scope: !599, file: !315, line: 285, column: 17)
!599 = distinct !DILexicalBlock(scope: !572, file: !315, line: 285, column: 9)
!600 = !DILocalVariable(name: "p", scope: !598, file: !315, line: 287, type: !312)
!601 = !DILocation(line: 224, column: 35, scope: !572)
!602 = !DILocation(line: 224, column: 48, scope: !572)
!603 = !DILocation(line: 224, column: 66, scope: !572)
!604 = !DILocation(line: 224, column: 91, scope: !572)
!605 = !DILocation(line: 225, column: 32, scope: !572)
!606 = !DILocation(line: 225, column: 50, scope: !572)
!607 = !DILocation(line: 225, column: 63, scope: !572)
!608 = !DILocation(line: 225, column: 79, scope: !572)
!609 = !DILocation(line: 229, column: 11, scope: !572)
!610 = !DILocation(line: 226, column: 15, scope: !572)
!611 = !DILocation(line: 248, column: 10, scope: !572)
!612 = !DILocation(line: 249, column: 13, scope: !613)
!613 = distinct !DILexicalBlock(scope: !572, file: !315, line: 249, column: 9)
!614 = !DILocation(line: 250, column: 15, scope: !615)
!615 = distinct !DILexicalBlock(scope: !613, file: !315, line: 249, column: 18)
!616 = !DILocation(line: 249, column: 9, scope: !572)
!617 = !DILocation(line: 254, column: 26, scope: !572)
!618 = !DILocation(line: 254, column: 12, scope: !572)
!619 = !DILocation(line: 255, column: 23, scope: !620)
!620 = distinct !DILexicalBlock(scope: !572, file: !315, line: 255, column: 9)
!621 = !DILocation(line: 255, column: 21, scope: !620)
!622 = !DILocation(line: 255, column: 9, scope: !572)
!623 = !DILocation(line: 256, column: 16, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !315, line: 255, column: 34)
!625 = !DILocation(line: 256, column: 14, scope: !624)
!626 = !DILocation(line: 257, column: 19, scope: !624)
!627 = !DILocation(line: 258, column: 5, scope: !624)
!628 = !DILocation(line: 259, column: 17, scope: !572)
!629 = !DILocation(line: 259, column: 11, scope: !572)
!630 = !DILocation(line: 261, column: 19, scope: !572)
!631 = !DILocation(line: 261, column: 11, scope: !572)
!632 = !DILocation(line: 262, column: 7, scope: !572)
!633 = !DILocation(line: 262, column: 12, scope: !572)
!634 = !{!553, !553, i64 0}
!635 = !DILocation(line: 263, column: 11, scope: !572)
!636 = !DILocation(line: 265, column: 13, scope: !596)
!637 = !DILocation(line: 265, column: 9, scope: !572)
!638 = !DILocation(line: 0, scope: !594)
!639 = !DILocation(line: 0, scope: !640)
!640 = distinct !DILexicalBlock(scope: !594, file: !315, line: 278, column: 17)
!641 = !DILocation(line: 270, column: 39, scope: !594)
!642 = !DILocation(line: 266, column: 11, scope: !643)
!643 = distinct !DILexicalBlock(scope: !596, file: !315, line: 265, column: 19)
!644 = !DILocation(line: 266, column: 16, scope: !643)
!645 = !DILocation(line: 267, column: 5, scope: !643)
!646 = !DILocation(line: 0, scope: !572)
!647 = !DILocation(line: 270, column: 37, scope: !594)
!648 = !DILocation(line: 270, column: 21, scope: !594)
!649 = !DILocation(line: 270, column: 17, scope: !594)
!650 = !DILocation(line: 271, column: 35, scope: !594)
!651 = !DILocation(line: 272, column: 19, scope: !652)
!652 = distinct !DILexicalBlock(scope: !594, file: !315, line: 272, column: 17)
!653 = !DILocation(line: 272, column: 17, scope: !594)
!654 = !DILocation(line: 0, scope: !652)
!655 = !DILocation(line: 277, column: 22, scope: !594)
!656 = !DILocation(line: 277, column: 15, scope: !594)
!657 = !DILocation(line: 277, column: 20, scope: !594)
!658 = !DILocation(line: 278, column: 30, scope: !640)
!659 = !DILocation(line: 278, column: 23, scope: !640)
!660 = !DILocation(line: 278, column: 40, scope: !640)
!661 = !DILocation(line: 278, column: 61, scope: !640)
!662 = !DILocation(line: 278, column: 66, scope: !640)
!663 = !DILocation(line: 278, column: 17, scope: !594)
!664 = !DILocation(line: 279, column: 19, scope: !665)
!665 = distinct !DILexicalBlock(scope: !640, file: !315, line: 278, column: 72)
!666 = !DILocation(line: 279, column: 24, scope: !665)
!667 = !DILocation(line: 281, column: 13, scope: !665)
!668 = !DILocation(line: 283, column: 18, scope: !595)
!669 = !DILocation(line: 283, column: 24, scope: !595)
!670 = !DILocation(line: 282, column: 9, scope: !594)
!671 = distinct !{!671, !672, !673}
!672 = !DILocation(line: 268, column: 9, scope: !595)
!673 = !DILocation(line: 283, column: 35, scope: !595)
!674 = !DILocation(line: 0, scope: !596)
!675 = !DILocation(line: 285, column: 9, scope: !599)
!676 = !DILocation(line: 285, column: 9, scope: !572)
!677 = !DILocation(line: 286, column: 29, scope: !598)
!678 = !DILocation(line: 286, column: 16, scope: !598)
!679 = !DILocation(line: 287, column: 21, scope: !598)
!680 = !DILocation(line: 287, column: 15, scope: !598)
!681 = !DILocation(line: 288, column: 15, scope: !682)
!682 = distinct !DILexicalBlock(scope: !598, file: !315, line: 288, column: 13)
!683 = !DILocation(line: 288, column: 13, scope: !598)
!684 = !DILocation(line: 290, column: 20, scope: !685)
!685 = distinct !DILexicalBlock(scope: !682, file: !315, line: 288, column: 22)
!686 = !DILocation(line: 290, column: 13, scope: !685)
!687 = !DILocation(line: 291, column: 31, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !315, line: 290, column: 29)
!689 = !DILocation(line: 291, column: 19, scope: !688)
!690 = !DILocation(line: 291, column: 22, scope: !688)
!691 = distinct !{!691, !686, !692}
!692 = !DILocation(line: 292, column: 13, scope: !685)
!693 = !DILocation(line: 295, column: 19, scope: !694)
!694 = distinct !DILexicalBlock(scope: !572, file: !315, line: 295, column: 9)
!695 = !DILocation(line: 295, column: 14, scope: !694)
!696 = !DILocation(line: 296, column: 11, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !315, line: 295, column: 26)
!698 = !DILocation(line: 296, column: 16, scope: !697)
!699 = !DILocation(line: 297, column: 5, scope: !697)
!700 = !DILocation(line: 298, column: 17, scope: !572)
!701 = !DILocation(line: 298, column: 22, scope: !572)
!702 = !DILocation(line: 298, column: 36, scope: !572)
!703 = !DILocation(line: 298, column: 40, scope: !572)
!704 = !DILocation(line: 298, column: 15, scope: !572)
!705 = !DILocation(line: 300, column: 5, scope: !572)
!706 = distinct !DISubprogram(name: "mp_int_format_size", scope: !315, file: !315, line: 209, type: !707, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!357, !357, !448, !355, !313}
!709 = !{!710, !711, !712, !713, !714, !715, !716}
!710 = !DILocalVariable(name: "num_bits", arg: 1, scope: !706, file: !315, line: 209, type: !357)
!711 = !DILocalVariable(name: "base", arg: 2, scope: !706, file: !315, line: 209, type: !448)
!712 = !DILocalVariable(name: "prefix", arg: 3, scope: !706, file: !315, line: 209, type: !355)
!713 = !DILocalVariable(name: "comma", arg: 4, scope: !706, file: !315, line: 209, type: !313)
!714 = !DILocalVariable(name: "num_digits", scope: !706, file: !315, line: 211, type: !357)
!715 = !DILocalVariable(name: "num_commas", scope: !706, file: !315, line: 212, type: !357)
!716 = !DILocalVariable(name: "prefix_len", scope: !706, file: !315, line: 213, type: !357)
!717 = !DILocation(line: 209, column: 34, scope: !706)
!718 = !DILocation(line: 209, column: 48, scope: !706)
!719 = !DILocation(line: 209, column: 66, scope: !706)
!720 = !DILocation(line: 209, column: 79, scope: !706)
!721 = !DILocation(line: 211, column: 57, scope: !706)
!722 = !DILocation(line: 211, column: 36, scope: !706)
!723 = !DILocation(line: 211, column: 34, scope: !706)
!724 = !DILocation(line: 211, column: 62, scope: !706)
!725 = !DILocation(line: 211, column: 12, scope: !706)
!726 = !DILocation(line: 212, column: 25, scope: !706)
!727 = !DILocation(line: 212, column: 12, scope: !706)
!728 = !DILocation(line: 213, column: 25, scope: !706)
!729 = !DILocation(line: 213, column: 34, scope: !706)
!730 = !DILocation(line: 213, column: 12, scope: !706)
!731 = !DILocation(line: 214, column: 23, scope: !706)
!732 = !DILocation(line: 214, column: 36, scope: !706)
!733 = !DILocation(line: 214, column: 49, scope: !706)
!734 = !DILocation(line: 214, column: 5, scope: !706)
!735 = distinct !DISubprogram(name: "mp_small_int_buffer_overflow_check", scope: !315, file: !315, line: 339, type: !736, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !305, !357, !501}
!738 = !{!739, !740, !741, !742, !747}
!739 = !DILocalVariable(name: "val", arg: 1, scope: !735, file: !315, line: 339, type: !305)
!740 = !DILocalVariable(name: "nbytes", arg: 2, scope: !735, file: !315, line: 339, type: !357)
!741 = !DILocalVariable(name: "is_signed", arg: 3, scope: !735, file: !315, line: 339, type: !501)
!742 = !DILocalVariable(name: "edge", scope: !743, file: !315, line: 355, type: !305)
!743 = distinct !DILexicalBlock(scope: !744, file: !315, line: 354, column: 24)
!744 = distinct !DILexicalBlock(scope: !745, file: !315, line: 354, column: 13)
!745 = distinct !DILexicalBlock(scope: !746, file: !315, line: 346, column: 32)
!746 = distinct !DILexicalBlock(scope: !735, file: !315, line: 346, column: 9)
!747 = !DILocalVariable(name: "edge", scope: !748, file: !315, line: 362, type: !305)
!748 = distinct !DILexicalBlock(scope: !744, file: !315, line: 360, column: 16)
!749 = !DILocation(line: 339, column: 50, scope: !735)
!750 = !DILocation(line: 339, column: 62, scope: !735)
!751 = !DILocation(line: 341, column: 13, scope: !752)
!752 = distinct !DILexicalBlock(scope: !735, file: !315, line: 341, column: 9)
!753 = !DILocation(line: 341, column: 9, scope: !735)
!754 = !DILocation(line: 346, column: 26, scope: !746)
!755 = !DILocation(line: 346, column: 19, scope: !746)
!756 = !DILocation(line: 348, column: 20, scope: !757)
!757 = distinct !DILexicalBlock(scope: !745, file: !315, line: 348, column: 13)
!758 = !DILocation(line: 348, column: 13, scope: !745)
!759 = !DILocation(line: 0, scope: !744)
!760 = !DILocation(line: 354, column: 13, scope: !745)
!761 = !DILocation(line: 355, column: 57, scope: !743)
!762 = !DILocation(line: 355, column: 42, scope: !743)
!763 = !DILocation(line: 355, column: 22, scope: !743)
!764 = !DILocation(line: 356, column: 17, scope: !765)
!765 = distinct !DILexicalBlock(scope: !743, file: !315, line: 356, column: 17)
!766 = !DILocation(line: 356, column: 23, scope: !765)
!767 = !DILocation(line: 356, column: 37, scope: !765)
!768 = !DILocation(line: 356, column: 30, scope: !765)
!769 = !DILocation(line: 362, column: 42, scope: !748)
!770 = !DILocation(line: 362, column: 22, scope: !748)
!771 = !DILocation(line: 363, column: 21, scope: !772)
!772 = distinct !DILexicalBlock(scope: !748, file: !315, line: 363, column: 17)
!773 = !DILocation(line: 370, column: 33, scope: !735)
!774 = !DILocation(line: 370, column: 5, scope: !735)
!775 = !DILocation(line: 371, column: 1, scope: !735)
!776 = distinct !DISubprogram(name: "mp_obj_int_sign", scope: !315, file: !315, line: 375, type: !777, scopeLine: 375, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!448, !320}
!779 = !{!780, !781}
!780 = !DILocalVariable(name: "self_in", arg: 1, scope: !776, file: !315, line: 375, type: !320)
!781 = !DILocalVariable(name: "val", scope: !776, file: !315, line: 376, type: !305)
!782 = !DILocation(line: 375, column: 30, scope: !776)
!783 = !DILocation(line: 376, column: 20, scope: !776)
!784 = !DILocation(line: 376, column: 14, scope: !776)
!785 = !DILocation(line: 377, column: 13, scope: !786)
!786 = distinct !DILexicalBlock(scope: !776, file: !315, line: 377, column: 9)
!787 = !DILocation(line: 377, column: 9, scope: !776)
!788 = !DILocation(line: 384, column: 1, scope: !776)
!789 = distinct !DISubprogram(name: "mp_obj_int_unary_op", scope: !315, file: !315, line: 387, type: !393, scopeLine: 387, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!790 = !{!791, !792}
!791 = !DILocalVariable(name: "op", arg: 1, scope: !789, file: !315, line: 387, type: !395)
!792 = !DILocalVariable(name: "o_in", arg: 2, scope: !789, file: !315, line: 387, type: !320)
!793 = !DILocation(line: 387, column: 44, scope: !789)
!794 = !DILocation(line: 387, column: 57, scope: !789)
!795 = !DILocation(line: 388, column: 5, scope: !789)
!796 = distinct !DISubprogram(name: "mp_obj_int_binary_op", scope: !315, file: !315, line: 392, type: !399, scopeLine: 392, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!797 = !{!798, !799, !800}
!798 = !DILocalVariable(name: "op", arg: 1, scope: !796, file: !315, line: 392, type: !401)
!799 = !DILocalVariable(name: "lhs_in", arg: 2, scope: !796, file: !315, line: 392, type: !320)
!800 = !DILocalVariable(name: "rhs_in", arg: 3, scope: !796, file: !315, line: 392, type: !320)
!801 = !DILocation(line: 392, column: 46, scope: !796)
!802 = !DILocation(line: 392, column: 59, scope: !796)
!803 = !DILocation(line: 392, column: 76, scope: !796)
!804 = !DILocation(line: 393, column: 12, scope: !796)
!805 = !DILocation(line: 393, column: 5, scope: !796)
!806 = distinct !DISubprogram(name: "mp_obj_int_binary_op_extra_cases", scope: !315, file: !315, line: 444, type: !399, scopeLine: 444, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!807 = !{!808, !809, !810}
!808 = !DILocalVariable(name: "op", arg: 1, scope: !806, file: !315, line: 444, type: !401)
!809 = !DILocalVariable(name: "lhs_in", arg: 2, scope: !806, file: !315, line: 444, type: !320)
!810 = !DILocalVariable(name: "rhs_in", arg: 3, scope: !806, file: !315, line: 444, type: !320)
!811 = !DILocation(line: 444, column: 58, scope: !806)
!812 = !DILocation(line: 444, column: 71, scope: !806)
!813 = !DILocation(line: 444, column: 88, scope: !806)
!814 = !DILocation(line: 445, column: 16, scope: !815)
!815 = distinct !DILexicalBlock(scope: !806, file: !315, line: 445, column: 9)
!816 = !DILocation(line: 445, column: 9, scope: !806)
!817 = !DILocation(line: 447, column: 16, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !315, line: 445, column: 35)
!819 = !DILocation(line: 447, column: 9, scope: !818)
!820 = !DILocation(line: 448, column: 23, scope: !821)
!821 = distinct !DILexicalBlock(scope: !815, file: !315, line: 448, column: 16)
!822 = !DILocation(line: 448, column: 16, scope: !815)
!823 = !DILocation(line: 450, column: 16, scope: !824)
!824 = distinct !DILexicalBlock(scope: !821, file: !315, line: 448, column: 41)
!825 = !DILocation(line: 450, column: 9, scope: !824)
!826 = !DILocation(line: 451, column: 19, scope: !827)
!827 = distinct !DILexicalBlock(scope: !821, file: !315, line: 451, column: 16)
!828 = !DILocation(line: 451, column: 16, scope: !821)
!829 = !DILocation(line: 452, column: 13, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !315, line: 452, column: 13)
!831 = distinct !DILexicalBlock(scope: !827, file: !315, line: 451, column: 45)
!832 = !{!833, !552, i64 0}
!833 = !{!"_mp_obj_base_t", !552, i64 0}
!834 = !{!835, !552, i64 48}
!835 = !{!"_mp_obj_type_t", !833, i64 0, !836, i64 8, !836, i64 10, !552, i64 16, !552, i64 24, !552, i64 32, !552, i64 40, !552, i64 48, !552, i64 56, !552, i64 64, !552, i64 72, !552, i64 80, !837, i64 88, !552, i64 96, !552, i64 104, !552, i64 112}
!836 = !{!"short", !553, i64 0}
!837 = !{!"_mp_buffer_p_t", !552, i64 0}
!838 = !DILocation(line: 452, column: 44, scope: !830)
!839 = !DILocation(line: 452, column: 47, scope: !830)
!840 = !DILocation(line: 452, column: 86, scope: !830)
!841 = !DILocation(line: 452, column: 89, scope: !830)
!842 = !DILocation(line: 452, column: 13, scope: !831)
!843 = !DILocation(line: 454, column: 20, scope: !844)
!844 = distinct !DILexicalBlock(scope: !830, file: !315, line: 452, column: 128)
!845 = !DILocation(line: 454, column: 13, scope: !844)
!846 = !DILocation(line: 0, scope: !806)
!847 = !DILocation(line: 458, column: 1, scope: !806)
!848 = distinct !DISubprogram(name: "mp_obj_new_int_from_str_len", scope: !315, file: !315, line: 397, type: !849, scopeLine: 397, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !852)
!849 = !DISubroutineType(types: !850)
!850 = !{!320, !851, !357, !501, !7}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!852 = !{!853, !854, !855, !856}
!853 = !DILocalVariable(name: "str", arg: 1, scope: !848, file: !315, line: 397, type: !851)
!854 = !DILocalVariable(name: "len", arg: 2, scope: !848, file: !315, line: 397, type: !357)
!855 = !DILocalVariable(name: "neg", arg: 3, scope: !848, file: !315, line: 397, type: !501)
!856 = !DILocalVariable(name: "base", arg: 4, scope: !848, file: !315, line: 397, type: !7)
!857 = !DILocation(line: 397, column: 51, scope: !848)
!858 = !DILocation(line: 397, column: 63, scope: !848)
!859 = !DILocation(line: 397, column: 73, scope: !848)
!860 = !DILocation(line: 397, column: 91, scope: !848)
!861 = !DILocation(line: 398, column: 42, scope: !848)
!862 = !DILocation(line: 398, column: 5, scope: !848)
!863 = distinct !DISubprogram(name: "mp_obj_new_int_from_ll", scope: !315, file: !315, line: 403, type: !864, scopeLine: 403, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !867)
!864 = !DISubroutineType(types: !865)
!865 = !{!320, !866}
!866 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!867 = !{!868}
!868 = !DILocalVariable(name: "val", arg: 1, scope: !863, file: !315, line: 403, type: !866)
!869 = !DILocation(line: 403, column: 43, scope: !863)
!870 = !DILocation(line: 404, column: 42, scope: !863)
!871 = !DILocation(line: 404, column: 5, scope: !863)
!872 = distinct !DISubprogram(name: "mp_obj_new_int_from_ull", scope: !315, file: !315, line: 409, type: !873, scopeLine: 409, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !876)
!873 = !DISubroutineType(types: !874)
!874 = !{!320, !875}
!875 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!876 = !{!877}
!877 = !DILocalVariable(name: "val", arg: 1, scope: !872, file: !315, line: 409, type: !875)
!878 = !DILocation(line: 409, column: 53, scope: !872)
!879 = !DILocation(line: 410, column: 42, scope: !872)
!880 = !DILocation(line: 410, column: 5, scope: !872)
!881 = distinct !DISubprogram(name: "mp_obj_new_int_from_uint", scope: !315, file: !315, line: 414, type: !882, scopeLine: 414, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!320, !316}
!884 = !{!885}
!885 = !DILocalVariable(name: "value", arg: 1, scope: !881, file: !315, line: 414, type: !316)
!886 = !DILocation(line: 414, column: 45, scope: !881)
!887 = !DILocation(line: 417, column: 47, scope: !888)
!888 = distinct !DILexicalBlock(scope: !881, file: !315, line: 417, column: 9)
!889 = !DILocation(line: 417, column: 9, scope: !881)
!890 = !DILocation(line: 418, column: 16, scope: !891)
!891 = distinct !DILexicalBlock(scope: !888, file: !315, line: 417, column: 53)
!892 = !DILocation(line: 418, column: 9, scope: !891)
!893 = !DILocation(line: 420, column: 42, scope: !881)
!894 = !DILocation(line: 420, column: 5, scope: !881)
!895 = distinct !DISubprogram(name: "mp_obj_new_int", scope: !315, file: !315, line: 424, type: !896, scopeLine: 424, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !898)
!896 = !DISubroutineType(types: !897)
!897 = !{!320, !305}
!898 = !{!899}
!899 = !DILocalVariable(name: "value", arg: 1, scope: !895, file: !315, line: 424, type: !305)
!900 = !DILocation(line: 424, column: 34, scope: !895)
!901 = !DILocation(line: 425, column: 9, scope: !902)
!902 = distinct !DILexicalBlock(scope: !895, file: !315, line: 425, column: 9)
!903 = !DILocation(line: 425, column: 9, scope: !895)
!904 = !DILocation(line: 426, column: 16, scope: !905)
!905 = distinct !DILexicalBlock(scope: !902, file: !315, line: 425, column: 35)
!906 = !DILocation(line: 426, column: 9, scope: !905)
!907 = !DILocation(line: 428, column: 42, scope: !895)
!908 = !DILocation(line: 428, column: 5, scope: !895)
!909 = distinct !DISubprogram(name: "mp_obj_int_get_truncated", scope: !315, file: !315, line: 432, type: !910, scopeLine: 432, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!305, !481}
!912 = !{!913}
!913 = !DILocalVariable(name: "self_in", arg: 1, scope: !909, file: !315, line: 432, type: !481)
!914 = !DILocation(line: 432, column: 50, scope: !909)
!915 = !DILocation(line: 433, column: 12, scope: !909)
!916 = !DILocation(line: 433, column: 5, scope: !909)
!917 = distinct !DISubprogram(name: "mp_obj_int_get_checked", scope: !315, file: !315, line: 436, type: !910, scopeLine: 436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !918)
!918 = !{!919}
!919 = !DILocalVariable(name: "self_in", arg: 1, scope: !917, file: !315, line: 436, type: !481)
!920 = !DILocation(line: 436, column: 48, scope: !917)
!921 = !DILocation(line: 437, column: 12, scope: !917)
!922 = !DILocation(line: 437, column: 5, scope: !917)
!923 = distinct !DISubprogram(name: "MP_OBJ_IS_QSTR", scope: !6, file: !6, line: 93, type: !924, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{!501, !481}
!926 = !{!927}
!927 = !DILocalVariable(name: "o", arg: 1, scope: !923, file: !6, line: 93, type: !481)
!928 = !DILocation(line: 93, column: 50, scope: !923)
!929 = !DILocation(line: 94, column: 17, scope: !923)
!930 = !DILocation(line: 94, column: 32, scope: !923)
!931 = !DILocation(line: 94, column: 37, scope: !923)
!932 = !DILocation(line: 94, column: 7, scope: !923)
!933 = distinct !DISubprogram(name: "MP_OBJ_IS_OBJ", scope: !6, file: !6, line: 109, type: !924, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !934)
!934 = !{!935}
!935 = !DILocalVariable(name: "o", arg: 1, scope: !933, file: !6, line: 109, type: !481)
!936 = !DILocation(line: 109, column: 49, scope: !933)
!937 = !DILocation(line: 110, column: 17, scope: !933)
!938 = !DILocation(line: 110, column: 32, scope: !933)
!939 = !DILocation(line: 110, column: 37, scope: !933)
!940 = !DILocation(line: 110, column: 7, scope: !933)
!941 = distinct !DISubprogram(name: "mp_obj_int_make_new", scope: !315, file: !315, line: 45, type: !364, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !942)
!942 = !{!943, !944, !945, !946, !947, !952, !953, !955}
!943 = !DILocalVariable(name: "type_in", arg: 1, scope: !941, file: !315, line: 45, type: !327)
!944 = !DILocalVariable(name: "n_args", arg: 2, scope: !941, file: !315, line: 45, type: !357)
!945 = !DILocalVariable(name: "args", arg: 3, scope: !941, file: !315, line: 45, type: !366)
!946 = !DILocalVariable(name: "kw_args", arg: 4, scope: !941, file: !315, line: 45, type: !368)
!947 = !DILocalVariable(name: "l", scope: !948, file: !315, line: 59, type: !357)
!948 = distinct !DILexicalBlock(scope: !949, file: !315, line: 57, column: 57)
!949 = distinct !DILexicalBlock(scope: !950, file: !315, line: 57, column: 24)
!950 = distinct !DILexicalBlock(scope: !951, file: !315, line: 54, column: 17)
!951 = distinct !DILexicalBlock(scope: !941, file: !315, line: 49, column: 21)
!952 = !DILocalVariable(name: "s", scope: !948, file: !315, line: 60, type: !355)
!953 = !DILocalVariable(name: "l", scope: !954, file: !315, line: 75, type: !357)
!954 = distinct !DILexicalBlock(scope: !951, file: !315, line: 72, column: 18)
!955 = !DILocalVariable(name: "s", scope: !954, file: !315, line: 76, type: !355)
!956 = !DILocation(line: 45, column: 58, scope: !941)
!957 = !DILocation(line: 45, column: 74, scope: !941)
!958 = !DILocation(line: 45, column: 98, scope: !941)
!959 = !DILocation(line: 45, column: 114, scope: !941)
!960 = !DILocation(line: 47, column: 5, scope: !941)
!961 = !DILocation(line: 49, column: 5, scope: !941)
!962 = !DILocation(line: 54, column: 17, scope: !950)
!963 = !DILocation(line: 54, column: 17, scope: !951)
!964 = !DILocation(line: 57, column: 24, scope: !949)
!965 = !DILocation(line: 57, column: 24, scope: !950)
!966 = !DILocation(line: 59, column: 17, scope: !948)
!967 = !DILocation(line: 59, column: 24, scope: !948)
!968 = !DILocation(line: 60, column: 33, scope: !948)
!969 = !DILocation(line: 60, column: 29, scope: !948)
!970 = !DILocation(line: 61, column: 48, scope: !948)
!971 = !DILocation(line: 61, column: 24, scope: !948)
!972 = !DILocation(line: 66, column: 13, scope: !949)
!973 = !DILocation(line: 68, column: 24, scope: !974)
!974 = distinct !DILexicalBlock(scope: !949, file: !315, line: 66, column: 20)
!975 = !DILocation(line: 68, column: 17, scope: !974)
!976 = !DILocation(line: 75, column: 13, scope: !954)
!977 = !DILocation(line: 76, column: 49, scope: !954)
!978 = !DILocation(line: 75, column: 20, scope: !954)
!979 = !DILocation(line: 76, column: 29, scope: !954)
!980 = !DILocation(line: 76, column: 25, scope: !954)
!981 = !DILocation(line: 77, column: 44, scope: !954)
!982 = !DILocation(line: 77, column: 62, scope: !954)
!983 = !DILocation(line: 77, column: 47, scope: !954)
!984 = !DILocation(line: 77, column: 20, scope: !954)
!985 = !DILocation(line: 78, column: 9, scope: !951)
!986 = !DILocation(line: 0, scope: !951)
!987 = !DILocation(line: 80, column: 1, scope: !941)
!988 = distinct !DISubprogram(name: "MP_OBJ_IS_SMALL_INT", scope: !6, file: !6, line: 88, type: !924, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !989)
!989 = !{!990}
!990 = !DILocalVariable(name: "o", arg: 1, scope: !988, file: !6, line: 88, type: !481)
!991 = !DILocation(line: 88, column: 55, scope: !988)
!992 = !DILocation(line: 89, column: 17, scope: !988)
!993 = !DILocation(line: 89, column: 32, scope: !988)
!994 = !DILocation(line: 89, column: 37, scope: !988)
!995 = !DILocation(line: 89, column: 7, scope: !988)
!996 = distinct !DISubprogram(name: "int_from_bytes", scope: !315, file: !315, line: 461, type: !510, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004}
!998 = !DILocalVariable(name: "n_args", arg: 1, scope: !996, file: !315, line: 461, type: !357)
!999 = !DILocalVariable(name: "args", arg: 2, scope: !996, file: !315, line: 461, type: !366)
!1000 = !DILocalVariable(name: "bufinfo", scope: !996, file: !315, line: 466, type: !442)
!1001 = !DILocalVariable(name: "buf", scope: !996, file: !315, line: 469, type: !459)
!1002 = !DILocalVariable(name: "delta", scope: !996, file: !315, line: 470, type: !448)
!1003 = !DILocalVariable(name: "value", scope: !996, file: !315, line: 476, type: !316)
!1004 = !DILocalVariable(name: "len", scope: !996, file: !315, line: 477, type: !357)
!1005 = !DILocation(line: 461, column: 39, scope: !996)
!1006 = !DILocation(line: 461, column: 63, scope: !996)
!1007 = !DILocation(line: 466, column: 5, scope: !996)
!1008 = !DILocation(line: 467, column: 25, scope: !996)
!1009 = !DILocation(line: 466, column: 22, scope: !996)
!1010 = !DILocation(line: 467, column: 5, scope: !996)
!1011 = !DILocation(line: 469, column: 44, scope: !996)
!1012 = !{!1013, !552, i64 0}
!1013 = !{!"_mp_buffer_info_t", !552, i64 0, !558, i64 8, !1014, i64 16}
!1014 = !{!"int", !553, i64 0}
!1015 = !DILocation(line: 469, column: 17, scope: !996)
!1016 = !DILocation(line: 470, column: 9, scope: !996)
!1017 = !DILocation(line: 471, column: 9, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !996, file: !315, line: 471, column: 9)
!1019 = !DILocation(line: 471, column: 17, scope: !1018)
!1020 = !DILocation(line: 471, column: 9, scope: !996)
!1021 = !DILocation(line: 476, column: 15, scope: !996)
!1022 = !DILocation(line: 477, column: 12, scope: !996)
!1023 = !DILocation(line: 478, column: 5, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !996, file: !315, line: 478, column: 5)
!1025 = !DILocation(line: 478, column: 15, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1024, file: !315, line: 478, column: 5)
!1027 = !DILocation(line: 485, column: 24, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1026, file: !315, line: 478, column: 33)
!1029 = !DILocation(line: 485, column: 32, scope: !1028)
!1030 = !DILocation(line: 485, column: 30, scope: !1028)
!1031 = !DILocation(line: 478, column: 23, scope: !1026)
!1032 = distinct !{!1032, !1023, !1033}
!1033 = !DILocation(line: 486, column: 5, scope: !1024)
!1034 = !DILocation(line: 0, scope: !996)
!1035 = !DILocation(line: 487, column: 12, scope: !996)
!1036 = !DILocation(line: 488, column: 1, scope: !996)
!1037 = !DILocation(line: 487, column: 5, scope: !996)
!1038 = distinct !DISubprogram(name: "int_to_bytes", scope: !315, file: !315, line: 493, type: !510, scopeLine: 493, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1052, !1053, !1055}
!1040 = !DILocalVariable(name: "n_args", arg: 1, scope: !1038, file: !315, line: 493, type: !357)
!1041 = !DILocalVariable(name: "args", arg: 2, scope: !1038, file: !315, line: 493, type: !366)
!1042 = !DILocalVariable(name: "len", scope: !1038, file: !315, line: 497, type: !305)
!1043 = !DILocalVariable(name: "big_endian", scope: !1038, file: !315, line: 501, type: !501)
!1044 = !DILocalVariable(name: "vstr", scope: !1038, file: !315, line: 503, type: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !462, line: 165, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !462, line: 160, size: 256, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1046, file: !462, line: 161, baseType: !357, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1046, file: !462, line: 162, baseType: !357, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1046, file: !462, line: 163, baseType: !312, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !1046, file: !462, line: 164, baseType: !501, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1052 = !DILocalVariable(name: "data", scope: !1038, file: !315, line: 505, type: !464)
!1053 = !DILocalVariable(name: "val", scope: !1054, file: !315, line: 515, type: !305)
!1054 = distinct !DILexicalBlock(scope: !1038, file: !315, line: 514, column: 5)
!1055 = !DILocalVariable(name: "l", scope: !1054, file: !315, line: 518, type: !357)
!1056 = !DILocation(line: 493, column: 37, scope: !1038)
!1057 = !DILocation(line: 493, column: 61, scope: !1038)
!1058 = !DILocation(line: 497, column: 35, scope: !1038)
!1059 = !DILocation(line: 497, column: 20, scope: !1038)
!1060 = !DILocation(line: 497, column: 14, scope: !1038)
!1061 = !DILocation(line: 498, column: 13, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1038, file: !315, line: 498, column: 9)
!1063 = !DILocation(line: 498, column: 9, scope: !1038)
!1064 = !DILocation(line: 499, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1062, file: !315, line: 498, column: 18)
!1066 = !DILocation(line: 501, column: 23, scope: !1038)
!1067 = !DILocation(line: 501, column: 31, scope: !1038)
!1068 = !DILocation(line: 503, column: 5, scope: !1038)
!1069 = !DILocation(line: 503, column: 12, scope: !1038)
!1070 = !DILocation(line: 504, column: 5, scope: !1038)
!1071 = !DILocation(line: 505, column: 30, scope: !1038)
!1072 = !{!1073, !552, i64 16}
!1073 = !{!"_vstr_t", !558, i64 0, !558, i64 8, !552, i64 16, !1074, i64 24}
!1074 = !{!"_Bool", !553, i64 0}
!1075 = !DILocation(line: 505, column: 11, scope: !1038)
!1076 = !DILocation(line: 506, column: 5, scope: !1038)
!1077 = !DILocation(line: 515, column: 24, scope: !1054)
!1078 = !DILocation(line: 515, column: 18, scope: !1054)
!1079 = !DILocation(line: 517, column: 9, scope: !1054)
!1080 = !DILocation(line: 518, column: 20, scope: !1054)
!1081 = !DILocation(line: 518, column: 16, scope: !1054)
!1082 = !DILocation(line: 519, column: 68, scope: !1054)
!1083 = !DILocation(line: 519, column: 50, scope: !1054)
!1084 = !DILocation(line: 519, column: 47, scope: !1054)
!1085 = !DILocation(line: 519, column: 9, scope: !1054)
!1086 = !DILocation(line: 522, column: 12, scope: !1038)
!1087 = !DILocation(line: 523, column: 1, scope: !1038)
!1088 = !DILocation(line: 522, column: 5, scope: !1038)
