; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objlist.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objlist.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%union.anon.0 = type { i8* (i64, i8**)* }
%struct.anon = type { %union._mp_arg_val_t, %union._mp_arg_val_t }
%union._mp_arg_val_t = type { i64 }
%struct._mp_arg_t = type { i16, i16, %union._mp_arg_val_t }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "allowed_args", scope: !2, file: !3, line: 319, type: !348, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "mp_obj_list_sort", scope: !3, file: !3, line: 318, type: !4, isLocal: false, isDefinition: true, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !33, retainedNodes: !338)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objlist.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !14, !16}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "../../py/obj.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !10, line: 31, baseType: !11)
!10 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !12, line: 92, baseType: !13)
!12 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !7, line: 374, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !7, line: 365, size: 192, elements: !19)
!19 = !{!20, !21, !22, !23, !24, !25, !26}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !18, file: !7, line: 366, baseType: !9, size: 1, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !18, file: !7, line: 367, baseType: !9, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !18, file: !7, line: 368, baseType: !9, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !18, file: !7, line: 369, baseType: !9, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !18, file: !7, line: 371, baseType: !9, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !18, file: !7, line: 372, baseType: !9, size: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !18, file: !7, line: 373, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !7, line: 353, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !7, line: 350, size: 128, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !29, file: !7, line: 351, baseType: !6, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !29, file: !7, line: 352, baseType: !6, size: 64, offset: 64)
!33 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !34, retainedTypes: !98, globals: !258)
!34 = !{!35, !43, !57}
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 423, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DIEnumerator(name: "PRINT_STR", value: 0)
!38 = !DIEnumerator(name: "PRINT_REPR", value: 1)
!39 = !DIEnumerator(name: "PRINT_EXC", value: 2)
!40 = !DIEnumerator(name: "PRINT_JSON", value: 3)
!41 = !DIEnumerator(name: "PRINT_RAW", value: 4)
!42 = !DIEnumerator(name: "PRINT_EXC_SUBCLASS", value: 128)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 47, size: 32, elements: !45)
!44 = !DIFile(filename: "../../py/runtime0.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!46 = !DIEnumerator(name: "MP_UNARY_OP_POSITIVE", value: 0)
!47 = !DIEnumerator(name: "MP_UNARY_OP_NEGATIVE", value: 1)
!48 = !DIEnumerator(name: "MP_UNARY_OP_INVERT", value: 2)
!49 = !DIEnumerator(name: "MP_UNARY_OP_NOT", value: 3)
!50 = !DIEnumerator(name: "MP_UNARY_OP_NUM_BYTECODE", value: 4)
!51 = !DIEnumerator(name: "MP_UNARY_OP_BOOL", value: 4)
!52 = !DIEnumerator(name: "MP_UNARY_OP_LEN", value: 5)
!53 = !DIEnumerator(name: "MP_UNARY_OP_HASH", value: 6)
!54 = !DIEnumerator(name: "MP_UNARY_OP_ABS", value: 7)
!55 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!56 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 69, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!59 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!60 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!61 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!62 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!63 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!65 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!66 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!67 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!68 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!69 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!70 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!71 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!72 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!73 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!74 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!75 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!76 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!77 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!78 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!79 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!80 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!81 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!82 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!83 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!84 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!85 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!86 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!87 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!88 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!89 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!90 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!91 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!92 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!93 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!94 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!95 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!96 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!97 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!98 = !{!8, !99, !100, !6, !104, !124, !127, !112, !241, !9, !249}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !102, line: 39, baseType: !103)
!102 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_val_t", file: !106, line: 52, baseType: !107)
!106 = !DIFile(filename: "../../py/runtime.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_mp_arg_val_t", file: !106, line: 47, size: 64, elements: !108)
!108 = !{!109, !111, !118, !119}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "u_bool", scope: !107, file: !106, line: 48, baseType: !110, size: 8)
!110 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "u_int", scope: !107, file: !106, line: 49, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !113, line: 70, baseType: !114)
!113 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !115, line: 32, baseType: !116)
!115 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !12, line: 49, baseType: !117)
!117 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "u_obj", scope: !107, file: !106, line: 50, baseType: !6, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "u_rom_obj", scope: !107, file: !106, line: 51, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !7, line: 243, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !7, line: 47, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !113, line: 71, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !126, line: 30, baseType: !13)
!126 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !7, line: 59, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !7, line: 56, size: 64, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !7, line: 57, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !7, line: 52, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !7, line: 474, size: 960, elements: !136)
!136 = !{!137, !138, !142, !143, !164, !169, !174, !180, !186, !193, !198, !212, !217, !233, !234, !235}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !135, file: !7, line: 476, baseType: !128, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !7, line: 479, baseType: !139, size: 16, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !140, line: 31, baseType: !141)
!140 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!141 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !7, line: 482, baseType: !139, size: 16, offset: 80)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !135, file: !7, line: 485, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !7, line: 441, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !6, !163}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !151, line: 53, baseType: !152)
!151 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !151, line: 50, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !151, line: 51, baseType: !8, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !152, file: !151, line: 52, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !151, line: 48, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !8, !160, !9}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !7, line: 430, baseType: !35)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !135, file: !7, line: 488, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !7, line: 442, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !132, !9, !14, !16}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !135, file: !7, line: 491, baseType: !170, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !7, line: 443, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!6, !6, !9, !9, !14}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !135, file: !7, line: 495, baseType: !175, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !7, line: 444, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!6, !179, !6}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !44, line: 65, baseType: !43)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !135, file: !7, line: 496, baseType: !181, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !7, line: 445, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!6, !185, !6, !6}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !44, line: 145, baseType: !57)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !135, file: !7, line: 509, baseType: !187, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !7, line: 446, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !6, !191, !99}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !192, line: 48, baseType: !9)
!192 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !135, file: !7, line: 516, baseType: !194, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !7, line: 447, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!6, !6, !6, !6}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !135, file: !7, line: 521, baseType: !199, size: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !7, line: 448, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!6, !6, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !7, line: 435, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !7, line: 432, size: 256, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !205, file: !7, line: 433, baseType: !128, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !7, line: 434, baseType: !209, size: 192, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 192, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !135, file: !7, line: 525, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !7, line: 415, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!6, !6}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !135, file: !7, line: 528, baseType: !218, size: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !7, line: 470, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !7, line: 468, size: 64, elements: !220)
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !219, file: !7, line: 469, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!112, !6, !225, !124}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !7, line: 464, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !7, line: 451, size: 192, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !7, line: 457, baseType: !8, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !227, file: !7, line: 458, baseType: !9, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !227, file: !7, line: 459, baseType: !232, size: 32, offset: 128)
!232 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !135, file: !7, line: 531, baseType: !122, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !135, file: !7, line: 537, baseType: !122, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !135, file: !7, line: 540, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !7, line: 775, size: 256, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !237, file: !7, line: 776, baseType: !128, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !237, file: !7, line: 777, baseType: !17, size: 192, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_list_it_t", file: !3, line: 510, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_list_it_t", file: !3, line: 505, size: 256, elements: !244)
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !243, file: !3, line: 506, baseType: !128, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !243, file: !3, line: 507, baseType: !213, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !243, file: !3, line: 508, baseType: !6, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !243, file: !3, line: 509, baseType: !9, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_list_t", file: !251, line: 36, baseType: !252)
!251 = !DIFile(filename: "../../py/objlist.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_list_t", file: !251, line: 31, size: 256, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !252, file: !251, line: 32, baseType: !128, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !252, file: !251, line: 33, baseType: !9, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !251, line: 34, baseType: !9, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !252, file: !251, line: 35, baseType: !99, size: 64, offset: 192)
!258 = !{!0, !259, !261, !265, !276, !299, !301, !303, !305, !307, !328, !330, !332, !334, !336}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "mp_type_list", scope: !33, file: !3, line: 447, type: !133, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "list_locals_dict", scope: !33, file: !3, line: 445, type: !263, isLocal: true, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !7, line: 778, baseType: !237)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "list_locals_dict_table", scope: !33, file: !3, line: 431, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 1408, elements: !274)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !7, line: 358, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !7, line: 355, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !270, file: !7, line: 356, baseType: !120, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !270, file: !7, line: 357, baseType: !120, size: 64, offset: 64)
!274 = !{!275}
!275 = !DISubrange(count: 11)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "list_append_obj", scope: !33, file: !3, line: 419, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !7, line: 802, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !7, line: 794, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !280, file: !7, line: 795, baseType: !128, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !280, file: !7, line: 801, baseType: !284, size: 64, offset: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !280, file: !7, line: 796, size: 64, elements: !285)
!285 = !{!286, !291, !292, !297}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !284, file: !7, line: 797, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !7, line: 414, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!6}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !284, file: !7, line: 798, baseType: !213, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !284, file: !7, line: 799, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !7, line: 416, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!6, !6, !6}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !284, file: !7, line: 800, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !7, line: 417, baseType: !195)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "list_clear_obj", scope: !33, file: !3, line: 421, type: !278, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "list_copy_obj", scope: !33, file: !3, line: 422, type: !278, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "list_count_obj", scope: !33, file: !3, line: 423, type: !278, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "list_extend_obj", scope: !33, file: !3, line: 420, type: !278, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "list_index_obj", scope: !33, file: !3, line: 424, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !7, line: 814, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !7, line: 805, size: 192, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !311, file: !7, line: 806, baseType: !128, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !311, file: !7, line: 807, baseType: !110, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !311, file: !7, line: 808, baseType: !124, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !311, file: !7, line: 809, baseType: !124, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !311, file: !7, line: 813, baseType: !318, size: 64, offset: 128)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !7, line: 810, size: 64, elements: !319)
!319 = !{!320, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !318, file: !7, line: 811, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !7, line: 418, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!6, !9, !14}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !318, file: !7, line: 812, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !7, line: 421, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "list_insert_obj", scope: !33, file: !3, line: 425, type: !278, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "list_pop_obj", scope: !33, file: !3, line: 426, type: !309, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "list_remove_obj", scope: !33, file: !3, line: 427, type: !278, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "list_reverse_obj", scope: !33, file: !3, line: 428, type: !278, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "list_sort_obj", scope: !33, file: !3, line: 429, type: !309, isLocal: true, isDefinition: true)
!338 = !{!339, !340, !341, !342, !347}
!339 = !DILocalVariable(name: "n_args", arg: 1, scope: !2, file: !3, line: 318, type: !9)
!340 = !DILocalVariable(name: "pos_args", arg: 2, scope: !2, file: !3, line: 318, type: !14)
!341 = !DILocalVariable(name: "kw_args", arg: 3, scope: !2, file: !3, line: 318, type: !16)
!342 = !DILocalVariable(name: "args", scope: !2, file: !3, line: 327, type: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !3, line: 325, size: 128, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !343, file: !3, line: 326, baseType: !105, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !343, file: !3, line: 326, baseType: !105, size: 64, offset: 64)
!347 = !DILocalVariable(name: "self", scope: !2, file: !3, line: 332, type: !249)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 256, elements: !356)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_arg_t", file: !106, line: 58, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_arg_t", file: !106, line: 54, size: 128, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !351, file: !106, line: 55, baseType: !139, size: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !351, file: !106, line: 56, baseType: !139, size: 16, offset: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "defval", scope: !351, file: !106, line: 57, baseType: !105, size: 64, offset: 64)
!356 = !{!357}
!357 = !DISubrange(count: 2)
!358 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!359 = !{i32 2, !"Dwarf Version", i32 4}
!360 = !{i32 2, !"Debug Info Version", i32 3}
!361 = !{i32 1, !"wchar_size", i32 4}
!362 = !{i32 7, !"PIC Level", i32 2}
!363 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!364 = distinct !DISubprogram(name: "mp_obj_list_append", scope: !3, file: !3, line: 237, type: !295, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !33, retainedNodes: !365)
!365 = !{!366, !367, !368}
!366 = !DILocalVariable(name: "self_in", arg: 1, scope: !364, file: !3, line: 237, type: !6)
!367 = !DILocalVariable(name: "arg", arg: 2, scope: !364, file: !3, line: 237, type: !6)
!368 = !DILocalVariable(name: "self", scope: !364, file: !3, line: 239, type: !249)
!369 = !DILocation(line: 237, column: 38, scope: !364)
!370 = !DILocation(line: 237, column: 56, scope: !364)
!371 = !DILocation(line: 240, column: 15, scope: !372)
!372 = distinct !DILexicalBlock(scope: !364, file: !3, line: 240, column: 9)
!373 = !{!374, !379, i64 16}
!374 = !{!"_mp_obj_list_t", !375, i64 0, !379, i64 8, !379, i64 16, !376, i64 24}
!375 = !{!"_mp_obj_base_t", !376, i64 0}
!376 = !{!"any pointer", !377, i64 0}
!377 = !{!"omnipotent char", !378, i64 0}
!378 = !{!"Simple C/C++ TBAA"}
!379 = !{!"long", !377, i64 0}
!380 = !DILocation(line: 240, column: 28, scope: !372)
!381 = !{!374, !379, i64 8}
!382 = !DILocation(line: 240, column: 19, scope: !372)
!383 = !DILocation(line: 240, column: 9, scope: !364)
!384 = !DILocation(line: 239, column: 20, scope: !364)
!385 = !DILocation(line: 241, column: 23, scope: !386)
!386 = distinct !DILexicalBlock(scope: !372, file: !3, line: 240, column: 35)
!387 = !{!374, !376, i64 24}
!388 = !DILocation(line: 241, column: 21, scope: !386)
!389 = !DILocation(line: 242, column: 21, scope: !386)
!390 = !DILocation(line: 243, column: 9, scope: !386)
!391 = !DILocation(line: 244, column: 5, scope: !386)
!392 = !DILocation(line: 245, column: 11, scope: !364)
!393 = !DILocation(line: 245, column: 26, scope: !364)
!394 = !DILocation(line: 245, column: 5, scope: !364)
!395 = !DILocation(line: 245, column: 30, scope: !364)
!396 = !{!376, !376, i64 0}
!397 = !DILocation(line: 246, column: 5, scope: !364)
!398 = !DILocation(line: 318, column: 34, scope: !2)
!399 = !DILocation(line: 318, column: 58, scope: !2)
!400 = !DILocation(line: 318, column: 78, scope: !2)
!401 = !DILocation(line: 325, column: 5, scope: !2)
!402 = !DILocation(line: 328, column: 29, scope: !2)
!403 = !DILocation(line: 328, column: 43, scope: !2)
!404 = !DILocation(line: 329, column: 52, scope: !2)
!405 = !DILocation(line: 328, column: 5, scope: !2)
!406 = !DILocation(line: 332, column: 27, scope: !2)
!407 = !DILocation(line: 332, column: 20, scope: !2)
!408 = !DILocation(line: 334, column: 15, scope: !409)
!409 = distinct !DILexicalBlock(scope: !2, file: !3, line: 334, column: 9)
!410 = !DILocation(line: 334, column: 19, scope: !409)
!411 = !DILocation(line: 334, column: 9, scope: !2)
!412 = !DILocation(line: 335, column: 28, scope: !413)
!413 = distinct !DILexicalBlock(scope: !409, file: !3, line: 334, column: 24)
!414 = !DILocation(line: 335, column: 47, scope: !413)
!415 = !DILocation(line: 335, column: 59, scope: !413)
!416 = !DILocation(line: 336, column: 31, scope: !413)
!417 = !{!377, !377, i64 0}
!418 = !DILocation(line: 336, column: 37, scope: !413)
!419 = !DILocation(line: 336, column: 22, scope: !413)
!420 = !DILocation(line: 337, column: 27, scope: !413)
!421 = !DILocation(line: 337, column: 35, scope: !413)
!422 = !{i8 0, i8 2}
!423 = !DILocation(line: 337, column: 22, scope: !413)
!424 = !DILocation(line: 335, column: 9, scope: !413)
!425 = !DILocation(line: 338, column: 5, scope: !413)
!426 = !DILocation(line: 341, column: 1, scope: !2)
