; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objmodule.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objmodule.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!243 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!244 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!245 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!246 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!247 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!248 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!249 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!250 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!251 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!252 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!253 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!254 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!255 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!256 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!257 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!258 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!259 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!260 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!261 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!262 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!263 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!264 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!265 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!266 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!267 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!268 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!269 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!270 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!271 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!272 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!273 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!274 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!275 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!276 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!277 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!278 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!279 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!280 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!281 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!282 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!283 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!284 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!285 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!286 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!287 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!288 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!289 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!290 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!291 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!292 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!293 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!294 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!295 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!296 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!297 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!298 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!299 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!300 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!301 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!302 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!303 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!304 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!305 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!306 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!307 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!308 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!309 = !{!310, !312, !311, !317, !369}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !313, line: 71, baseType: !314)
!313 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !315, line: 30, baseType: !316)
!315 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!316 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !6, line: 831, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !6, line: 828, size: 128, elements: !320)
!320 = !{!321, !465}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !319, file: !6, line: 829, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !6, line: 57, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !330)
!330 = !{!331, !332, !336, !337, !362, !386, !391, !397, !403, !410, !415, !429, !434, !455, !458, !459}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !329, file: !6, line: 476, baseType: !322, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !329, file: !6, line: 479, baseType: !333, size: 16, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !334, line: 31, baseType: !335)
!334 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!335 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !6, line: 482, baseType: !333, size: 16, offset: 80)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !329, file: !6, line: 485, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !342, !310, !361}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !345, line: 53, baseType: !346)
!345 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !345, line: 50, size: 128, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !345, line: 51, baseType: !311, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !346, file: !345, line: 52, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !345, line: 48, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !311, !354, !357}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !358, line: 31, baseType: !359)
!358 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !360, line: 92, baseType: !316)
!360 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !329, file: !6, line: 488, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!310, !326, !357, !367, !369}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !371, file: !6, line: 366, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !371, file: !6, line: 367, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !371, file: !6, line: 368, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !371, file: !6, line: 369, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !371, file: !6, line: 371, baseType: !357, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !371, file: !6, line: 372, baseType: !357, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !371, file: !6, line: 373, baseType: !380, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !382, file: !6, line: 351, baseType: !310, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !382, file: !6, line: 352, baseType: !310, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !329, file: !6, line: 491, baseType: !387, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!310, !310, !357, !357, !367}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !329, file: !6, line: 495, baseType: !392, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!310, !396, !310}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !329, file: !6, line: 496, baseType: !398, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!310, !402, !310, !310}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !329, file: !6, line: 509, baseType: !404, size: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !310, !408, !409}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !76, line: 48, baseType: !357)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !329, file: !6, line: 516, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!310, !310, !310, !310}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !329, file: !6, line: 521, baseType: !416, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!310, !310, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !422, file: !6, line: 433, baseType: !322, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !422, file: !6, line: 434, baseType: !426, size: 192, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 192, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !329, file: !6, line: 525, baseType: !430, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!310, !310}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !329, file: !6, line: 528, baseType: !435, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !436, file: !6, line: 469, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !310, !447, !312}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !313, line: 70, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !444, line: 32, baseType: !445)
!444 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !360, line: 49, baseType: !446)
!446 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !449, file: !6, line: 457, baseType: !311, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !449, file: !6, line: 458, baseType: !357, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !449, file: !6, line: 459, baseType: !454, size: 32, offset: 128)
!454 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !329, file: !6, line: 531, baseType: !456, size: 64, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !329, file: !6, line: 537, baseType: !456, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !329, file: !6, line: 540, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !461, file: !6, line: 776, baseType: !322, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !461, file: !6, line: 777, baseType: !370, size: 192, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !319, file: !6, line: 830, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !461)
!468 = !{!0, !469, !472}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "mp_builtin_module_map", scope: !2, file: !3, line: 267, type: !471, isLocal: false, isDefinition: true)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "mp_builtin_module_table", scope: !2, file: !3, line: 144, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 384, elements: !427)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !478)
!478 = !{!479, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !477, file: !6, line: 356, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !456)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !477, file: !6, line: 357, baseType: !480, size: 64, offset: 64)
!483 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!484 = !{i32 2, !"Dwarf Version", i32 4}
!485 = !{i32 2, !"Debug Info Version", i32 3}
!486 = !{i32 1, !"wchar_size", i32 4}
!487 = !{i32 7, !"PIC Level", i32 2}
!488 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!489 = distinct !DISubprogram(name: "module_print", scope: !3, file: !3, line: 37, type: !340, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !490)
!490 = !{!491, !492, !493, !494, !495, !496}
!491 = !DILocalVariable(name: "print", arg: 1, scope: !489, file: !3, line: 37, type: !342)
!492 = !DILocalVariable(name: "self_in", arg: 2, scope: !489, file: !3, line: 37, type: !310)
!493 = !DILocalVariable(name: "kind", arg: 3, scope: !489, file: !3, line: 37, type: !361)
!494 = !DILocalVariable(name: "self", scope: !489, file: !3, line: 39, type: !317)
!495 = !DILocalVariable(name: "module_name", scope: !489, file: !3, line: 41, type: !354)
!496 = !DILocalVariable(name: "elem", scope: !489, file: !3, line: 42, type: !380)
!497 = !DILocation(line: 37, column: 44, scope: !489)
!498 = !DILocation(line: 37, column: 60, scope: !489)
!499 = !DILocation(line: 37, column: 85, scope: !489)
!500 = !DILocation(line: 39, column: 22, scope: !489)
!501 = !DILocation(line: 42, column: 48, scope: !489)
!502 = !{!503, !505, i64 8}
!503 = !{!"_mp_obj_module_t", !504, i64 0, !505, i64 8}
!504 = !{!"_mp_obj_base_t", !505, i64 0}
!505 = !{!"any pointer", !506, i64 0}
!506 = !{!"omnipotent char", !507, i64 0}
!507 = !{!"Simple C/C++ TBAA"}
!508 = !DILocation(line: 42, column: 57, scope: !489)
!509 = !DILocation(line: 42, column: 27, scope: !489)
!510 = !DILocation(line: 42, column: 20, scope: !489)
!511 = !DILocation(line: 43, column: 14, scope: !512)
!512 = distinct !DILexicalBlock(scope: !489, file: !3, line: 43, column: 9)
!513 = !DILocation(line: 43, column: 9, scope: !489)
!514 = !DILocation(line: 44, column: 48, scope: !515)
!515 = distinct !DILexicalBlock(scope: !512, file: !3, line: 43, column: 23)
!516 = !{!517, !505, i64 8}
!517 = !{!"_mp_map_elem_t", !505, i64 0, !505, i64 8}
!518 = !DILocation(line: 44, column: 23, scope: !515)
!519 = !DILocation(line: 41, column: 17, scope: !489)
!520 = !DILocation(line: 45, column: 5, scope: !515)
!521 = !DILocation(line: 0, scope: !489)
!522 = !DILocation(line: 50, column: 33, scope: !489)
!523 = !DILocation(line: 50, column: 42, scope: !489)
!524 = !DILocation(line: 50, column: 12, scope: !489)
!525 = !DILocation(line: 51, column: 14, scope: !526)
!526 = distinct !DILexicalBlock(scope: !489, file: !3, line: 51, column: 9)
!527 = !DILocation(line: 51, column: 9, scope: !489)
!528 = !DILocation(line: 52, column: 91, scope: !529)
!529 = distinct !DILexicalBlock(scope: !526, file: !3, line: 51, column: 23)
!530 = !DILocation(line: 52, column: 66, scope: !529)
!531 = !DILocation(line: 52, column: 9, scope: !529)
!532 = !DILocation(line: 53, column: 9, scope: !529)
!533 = !DILocation(line: 57, column: 5, scope: !489)
!534 = !DILocation(line: 58, column: 1, scope: !489)
!535 = distinct !DISubprogram(name: "module_attr", scope: !3, file: !3, line: 60, type: !406, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !536)
!536 = !{!537, !538, !539, !540, !541, !544, !546}
!537 = !DILocalVariable(name: "self_in", arg: 1, scope: !535, file: !3, line: 60, type: !310)
!538 = !DILocalVariable(name: "attr", arg: 2, scope: !535, file: !3, line: 60, type: !408)
!539 = !DILocalVariable(name: "dest", arg: 3, scope: !535, file: !3, line: 60, type: !409)
!540 = !DILocalVariable(name: "self", scope: !535, file: !3, line: 61, type: !317)
!541 = !DILocalVariable(name: "elem", scope: !542, file: !3, line: 64, type: !380)
