; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objmodule.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objmodule.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!258 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!304 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!305 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!306 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!307 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!308 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!309 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!310 = !{!311, !313, !312, !318, !370}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !314, line: 70, baseType: !315)
!314 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !316, line: 30, baseType: !317)
!316 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!317 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_module_t", file: !6, line: 831, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_module_t", file: !6, line: 828, size: 128, elements: !321)
!321 = !{!322, !466}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !320, file: !6, line: 829, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !324, file: !6, line: 57, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !331)
!331 = !{!332, !333, !337, !338, !363, !387, !392, !398, !404, !411, !416, !430, !435, !456, !459, !460}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !330, file: !6, line: 476, baseType: !323, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !6, line: 479, baseType: !334, size: 16, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !335, line: 31, baseType: !336)
!335 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!336 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !6, line: 482, baseType: !334, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !330, file: !6, line: 485, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !343, !311, !362}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !346, line: 53, baseType: !347)
!346 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !346, line: 50, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !346, line: 51, baseType: !312, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !347, file: !346, line: 52, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !346, line: 48, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !312, !355, !358}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !359, line: 31, baseType: !360)
!359 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !361, line: 92, baseType: !317)
!361 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !330, file: !6, line: 488, baseType: !364, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!311, !327, !358, !368, !370}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !372, file: !6, line: 366, baseType: !358, size: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !372, file: !6, line: 367, baseType: !358, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !372, file: !6, line: 368, baseType: !358, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !372, file: !6, line: 369, baseType: !358, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !372, file: !6, line: 371, baseType: !358, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !372, file: !6, line: 372, baseType: !358, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !372, file: !6, line: 373, baseType: !381, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !383, file: !6, line: 351, baseType: !311, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !383, file: !6, line: 352, baseType: !311, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !330, file: !6, line: 491, baseType: !388, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!311, !311, !358, !358, !368}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !330, file: !6, line: 495, baseType: !393, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!311, !397, !311}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !330, file: !6, line: 496, baseType: !399, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!311, !403, !311, !311}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !330, file: !6, line: 509, baseType: !405, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !311, !409, !410}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !77, line: 48, baseType: !358)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !330, file: !6, line: 516, baseType: !412, size: 64, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!311, !311, !311, !311}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !330, file: !6, line: 521, baseType: !417, size: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!311, !311, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !423, file: !6, line: 433, baseType: !323, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !423, file: !6, line: 434, baseType: !427, size: 192, offset: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 192, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 3)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !330, file: !6, line: 525, baseType: !431, size: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!311, !311}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !330, file: !6, line: 528, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !437, file: !6, line: 469, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !311, !448, !313}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !314, line: 69, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !445, line: 32, baseType: !446)
!445 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !361, line: 49, baseType: !447)
!447 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !450, file: !6, line: 457, baseType: !312, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !450, file: !6, line: 458, baseType: !358, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !450, file: !6, line: 459, baseType: !455, size: 32, offset: 128)
!455 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !330, file: !6, line: 531, baseType: !457, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !6, line: 537, baseType: !457, size: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !330, file: !6, line: 540, baseType: !461, size: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !462, file: !6, line: 776, baseType: !323, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !462, file: !6, line: 777, baseType: !371, size: 192, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !320, file: !6, line: 830, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !462)
!469 = !{!0, !470, !474}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "mp_builtin_module_map", scope: !2, file: !472, line: 267, type: !473, isLocal: false, isDefinition: true)
!472 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objmodule.c", directory: "")
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "mp_builtin_module_table", scope: !2, file: !472, line: 144, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 384, elements: !428)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !480)
!480 = !{!481, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !479, file: !6, line: 356, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !457)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !479, file: !6, line: 357, baseType: !482, size: 64, offset: 64)
!485 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!486 = !{i32 2, !"Dwarf Version", i32 4}
!487 = !{i32 2, !"Debug Info Version", i32 3}
!488 = !{i32 1, !"wchar_size", i32 4}
!489 = !{i32 7, !"PIC Level", i32 2}
!490 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!491 = distinct !DISubprogram(name: "module_print", scope: !472, file: !472, line: 37, type: !341, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !492)
!492 = !{!493, !494, !495, !496, !497, !498}
!493 = !DILocalVariable(name: "print", arg: 1, scope: !491, file: !472, line: 37, type: !343)
!494 = !DILocalVariable(name: "self_in", arg: 2, scope: !491, file: !472, line: 37, type: !311)
!495 = !DILocalVariable(name: "kind", arg: 3, scope: !491, file: !472, line: 37, type: !362)
!496 = !DILocalVariable(name: "self", scope: !491, file: !472, line: 39, type: !318)
!497 = !DILocalVariable(name: "module_name", scope: !491, file: !472, line: 41, type: !355)
!498 = !DILocalVariable(name: "elem", scope: !491, file: !472, line: 42, type: !381)
!499 = !DILocation(line: 37, column: 44, scope: !491)
!500 = !DILocation(line: 37, column: 60, scope: !491)
!501 = !DILocation(line: 37, column: 85, scope: !491)
!502 = !DILocation(line: 39, column: 22, scope: !491)
!503 = !DILocation(line: 42, column: 48, scope: !491)
!504 = !{!505, !507, i64 8}
!505 = !{!"_mp_obj_module_t", !506, i64 0, !507, i64 8}
!506 = !{!"_mp_obj_base_t", !507, i64 0}
!507 = !{!"any pointer", !508, i64 0}
!508 = !{!"omnipotent char", !509, i64 0}
!509 = !{!"Simple C/C++ TBAA"}
!510 = !DILocation(line: 42, column: 57, scope: !491)
!511 = !DILocation(line: 42, column: 27, scope: !491)
!512 = !DILocation(line: 42, column: 20, scope: !491)
!513 = !DILocation(line: 43, column: 14, scope: !514)
!514 = distinct !DILexicalBlock(scope: !491, file: !472, line: 43, column: 9)
!515 = !DILocation(line: 43, column: 9, scope: !491)
!516 = !DILocation(line: 44, column: 48, scope: !517)
!517 = distinct !DILexicalBlock(scope: !514, file: !472, line: 43, column: 23)
!518 = !{!519, !507, i64 8}
!519 = !{!"_mp_map_elem_t", !507, i64 0, !507, i64 8}
!520 = !DILocation(line: 44, column: 23, scope: !517)
!521 = !DILocation(line: 41, column: 17, scope: !491)
!522 = !DILocation(line: 45, column: 5, scope: !517)
!523 = !DILocation(line: 0, scope: !491)
!524 = !DILocation(line: 50, column: 33, scope: !491)
!525 = !DILocation(line: 50, column: 42, scope: !491)
!526 = !DILocation(line: 50, column: 12, scope: !491)
!527 = !DILocation(line: 51, column: 14, scope: !528)
!528 = distinct !DILexicalBlock(scope: !491, file: !472, line: 51, column: 9)
!529 = !DILocation(line: 51, column: 9, scope: !491)
!530 = !DILocation(line: 52, column: 91, scope: !531)
!531 = distinct !DILexicalBlock(scope: !528, file: !472, line: 51, column: 23)
!532 = !DILocation(line: 52, column: 66, scope: !531)
!533 = !DILocation(line: 52, column: 9, scope: !531)
!534 = !DILocation(line: 53, column: 9, scope: !531)
!535 = !DILocation(line: 57, column: 5, scope: !491)
!536 = !DILocation(line: 58, column: 1, scope: !491)
!537 = distinct !DISubprogram(name: "module_attr", scope: !472, file: !472, line: 60, type: !407, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!538 = !{!539, !540, !541, !542, !543, !546, !548}
!539 = !DILocalVariable(name: "self_in", arg: 1, scope: !537, file: !472, line: 60, type: !311)
!540 = !DILocalVariable(name: "attr", arg: 2, scope: !537, file: !472, line: 60, type: !409)
!541 = !DILocalVariable(name: "dest", arg: 3, scope: !537, file: !472, line: 60, type: !410)
!542 = !DILocalVariable(name: "self", scope: !537, file: !472, line: 61, type: !318)
