; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objrange.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objrange.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._mp_obj_range_t = type { %struct._mp_obj_base_t, i64, i64, i64 }

@mp_type_type = external constant %struct._mp_obj_type_t, align 8

!224 = !DIEnumerator(name: "MP_QSTR_hash", value: 152)
!225 = !DIEnumerator(name: "MP_QSTR_heap_lock", value: 153)
!226 = !DIEnumerator(name: "MP_QSTR_heap_unlock", value: 154)
!227 = !DIEnumerator(name: "MP_QSTR_hex", value: 155)
!228 = !DIEnumerator(name: "MP_QSTR_id", value: 156)
!229 = !DIEnumerator(name: "MP_QSTR_index", value: 157)
!230 = !DIEnumerator(name: "MP_QSTR_insert", value: 158)
!231 = !DIEnumerator(name: "MP_QSTR_int", value: 159)
!232 = !DIEnumerator(name: "MP_QSTR_isalpha", value: 160)
!233 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!234 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!235 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!236 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!237 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!238 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!239 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!240 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!241 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!242 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!243 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!244 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!245 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!246 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!247 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!248 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!249 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!250 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!251 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!252 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!253 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!254 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!255 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!256 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!257 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!258 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!259 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!260 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!261 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!262 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!263 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!264 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!265 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!266 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!267 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!268 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!269 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!270 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!271 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!272 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!273 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!274 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!275 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!276 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!277 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!278 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!279 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!280 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!281 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!282 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!283 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!284 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!285 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!286 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!287 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!288 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!289 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!290 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!291 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!292 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!293 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!294 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!295 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!296 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!297 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!298 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!299 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!300 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!301 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!302 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!303 = !{!304, !305, !350, !446, !462}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_range_t", file: !3, line: 81, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_range_t", file: !3, line: 75, size: 256, elements: !308)
!308 = !{!309, !459, !460, !461}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !3, line: 76, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !6, line: 57, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !318)
!318 = !{!319, !320, !324, !325, !352, !376, !381, !387, !393, !400, !405, !419, !424, !449, !452, !453}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !317, file: !6, line: 476, baseType: !310, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !6, line: 479, baseType: !321, size: 16, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !322, line: 31, baseType: !323)
!322 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!323 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !6, line: 482, baseType: !321, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !317, file: !6, line: 485, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !330, !350, !351}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !333, line: 53, baseType: !334)
!333 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !333, line: 50, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !333, line: 51, baseType: !304, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !334, file: !333, line: 52, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !333, line: 48, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !304, !342, !345}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !346, line: 31, baseType: !347)
!346 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !348, line: 92, baseType: !349)
!348 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!349 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !304)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !317, file: !6, line: 488, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!350, !314, !345, !357, !359}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !361, file: !6, line: 366, baseType: !345, size: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !361, file: !6, line: 367, baseType: !345, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !361, file: !6, line: 368, baseType: !345, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !361, file: !6, line: 369, baseType: !345, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !361, file: !6, line: 371, baseType: !345, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !361, file: !6, line: 372, baseType: !345, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !361, file: !6, line: 373, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !372, file: !6, line: 351, baseType: !350, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !372, file: !6, line: 352, baseType: !350, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !317, file: !6, line: 491, baseType: !377, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!350, !350, !345, !345, !357}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !317, file: !6, line: 495, baseType: !382, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!350, !386, !350}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !317, file: !6, line: 496, baseType: !388, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!350, !392, !350, !350}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !317, file: !6, line: 509, baseType: !394, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !350, !398, !399}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !70, line: 48, baseType: !345)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !317, file: !6, line: 516, baseType: !401, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!350, !350, !350, !350}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !317, file: !6, line: 521, baseType: !406, size: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!350, !350, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !412, file: !6, line: 433, baseType: !310, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !412, file: !6, line: 434, baseType: !416, size: 192, offset: 64)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 192, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 3)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !317, file: !6, line: 525, baseType: !420, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!350, !350}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !317, file: !6, line: 528, baseType: !425, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !426, file: !6, line: 469, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !350, !438, !446}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !433, line: 70, baseType: !434)
!433 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !435, line: 32, baseType: !436)
!435 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !348, line: 49, baseType: !437)
!437 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !440, file: !6, line: 457, baseType: !304, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !440, file: !6, line: 458, baseType: !345, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !440, file: !6, line: 459, baseType: !445, size: 32, offset: 128)
!445 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !433, line: 71, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !448, line: 30, baseType: !349)
!448 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!449 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !317, file: !6, line: 531, baseType: !450, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !6, line: 537, baseType: !450, size: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !317, file: !6, line: 540, baseType: !454, size: 64, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !455, file: !6, line: 776, baseType: !310, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !455, file: !6, line: 777, baseType: !360, size: 192, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !307, file: !3, line: 78, baseType: !432, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !307, file: !3, line: 79, baseType: !432, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !307, file: !3, line: 80, baseType: !432, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_range_it_t", file: !3, line: 42, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_range_it_t", file: !3, line: 36, size: 256, elements: !465)
!465 = !{!466, !467, !468, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !464, file: !3, line: 37, baseType: !310, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !464, file: !3, line: 39, baseType: !432, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !464, file: !3, line: 40, baseType: !432, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !464, file: !3, line: 41, baseType: !432, size: 64, offset: 192)
!470 = !{!0, !471}
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "range_it_type", scope: !2, file: !3, line: 55, type: !315, isLocal: true, isDefinition: true)
!473 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!474 = !{i32 2, !"Dwarf Version", i32 4}
!475 = !{i32 2, !"Debug Info Version", i32 3}
!476 = !{i32 1, !"wchar_size", i32 4}
!477 = !{i32 7, !"PIC Level", i32 2}
!478 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!479 = distinct !DISubprogram(name: "range_print", scope: !3, file: !3, line: 83, type: !328, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DILocalVariable(name: "print", arg: 1, scope: !479, file: !3, line: 83, type: !330)
!482 = !DILocalVariable(name: "self_in", arg: 2, scope: !479, file: !3, line: 83, type: !350)
!483 = !DILocalVariable(name: "kind", arg: 3, scope: !479, file: !3, line: 83, type: !351)
!484 = !DILocalVariable(name: "self", scope: !479, file: !3, line: 85, type: !305)
!485 = !DILocation(line: 83, column: 43, scope: !479)
!486 = !DILocation(line: 83, column: 59, scope: !479)
!487 = !DILocation(line: 83, column: 84, scope: !479)
!488 = !DILocation(line: 85, column: 21, scope: !479)
!489 = !DILocation(line: 86, column: 62, scope: !479)
!490 = !{!491, !496, i64 8}
!491 = !{!"_mp_obj_range_t", !492, i64 0, !496, i64 8, !496, i64 16, !496, i64 24}
!492 = !{!"_mp_obj_base_t", !493, i64 0}
!493 = !{!"any pointer", !494, i64 0}
!494 = !{!"omnipotent char", !495, i64 0}
!495 = !{!"Simple C/C++ TBAA"}
!496 = !{!"long", !494, i64 0}
!497 = !DILocation(line: 86, column: 75, scope: !479)
!498 = !{!491, !496, i64 16}
!499 = !DILocation(line: 86, column: 5, scope: !479)
!500 = !DILocation(line: 87, column: 15, scope: !501)
!501 = distinct !DILexicalBlock(scope: !479, file: !3, line: 87, column: 9)
!502 = !{!491, !496, i64 24}
!503 = !DILocation(line: 87, column: 20, scope: !501)
!504 = !DILocation(line: 87, column: 9, scope: !479)
!505 = !DILocation(line: 88, column: 9, scope: !506)
!506 = distinct !DILexicalBlock(scope: !501, file: !3, line: 87, column: 26)
!507 = !DILocation(line: 89, column: 5, scope: !506)
!508 = !DILocation(line: 90, column: 9, scope: !509)
!509 = distinct !DILexicalBlock(scope: !501, file: !3, line: 89, column: 12)
!510 = !DILocation(line: 92, column: 1, scope: !479)
!511 = distinct !DISubprogram(name: "range_make_new", scope: !3, file: !3, line: 94, type: !355, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !512)
!512 = !{!513, !514, !515, !516, !517}
!513 = !DILocalVariable(name: "type", arg: 1, scope: !511, file: !3, line: 94, type: !314)
!514 = !DILocalVariable(name: "n_args", arg: 2, scope: !511, file: !3, line: 94, type: !345)
!515 = !DILocalVariable(name: "args", arg: 3, scope: !511, file: !3, line: 94, type: !357)
!516 = !DILocalVariable(name: "kw_args", arg: 4, scope: !511, file: !3, line: 94, type: !359)
!517 = !DILocalVariable(name: "o", scope: !511, file: !3, line: 97, type: !305)
!518 = !DILocation(line: 94, column: 53, scope: !511)
!519 = !DILocation(line: 94, column: 66, scope: !511)
!520 = !DILocation(line: 94, column: 90, scope: !511)
!521 = !DILocation(line: 94, column: 106, scope: !511)
!522 = !DILocation(line: 95, column: 5, scope: !511)
!523 = !DILocation(line: 97, column: 25, scope: !511)
!524 = !DILocation(line: 98, column: 13, scope: !511)
!525 = !DILocation(line: 98, column: 18, scope: !511)
!526 = !{!491, !493, i64 0}
!527 = !DILocation(line: 99, column: 8, scope: !511)
!528 = !DILocation(line: 99, column: 14, scope: !511)
!529 = !DILocation(line: 100, column: 8, scope: !511)
!530 = !DILocation(line: 100, column: 13, scope: !511)
