; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objrange.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objrange.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._mp_obj_range_t = type { %struct._mp_obj_base_t, i64, i64, i64 }

@mp_type_type = external constant %struct._mp_obj_type_t, align 8

!245 = !DIEnumerator(name: "MP_QSTR_keys", value: 172, isUnsigned: true)
!246 = !DIEnumerator(name: "MP_QSTR_len", value: 173, isUnsigned: true)
!247 = !DIEnumerator(name: "MP_QSTR_list", value: 174, isUnsigned: true)
!248 = !DIEnumerator(name: "MP_QSTR_little", value: 175, isUnsigned: true)
!249 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!250 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!251 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!252 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!253 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!254 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!255 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!256 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!257 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !{!305, !306, !352, !448, !464}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_range_t", file: !308, line: 81, baseType: !309)
!308 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objrange.c", directory: "")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_range_t", file: !308, line: 75, size: 256, elements: !310)
!310 = !{!311, !461, !462, !463}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !309, file: !308, line: 76, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !314)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !6, line: 57, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !320)
!320 = !{!321, !322, !326, !327, !354, !378, !383, !389, !395, !402, !407, !421, !426, !451, !454, !455}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !319, file: !6, line: 476, baseType: !312, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !6, line: 479, baseType: !323, size: 16, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !324, line: 31, baseType: !325)
!324 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !319, file: !6, line: 482, baseType: !323, size: 16, offset: 80)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !319, file: !6, line: 485, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332, !352, !353}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !335, line: 53, baseType: !336)
!335 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !335, line: 50, size: 128, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !335, line: 51, baseType: !305, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !336, file: !335, line: 52, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !335, line: 48, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !305, !344, !347}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !348, line: 31, baseType: !349)
!348 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !350, line: 92, baseType: !351)
!350 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!351 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !305)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !319, file: !6, line: 488, baseType: !355, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!352, !316, !347, !359, !361}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !363, file: !6, line: 366, baseType: !347, size: 1, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !363, file: !6, line: 367, baseType: !347, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !363, file: !6, line: 368, baseType: !347, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !363, file: !6, line: 369, baseType: !347, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !363, file: !6, line: 371, baseType: !347, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !363, file: !6, line: 372, baseType: !347, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !363, file: !6, line: 373, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !374, file: !6, line: 351, baseType: !352, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !374, file: !6, line: 352, baseType: !352, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !319, file: !6, line: 491, baseType: !379, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!352, !352, !347, !347, !359}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !319, file: !6, line: 495, baseType: !384, size: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!352, !388, !352}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !319, file: !6, line: 496, baseType: !390, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!352, !394, !352, !352}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !319, file: !6, line: 509, baseType: !396, size: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !352, !400, !401}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !347)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !319, file: !6, line: 516, baseType: !403, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!352, !352, !352, !352}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !319, file: !6, line: 521, baseType: !408, size: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!352, !352, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !414, file: !6, line: 433, baseType: !312, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !414, file: !6, line: 434, baseType: !418, size: 192, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 192, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 3)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !319, file: !6, line: 525, baseType: !422, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!352, !352}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !319, file: !6, line: 528, baseType: !427, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !428, file: !6, line: 469, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !352, !440, !448}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !435, line: 69, baseType: !436)
!435 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !437, line: 32, baseType: !438)
!437 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !350, line: 49, baseType: !439)
!439 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !442, file: !6, line: 457, baseType: !305, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !442, file: !6, line: 458, baseType: !347, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !442, file: !6, line: 459, baseType: !447, size: 32, offset: 128)
!447 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !435, line: 70, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !450, line: 30, baseType: !351)
!450 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !319, file: !6, line: 531, baseType: !452, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !319, file: !6, line: 537, baseType: !452, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !319, file: !6, line: 540, baseType: !456, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !457, file: !6, line: 776, baseType: !312, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !457, file: !6, line: 777, baseType: !362, size: 192, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !309, file: !308, line: 78, baseType: !434, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !309, file: !308, line: 79, baseType: !434, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !309, file: !308, line: 80, baseType: !434, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_range_it_t", file: !308, line: 42, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_range_it_t", file: !308, line: 36, size: 256, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !466, file: !308, line: 37, baseType: !312, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !466, file: !308, line: 39, baseType: !434, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !466, file: !308, line: 40, baseType: !434, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !466, file: !308, line: 41, baseType: !434, size: 64, offset: 192)
!472 = !{!0, !473}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "range_it_type", scope: !2, file: !308, line: 55, type: !317, isLocal: true, isDefinition: true)
!475 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!476 = !{i32 2, !"Dwarf Version", i32 4}
!477 = !{i32 2, !"Debug Info Version", i32 3}
!478 = !{i32 1, !"wchar_size", i32 4}
!479 = !{i32 7, !"PIC Level", i32 2}
!480 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!481 = distinct !DISubprogram(name: "range_print", scope: !308, file: !308, line: 83, type: !330, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DILocalVariable(name: "print", arg: 1, scope: !481, file: !308, line: 83, type: !332)
!484 = !DILocalVariable(name: "self_in", arg: 2, scope: !481, file: !308, line: 83, type: !352)
!485 = !DILocalVariable(name: "kind", arg: 3, scope: !481, file: !308, line: 83, type: !353)
!486 = !DILocalVariable(name: "self", scope: !481, file: !308, line: 85, type: !306)
!487 = !DILocation(line: 83, column: 43, scope: !481)
!488 = !DILocation(line: 83, column: 59, scope: !481)
!489 = !DILocation(line: 83, column: 84, scope: !481)
!490 = !DILocation(line: 85, column: 21, scope: !481)
!491 = !DILocation(line: 86, column: 62, scope: !481)
!492 = !{!493, !498, i64 8}
!493 = !{!"_mp_obj_range_t", !494, i64 0, !498, i64 8, !498, i64 16, !498, i64 24}
!494 = !{!"_mp_obj_base_t", !495, i64 0}
!495 = !{!"any pointer", !496, i64 0}
!496 = !{!"omnipotent char", !497, i64 0}
!497 = !{!"Simple C/C++ TBAA"}
!498 = !{!"long", !496, i64 0}
!499 = !DILocation(line: 86, column: 75, scope: !481)
!500 = !{!493, !498, i64 16}
!501 = !DILocation(line: 86, column: 5, scope: !481)
!502 = !DILocation(line: 87, column: 15, scope: !503)
!503 = distinct !DILexicalBlock(scope: !481, file: !308, line: 87, column: 9)
!504 = !{!493, !498, i64 24}
!505 = !DILocation(line: 87, column: 20, scope: !503)
!506 = !DILocation(line: 87, column: 9, scope: !481)
!507 = !DILocation(line: 88, column: 9, scope: !508)
!508 = distinct !DILexicalBlock(scope: !503, file: !308, line: 87, column: 26)
!509 = !DILocation(line: 89, column: 5, scope: !508)
!510 = !DILocation(line: 90, column: 9, scope: !511)
!511 = distinct !DILexicalBlock(scope: !503, file: !308, line: 89, column: 12)
!512 = !DILocation(line: 92, column: 1, scope: !481)
!513 = distinct !DISubprogram(name: "range_make_new", scope: !308, file: !308, line: 94, type: !357, scopeLine: 94, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !514)
!514 = !{!515, !516, !517, !518, !519}
!515 = !DILocalVariable(name: "type", arg: 1, scope: !513, file: !308, line: 94, type: !316)
!516 = !DILocalVariable(name: "n_args", arg: 2, scope: !513, file: !308, line: 94, type: !347)
!517 = !DILocalVariable(name: "args", arg: 3, scope: !513, file: !308, line: 94, type: !359)
!518 = !DILocalVariable(name: "kw_args", arg: 4, scope: !513, file: !308, line: 94, type: !361)
!519 = !DILocalVariable(name: "o", scope: !513, file: !308, line: 97, type: !306)
!520 = !DILocation(line: 94, column: 53, scope: !513)
!521 = !DILocation(line: 94, column: 66, scope: !513)
!522 = !DILocation(line: 94, column: 90, scope: !513)
!523 = !DILocation(line: 94, column: 106, scope: !513)
!524 = !DILocation(line: 95, column: 5, scope: !513)
!525 = !DILocation(line: 97, column: 25, scope: !513)
!526 = !DILocation(line: 98, column: 13, scope: !513)
!527 = !DILocation(line: 98, column: 18, scope: !513)
!528 = !{!493, !495, i64 0}
!529 = !DILocation(line: 99, column: 8, scope: !513)
!530 = !DILocation(line: 99, column: 14, scope: !513)
