; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%union.anon.0 = type { i8* (i64, i8**)* }

@.str = private unnamed_addr constant [2 x i8] c"(\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c", \00", align 1

!31 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !{!71, !72, !79, !80, !84, !233, !242, !177}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !73, line: 69, baseType: !74)
!73 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !75, line: 32, baseType: !76)
!75 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !77, line: 49, baseType: !78)
!77 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!78 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !71)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !73, line: 70, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !82, line: 30, baseType: !83)
!82 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !86, line: 35, baseType: !87)
!86 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.h", directory: "")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !86, line: 31, size: 128, elements: !88)
!88 = !{!89, !228, !229}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !87, file: !86, line: 32, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !6, line: 57, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !98)
!98 = !{!99, !100, !104, !105, !129, !153, !158, !164, !170, !178, !183, !197, !202, !218, !221, !222}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !97, file: !6, line: 476, baseType: !90, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !6, line: 479, baseType: !101, size: 16, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !102, line: 31, baseType: !103)
!102 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!103 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !6, line: 482, baseType: !101, size: 16, offset: 80)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !97, file: !6, line: 485, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, !79, !128}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !113, line: 53, baseType: !114)
!113 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !113, line: 50, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !113, line: 51, baseType: !71, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !114, file: !113, line: 52, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !113, line: 48, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !71, !122, !125}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !126, line: 31, baseType: !127)
!126 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !77, line: 92, baseType: !83)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !97, file: !6, line: 488, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!79, !94, !125, !134, !136}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !138, file: !6, line: 366, baseType: !125, size: 1, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !138, file: !6, line: 367, baseType: !125, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !138, file: !6, line: 368, baseType: !125, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !138, file: !6, line: 369, baseType: !125, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !138, file: !6, line: 371, baseType: !125, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !138, file: !6, line: 372, baseType: !125, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !138, file: !6, line: 373, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !149, file: !6, line: 351, baseType: !79, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !149, file: !6, line: 352, baseType: !79, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !97, file: !6, line: 491, baseType: !154, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!79, !79, !125, !125, !134}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !97, file: !6, line: 495, baseType: !159, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!79, !163, !79}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !97, file: !6, line: 496, baseType: !165, size: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!79, !169, !79, !79}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !97, file: !6, line: 509, baseType: !171, size: 64, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !79, !175, !177}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !176, line: 48, baseType: !125)
!176 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !97, file: !6, line: 516, baseType: !179, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!79, !79, !79, !79}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !97, file: !6, line: 521, baseType: !184, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!79, !79, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !190, file: !6, line: 433, baseType: !90, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !190, file: !6, line: 434, baseType: !194, size: 192, offset: 64)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 192, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 3)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !97, file: !6, line: 525, baseType: !198, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!79, !79}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !97, file: !6, line: 528, baseType: !203, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !204, file: !6, line: 469, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!72, !79, !210, !80}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !212, file: !6, line: 457, baseType: !71, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !6, line: 458, baseType: !125, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !212, file: !6, line: 459, baseType: !217, size: 32, offset: 128)
!217 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !97, file: !6, line: 531, baseType: !219, size: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !97, file: !6, line: 537, baseType: !219, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !97, file: !6, line: 540, baseType: !223, size: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !224, file: !6, line: 776, baseType: !90, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !224, file: !6, line: 777, baseType: !137, size: 192, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !86, line: 33, baseType: !125, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !87, file: !86, line: 34, baseType: !230, offset: 128)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: -1)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_it_t", file: !235, line: 274, baseType: !236)
!235 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.c", directory: "")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_it_t", file: !235, line: 269, size: 256, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !236, file: !235, line: 270, baseType: !90, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !236, file: !235, line: 271, baseType: !198, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !236, file: !235, line: 272, baseType: !84, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !236, file: !235, line: 273, baseType: !125, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!243 = !{!244, !0, !246, !250, !263, !286}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "mp_type_tuple", scope: !2, file: !235, line: 223, type: !95, isLocal: false, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "tuple_locals_dict", scope: !2, file: !235, line: 221, type: !248, isLocal: true, isDefinition: true)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !224)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "tuple_locals_dict_table", scope: !2, file: !235, line: 216, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 256, elements: !261)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !256)
!256 = !{!257, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !255, file: !6, line: 356, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !219)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !255, file: !6, line: 357, baseType: !258, size: 64, offset: 64)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "tuple_count_obj", scope: !2, file: !235, line: 207, type: !265, isLocal: true, isDefinition: true)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !267, file: !6, line: 795, baseType: !90, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !267, file: !6, line: 801, baseType: !271, size: 64, offset: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !267, file: !6, line: 796, size: 64, elements: !272)
!272 = !{!273, !278, !279, !284}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !271, file: !6, line: 797, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!79}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !271, file: !6, line: 798, baseType: !198, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !271, file: !6, line: 799, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!79, !79, !79}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !271, file: !6, line: 800, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !180)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "tuple_index_obj", scope: !2, file: !235, line: 214, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !291)
!291 = !{!292, !293, !295, !296, !297}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !290, file: !6, line: 806, baseType: !90, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !290, file: !6, line: 807, baseType: !294, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !290, file: !6, line: 808, baseType: !80, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !290, file: !6, line: 809, baseType: !80, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !290, file: !6, line: 813, baseType: !298, size: 64, offset: 128)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !6, line: 810, size: 64, elements: !299)
!299 = !{!300, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !298, file: !6, line: 811, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!79, !125, !134}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !298, file: !6, line: 812, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!79, !125, !134, !136}
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!311 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!312 = !{i32 2, !"Dwarf Version", i32 4}
!313 = !{i32 2, !"Debug Info Version", i32 3}
!314 = !{i32 1, !"wchar_size", i32 4}
!315 = !{i32 7, !"PIC Level", i32 2}
!316 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!317 = distinct !DISubprogram(name: "mp_obj_tuple_print", scope: !235, file: !235, line: 38, type: !108, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !318)
!318 = !{!319, !320, !321, !322, !323}
!319 = !DILocalVariable(name: "print", arg: 1, scope: !317, file: !235, line: 38, type: !110)
!320 = !DILocalVariable(name: "o_in", arg: 2, scope: !317, file: !235, line: 38, type: !79)
!321 = !DILocalVariable(name: "kind", arg: 3, scope: !317, file: !235, line: 38, type: !128)
!322 = !DILocalVariable(name: "o", scope: !317, file: !235, line: 39, type: !84)
!323 = !DILocalVariable(name: "i", scope: !324, file: !235, line: 46, type: !125)
!324 = distinct !DILexicalBlock(scope: !317, file: !235, line: 46, column: 5)
!325 = !DILocation(line: 38, column: 43, scope: !317)
!326 = !DILocation(line: 38, column: 59, scope: !317)
!327 = !DILocation(line: 38, column: 81, scope: !317)
!328 = !DILocation(line: 39, column: 21, scope: !317)
!329 = !DILocation(line: 43, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !331, file: !235, line: 42, column: 12)
!331 = distinct !DILexicalBlock(scope: !317, file: !235, line: 40, column: 9)
!332 = !DILocation(line: 46, column: 17, scope: !324)
!333 = !DILocation(line: 46, column: 31, scope: !334)
!334 = distinct !DILexicalBlock(scope: !324, file: !235, line: 46, column: 5)
!335 = !{!336, !336, i64 0}
!336 = !{!"long", !337, i64 0}
!337 = !{!"omnipotent char", !338, i64 0}
!338 = !{!"Simple C/C++ TBAA"}
!339 = !DILocation(line: 46, column: 26, scope: !334)
!340 = !DILocation(line: 46, column: 5, scope: !324)
!341 = !DILocation(line: 0, scope: !342)
!342 = distinct !DILexicalBlock(scope: !334, file: !235, line: 46, column: 41)
!343 = !DILocation(line: 55, column: 20, scope: !344)
!344 = distinct !DILexicalBlock(scope: !345, file: !235, line: 55, column: 13)
!345 = distinct !DILexicalBlock(scope: !346, file: !235, line: 54, column: 12)
!346 = distinct !DILexicalBlock(scope: !317, file: !235, line: 52, column: 9)
!347 = !DILocation(line: 55, column: 13, scope: !345)
!348 = !DILocation(line: 47, column: 15, scope: !349)
!349 = distinct !DILexicalBlock(scope: !342, file: !235, line: 47, column: 13)
!350 = !DILocation(line: 47, column: 13, scope: !342)
!351 = !DILocation(line: 48, column: 13, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !235, line: 47, column: 20)
!353 = !DILocation(line: 49, column: 9, scope: !352)
!354 = !DILocation(line: 50, column: 36, scope: !342)
!355 = !{!356, !356, i64 0}
!356 = !{!"any pointer", !337, i64 0}
!357 = !DILocation(line: 50, column: 9, scope: !342)
