; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_tuple_t = type { %struct._mp_obj_base_t, i64, [0 x i8*] }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct._mp_rom_map_elem_t = type { i8*, i8* }
%union.anon.0 = type { i8* (i64, i8**)* }

@.str = private unnamed_addr constant [2 x i8] c"(\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c", \00", align 1

!26 = !DIEnumerator(name: "MP_UNARY_OP_SIZEOF", value: 8)
!27 = !DIEnumerator(name: "MP_UNARY_OP_NUM_RUNTIME", value: 9)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !{!70, !71, !78, !79, !83, !232, !240, !176}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !72, line: 70, baseType: !73)
!72 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !74, line: 32, baseType: !75)
!74 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !76, line: 49, baseType: !77)
!76 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !70)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !72, line: 71, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !81, line: 30, baseType: !82)
!81 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !85, line: 35, baseType: !86)
!85 = !DIFile(filename: "../../py/objtuple.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !85, line: 31, size: 128, elements: !87)
!87 = !{!88, !227, !228}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !86, file: !85, line: 32, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !91)
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !6, line: 57, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !97)
!97 = !{!98, !99, !103, !104, !128, !152, !157, !163, !169, !177, !182, !196, !201, !217, !220, !221}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !96, file: !6, line: 476, baseType: !89, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !6, line: 479, baseType: !100, size: 16, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !101, line: 31, baseType: !102)
!101 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !6, line: 482, baseType: !100, size: 16, offset: 80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !96, file: !6, line: 485, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !78, !127}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !112, line: 53, baseType: !113)
!112 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !112, line: 50, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !112, line: 51, baseType: !70, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !113, file: !112, line: 52, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !112, line: 48, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !70, !121, !124}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 31, baseType: !126)
!125 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !76, line: 92, baseType: !82)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !96, file: !6, line: 488, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!78, !93, !124, !133, !135}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !137, file: !6, line: 366, baseType: !124, size: 1, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !137, file: !6, line: 367, baseType: !124, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !137, file: !6, line: 368, baseType: !124, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !137, file: !6, line: 369, baseType: !124, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !137, file: !6, line: 371, baseType: !124, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !137, file: !6, line: 372, baseType: !124, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !137, file: !6, line: 373, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !148, file: !6, line: 351, baseType: !78, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !148, file: !6, line: 352, baseType: !78, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !96, file: !6, line: 491, baseType: !153, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!78, !78, !124, !124, !133}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !96, file: !6, line: 495, baseType: !158, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!78, !162, !78}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !96, file: !6, line: 496, baseType: !164, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!78, !168, !78, !78}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !96, file: !6, line: 509, baseType: !170, size: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !78, !174, !176}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !175, line: 48, baseType: !124)
!175 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !96, file: !6, line: 516, baseType: !178, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!78, !78, !78, !78}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !96, file: !6, line: 521, baseType: !183, size: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!78, !78, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !189, file: !6, line: 433, baseType: !89, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !189, file: !6, line: 434, baseType: !193, size: 192, offset: 64)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 192, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !96, file: !6, line: 525, baseType: !197, size: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!78, !78}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !96, file: !6, line: 528, baseType: !202, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !203, file: !6, line: 469, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!71, !78, !209, !79}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !211, file: !6, line: 457, baseType: !70, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !211, file: !6, line: 458, baseType: !124, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !211, file: !6, line: 459, baseType: !216, size: 32, offset: 128)
!216 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !96, file: !6, line: 531, baseType: !218, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !6, line: 537, baseType: !218, size: 64, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !96, file: !6, line: 540, baseType: !222, size: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !223, file: !6, line: 776, baseType: !89, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !223, file: !6, line: 777, baseType: !136, size: 192, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !86, file: !85, line: 33, baseType: !124, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !86, file: !85, line: 34, baseType: !229, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: -1)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_it_t", file: !3, line: 274, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_it_t", file: !3, line: 269, size: 256, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !234, file: !3, line: 270, baseType: !89, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !234, file: !3, line: 271, baseType: !197, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !234, file: !3, line: 272, baseType: !83, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !234, file: !3, line: 273, baseType: !124, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!241 = !{!242, !0, !244, !248, !261, !284}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "mp_type_tuple", scope: !2, file: !3, line: 223, type: !94, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "tuple_locals_dict", scope: !2, file: !3, line: 221, type: !246, isLocal: true, isDefinition: true)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !6, line: 778, baseType: !223)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "tuple_locals_dict_table", scope: !2, file: !3, line: 216, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 256, elements: !259)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_map_elem_t", file: !6, line: 358, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_rom_map_elem_t", file: !6, line: 355, size: 128, elements: !254)
!254 = !{!255, !258}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !253, file: !6, line: 356, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_rom_obj_t", file: !6, line: 243, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !218)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !253, file: !6, line: 357, baseType: !256, size: 64, offset: 64)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "tuple_count_obj", scope: !2, file: !3, line: 207, type: !263, isLocal: true, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !265, file: !6, line: 795, baseType: !89, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !265, file: !6, line: 801, baseType: !269, size: 64, offset: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !265, file: !6, line: 796, size: 64, elements: !270)
!270 = !{!271, !276, !277, !282}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !269, file: !6, line: 797, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!78}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !269, file: !6, line: 798, baseType: !197, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !269, file: !6, line: 799, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!78, !78, !78}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !269, file: !6, line: 800, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !179)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "tuple_index_obj", scope: !2, file: !3, line: 214, type: !286, isLocal: true, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !289)
!289 = !{!290, !291, !293, !294, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !288, file: !6, line: 806, baseType: !89, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !288, file: !6, line: 807, baseType: !292, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!292 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !288, file: !6, line: 808, baseType: !79, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !288, file: !6, line: 809, baseType: !79, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !288, file: !6, line: 813, baseType: !296, size: 64, offset: 128)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !288, file: !6, line: 810, size: 64, elements: !297)
!297 = !{!298, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !296, file: !6, line: 811, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!78, !124, !133}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !296, file: !6, line: 812, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!78, !124, !133, !135}
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!309 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!310 = !{i32 2, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
!312 = !{i32 1, !"wchar_size", i32 4}
!313 = !{i32 7, !"PIC Level", i32 2}
!314 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!315 = distinct !DISubprogram(name: "mp_obj_tuple_print", scope: !3, file: !3, line: 38, type: !107, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !316)
!316 = !{!317, !318, !319, !320, !321}
!317 = !DILocalVariable(name: "print", arg: 1, scope: !315, file: !3, line: 38, type: !109)
!318 = !DILocalVariable(name: "o_in", arg: 2, scope: !315, file: !3, line: 38, type: !78)
!319 = !DILocalVariable(name: "kind", arg: 3, scope: !315, file: !3, line: 38, type: !127)
!320 = !DILocalVariable(name: "o", scope: !315, file: !3, line: 39, type: !83)
!321 = !DILocalVariable(name: "i", scope: !322, file: !3, line: 46, type: !124)
!322 = distinct !DILexicalBlock(scope: !315, file: !3, line: 46, column: 5)
!323 = !DILocation(line: 38, column: 43, scope: !315)
!324 = !DILocation(line: 38, column: 59, scope: !315)
!325 = !DILocation(line: 38, column: 81, scope: !315)
!326 = !DILocation(line: 39, column: 21, scope: !315)
!327 = !DILocation(line: 43, column: 9, scope: !328)
!328 = distinct !DILexicalBlock(scope: !329, file: !3, line: 42, column: 12)
!329 = distinct !DILexicalBlock(scope: !315, file: !3, line: 40, column: 9)
!330 = !DILocation(line: 46, column: 17, scope: !322)
!331 = !DILocation(line: 46, column: 31, scope: !332)
!332 = distinct !DILexicalBlock(scope: !322, file: !3, line: 46, column: 5)
!333 = !{!334, !334, i64 0}
!334 = !{!"long", !335, i64 0}
!335 = !{!"omnipotent char", !336, i64 0}
!336 = !{!"Simple C/C++ TBAA"}
!337 = !DILocation(line: 46, column: 26, scope: !332)
!338 = !DILocation(line: 46, column: 5, scope: !322)
!339 = !DILocation(line: 55, column: 20, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 55, column: 13)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 54, column: 12)
!342 = distinct !DILexicalBlock(scope: !315, file: !3, line: 52, column: 9)
!343 = !DILocation(line: 55, column: 13, scope: !341)
!344 = !DILocation(line: 47, column: 15, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !3, line: 47, column: 13)
!346 = distinct !DILexicalBlock(scope: !332, file: !3, line: 46, column: 41)
!347 = !DILocation(line: 47, column: 13, scope: !346)
!348 = !DILocation(line: 48, column: 13, scope: !349)
!349 = distinct !DILexicalBlock(scope: !345, file: !3, line: 47, column: 20)
!350 = !DILocation(line: 49, column: 9, scope: !349)
!351 = !DILocation(line: 50, column: 36, scope: !346)
!352 = !{!353, !353, i64 0}
!353 = !{!"any pointer", !335, i64 0}
!354 = !DILocation(line: 50, column: 9, scope: !346)
!355 = !DILocation(line: 46, column: 37, scope: !332)
!356 = distinct !{!356, !338, !357}
