; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objtype.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objtype.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct.class_lookup_data = type { %struct._mp_obj_instance_t*, i64, i64, i8**, i8 }
%struct._mp_obj_instance_t = type { %struct._mp_obj_base_t, %struct._mp_map_t, [0 x i8*] }

!249 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!250 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!251 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!252 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!253 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!254 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!255 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!256 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!257 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !6, line: 377, baseType: !7, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0, isUnsigned: true)
!307 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1, isUnsigned: true)
!308 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2, isUnsigned: true)
!309 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3, isUnsigned: true)
!310 = !{!311, !312, !313, !314, !462, !449, !463, !474, !475, !319, !435, !476, !484}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !6, line: 57, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !323)
!323 = !{!324, !325, !329, !330, !356, !380, !385, !391, !397, !403, !408, !422, !427, !452, !455, !456}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !322, file: !6, line: 476, baseType: !315, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !322, file: !6, line: 479, baseType: !326, size: 16, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !327, line: 31, baseType: !328)
!327 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!328 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !6, line: 482, baseType: !326, size: 16, offset: 80)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !322, file: !6, line: 485, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !335, !311, !355}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !338, line: 53, baseType: !339)
!338 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !338, line: 50, size: 128, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !338, line: 51, baseType: !312, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !339, file: !338, line: 52, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !338, line: 48, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !312, !347, !350}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !351, line: 31, baseType: !352)
!351 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !353, line: 92, baseType: !354)
!353 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!354 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !322, file: !6, line: 488, baseType: !357, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!311, !319, !350, !361, !363}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !365, file: !6, line: 366, baseType: !350, size: 1, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !365, file: !6, line: 367, baseType: !350, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !365, file: !6, line: 368, baseType: !350, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !365, file: !6, line: 369, baseType: !350, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !365, file: !6, line: 371, baseType: !350, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !365, file: !6, line: 372, baseType: !350, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !365, file: !6, line: 373, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !376, file: !6, line: 351, baseType: !311, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !376, file: !6, line: 352, baseType: !311, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !322, file: !6, line: 491, baseType: !381, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!311, !311, !350, !350, !361}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !322, file: !6, line: 495, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!311, !390, !311}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !322, file: !6, line: 496, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!311, !396, !311, !311}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !322, file: !6, line: 509, baseType: !398, size: 64, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !311, !402, !313}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !71, line: 48, baseType: !350)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !322, file: !6, line: 516, baseType: !404, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!311, !311, !311, !311}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !322, file: !6, line: 521, baseType: !409, size: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!311, !311, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !415, file: !6, line: 433, baseType: !315, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !415, file: !6, line: 434, baseType: !419, size: 192, offset: 64)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 192, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 3)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !322, file: !6, line: 525, baseType: !423, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!311, !311}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !322, file: !6, line: 528, baseType: !428, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !429, file: !6, line: 469, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !311, !441, !449}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !436, line: 69, baseType: !437)
!436 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !438, line: 32, baseType: !439)
!438 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !353, line: 49, baseType: !440)
!440 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !443, file: !6, line: 457, baseType: !312, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !443, file: !6, line: 458, baseType: !350, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !443, file: !6, line: 459, baseType: !448, size: 32, offset: 128)
!448 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !436, line: 70, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !451, line: 30, baseType: !354)
!451 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!452 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !322, file: !6, line: 531, baseType: !453, size: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !6, line: 537, baseType: !453, size: 64, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !322, file: !6, line: 540, baseType: !457, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !458, file: !6, line: 776, baseType: !315, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !458, file: !6, line: 777, baseType: !364, size: 192, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_instance_t", file: !465, line: 38, baseType: !466)
!465 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtype.h", directory: "")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_instance_t", file: !465, line: 33, size: 256, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !466, file: !465, line: 34, baseType: !315, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !466, file: !465, line: 35, baseType: !364, size: 192, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "subobj", scope: !466, file: !465, line: 36, baseType: !471, offset: 256)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: -1)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_super_t", file: !478, line: 1224, baseType: !479)
!478 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtype.c", directory: "")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_super_t", file: !478, line: 1220, size: 192, elements: !480)
!480 = !{!481, !482, !483}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !479, file: !478, line: 1221, baseType: !315, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !478, line: 1222, baseType: !311, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !479, file: !478, line: 1223, baseType: !311, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_static_class_method_t", file: !6, line: 842, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_static_class_method_t", file: !6, line: 839, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !486, file: !6, line: 840, baseType: !315, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !486, file: !6, line: 841, baseType: !311, size: 64, offset: 64)
!490 = !{!0, !491, !500, !502, !504, !527, !529, !531, !533}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "mp_binary_op_method_name", scope: !2, file: !478, line: 480, type: !493, isLocal: false, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 280, elements: !498)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !496, line: 39, baseType: !497)
!496 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!497 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!498 = !{!499}
!499 = !DISubrange(count: 35)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "mp_type_type", scope: !2, file: !478, line: 1103, type: !320, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "mp_type_super", scope: !2, file: !478, line: 1338, type: !320, isLocal: false, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "mp_builtin_issubclass_obj", scope: !2, file: !478, line: 1426, type: !506, isLocal: false, isDefinition: true)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !6, line: 795, baseType: !315, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !508, file: !6, line: 801, baseType: !512, size: 64, offset: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !6, line: 796, size: 64, elements: !513)
!513 = !{!514, !519, !520, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !512, file: !6, line: 797, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!311}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !512, file: !6, line: 798, baseType: !423, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !512, file: !6, line: 799, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!311, !311, !311}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !512, file: !6, line: 800, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !405)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "mp_builtin_isinstance_obj", scope: !2, file: !478, line: 1432, type: !506, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "mp_type_staticmethod", scope: !2, file: !478, line: 1459, type: !320, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "mp_type_classmethod", scope: !2, file: !478, line: 1465, type: !320, isLocal: false, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "native_base_init_wrapper_obj", scope: !2, file: !478, line: 100, type: !535, isLocal: true, isDefinition: true)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !538)
!538 = !{!539, !540, !542, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !537, file: !6, line: 806, baseType: !315, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !537, file: !6, line: 807, baseType: !541, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!541 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !537, file: !6, line: 808, baseType: !449, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !537, file: !6, line: 809, baseType: !449, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !537, file: !6, line: 813, baseType: !545, size: 64, offset: 128)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !6, line: 810, size: 64, elements: !546)
!546 = !{!547, !552}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !545, file: !6, line: 811, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!311, !350, !361}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !545, file: !6, line: 812, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!311, !350, !361, !363}
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 72, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 9)
!560 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!561 = !{i32 2, !"Dwarf Version", i32 4}
!562 = !{i32 2, !"Debug Info Version", i32 3}
!563 = !{i32 1, !"wchar_size", i32 4}
!564 = !{i32 7, !"PIC Level", i32 2}
!565 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!566 = distinct !DISubprogram(name: "mp_obj_assert_native_inited", scope: !478, file: !478, line: 124, type: !567, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !311}
!569 = !{!570}
!570 = !DILocalVariable(name: "native_object", arg: 1, scope: !566, file: !478, line: 124, type: !311)
!571 = !DILocation(line: 124, column: 43, scope: !566)
!572 = !DILocation(line: 125, column: 23, scope: !573)
!573 = distinct !DILexicalBlock(scope: !566, file: !478, line: 125, column: 9)
!574 = !DILocation(line: 125, column: 9, scope: !566)
!575 = !DILocation(line: 126, column: 38, scope: !576)
!576 = distinct !DILexicalBlock(scope: !573, file: !478, line: 125, column: 74)
!577 = !DILocation(line: 126, column: 9, scope: !576)
!578 = !DILocation(line: 128, column: 1, scope: !566)
!579 = distinct !DISubprogram(name: "mp_obj_instance_make_new", scope: !478, file: !478, line: 297, type: !359, scopeLine: 297, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !580)
!580 = !{!581, !582, !583, !584, !585, !589, !597, !598, !599, !600, !603, !609, !611, !614}
!581 = !DILocalVariable(name: "self", arg: 1, scope: !579, file: !478, line: 297, type: !319)
!582 = !DILocalVariable(name: "n_args", arg: 2, scope: !579, file: !478, line: 297, type: !350)
!583 = !DILocalVariable(name: "args", arg: 3, scope: !579, file: !478, line: 297, type: !361)
!584 = !DILocalVariable(name: "kw_args", arg: 4, scope: !579, file: !478, line: 297, type: !363)
!585 = !DILocalVariable(name: "init_fn", scope: !579, file: !478, line: 301, type: !586)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 128, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 2)
!589 = !DILocalVariable(name: "lookup", scope: !579, file: !478, line: 302, type: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "class_lookup_data", file: !478, line: 144, size: 320, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !590, file: !478, line: 145, baseType: !463, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !590, file: !478, line: 146, baseType: !402, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "meth_offset", scope: !590, file: !478, line: 147, baseType: !350, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !590, file: !478, line: 148, baseType: !313, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "is_type", scope: !590, file: !478, line: 149, baseType: !541, size: 8, offset: 256)
!597 = !DILocalVariable(name: "native_base", scope: !579, file: !478, line: 311, type: !319)
!598 = !DILocalVariable(name: "o", scope: !579, file: !478, line: 312, type: !463)
!599 = !DILocalVariable(name: "n_kw", scope: !579, file: !478, line: 313, type: !350)
!600 = !DILocalVariable(name: "new_ret", scope: !601, file: !478, line: 330, type: !311)
!601 = distinct !DILexicalBlock(scope: !602, file: !478, line: 328, column: 12)
!602 = distinct !DILexicalBlock(scope: !579, file: !478, line: 317, column: 9)
!603 = !DILocalVariable(name: "args2", scope: !604, file: !478, line: 332, type: !606)
!604 = distinct !DILexicalBlock(scope: !605, file: !478, line: 331, column: 39)
!605 = distinct !DILexicalBlock(scope: !601, file: !478, line: 331, column: 13)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 64, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 1)
!609 = !DILocalVariable(name: "args2", scope: !610, file: !478, line: 336, type: !313)
!610 = distinct !DILexicalBlock(scope: !605, file: !478, line: 334, column: 16)
!611 = !DILocalVariable(name: "init_ret", scope: !612, file: !478, line: 365, type: !311)
!612 = distinct !DILexicalBlock(scope: !613, file: !478, line: 364, column: 36)
!613 = distinct !DILexicalBlock(scope: !579, file: !478, line: 364, column: 9)
!614 = !DILocalVariable(name: "args2", scope: !615, file: !478, line: 370, type: !313)
!615 = distinct !DILexicalBlock(scope: !616, file: !478, line: 368, column: 16)
!616 = distinct !DILexicalBlock(scope: !612, file: !478, line: 366, column: 13)
!617 = !DILocation(line: 297, column: 56, scope: !579)
!618 = !DILocation(line: 297, column: 69, scope: !579)
!619 = !DILocation(line: 297, column: 93, scope: !579)
!620 = !DILocation(line: 297, column: 109, scope: !579)
!621 = !DILocation(line: 301, column: 5, scope: !579)
!622 = !DILocation(line: 301, column: 14, scope: !579)
!623 = !DILocation(line: 302, column: 5, scope: !579)
!624 = !DILocation(line: 302, column: 39, scope: !579)
!625 = !{!626, !627, i64 0}
!626 = !{!"class_lookup_data", !627, i64 0, !630, i64 8, !630, i64 16, !627, i64 24, !631, i64 32}
!627 = !{!"any pointer", !628, i64 0}
!628 = !{!"omnipotent char", !629, i64 0}
!629 = !{!"Simple C/C++ TBAA"}
!630 = !{!"long", !628, i64 0}
!631 = !{!"_Bool", !628, i64 0}
!632 = !{!626, !630, i64 8}
!633 = !{!626, !630, i64 16}
!634 = !DILocation(line: 306, column: 17, scope: !579)
!635 = !{!626, !627, i64 24}
!636 = !{!626, !631, i64 32}
!637 = !DILocation(line: 302, column: 30, scope: !579)
!638 = !DILocation(line: 309, column: 5, scope: !579)
!639 = !DILocation(line: 311, column: 5, scope: !579)
!640 = !DILocation(line: 311, column: 26, scope: !579)
!641 = !{!627, !627, i64 0}
!642 = !DILocation(line: 313, column: 12, scope: !579)
!643 = !DILocation(line: 314, column: 17, scope: !644)
!644 = distinct !DILexicalBlock(scope: !579, file: !478, line: 314, column: 9)
!645 = !DILocation(line: 314, column: 9, scope: !579)
!646 = !DILocation(line: 315, column: 25, scope: !647)
!647 = distinct !DILexicalBlock(scope: !644, file: !478, line: 314, column: 23)
!648 = !DILocation(line: 316, column: 5, scope: !647)
!649 = !DILocation(line: 0, scope: !579)
!650 = !DILocation(line: 317, column: 9, scope: !602)
!651 = !DILocation(line: 317, column: 35, scope: !602)
!652 = !DILocation(line: 320, column: 13, scope: !653)
!653 = distinct !DILexicalBlock(scope: !602, file: !478, line: 317, column: 69)
!654 = !DILocation(line: 312, column: 24, scope: !579)
!655 = !DILocation(line: 328, column: 5, scope: !653)
!656 = !DILocation(line: 331, column: 25, scope: !605)
!657 = !DILocation(line: 332, column: 13, scope: !604)
!658 = !DILocation(line: 332, column: 22, scope: !604)
!659 = !DILocation(line: 332, column: 33, scope: !604)
!660 = !DILocation(line: 333, column: 63, scope: !604)
!661 = !DILocation(line: 333, column: 23, scope: !604)
!662 = !DILocation(line: 330, column: 18, scope: !601)
!663 = !DILocation(line: 334, column: 9, scope: !605)
!664 = !DILocation(line: 334, column: 9, scope: !604)
!665 = !DILocation(line: 336, column: 31, scope: !610)
!666 = !DILocation(line: 336, column: 23, scope: !610)
!667 = !DILocation(line: 337, column: 22, scope: !610)
!668 = !DILocation(line: 338, column: 13, scope: !610)
!669 = !DILocation(line: 340, column: 13, scope: !610)
!670 = !{!671, !627, i64 16}
!671 = !{!"_mp_map_t", !630, i64 0, !630, i64 0, !630, i64 0, !630, i64 0, !630, i64 0, !630, i64 8, !627, i64 16}
!672 = !DILocation(line: 341, column: 45, scope: !610)
!673 = !DILocation(line: 341, column: 23, scope: !610)
!674 = !DILocation(line: 342, column: 13, scope: !610)
!675 = !DILocation(line: 0, scope: !605)
!676 = !DILocation(line: 348, column: 13, scope: !677)
!677 = distinct !DILexicalBlock(scope: !601, file: !478, line: 348, column: 13)
!678 = !DILocation(line: 348, column: 38, scope: !677)
!679 = !DILocation(line: 348, column: 13, scope: !601)
!680 = !DILocation(line: 359, column: 18, scope: !579)
!681 = !DILocation(line: 360, column: 16, scope: !579)
!682 = !DILocation(line: 359, column: 16, scope: !579)
!683 = !DILocation(line: 361, column: 17, scope: !579)
!684 = !DILocation(line: 362, column: 24, scope: !579)
!685 = !DILocation(line: 363, column: 5, scope: !579)
!686 = !DILocation(line: 364, column: 9, scope: !613)
!687 = !DILocation(line: 364, column: 20, scope: !613)
!688 = !DILocation(line: 364, column: 9, scope: !579)
!689 = !DILocation(line: 366, column: 20, scope: !616)
!690 = !DILocation(line: 366, column: 25, scope: !616)
!691 = !DILocation(line: 367, column: 24, scope: !692)
!692 = distinct !DILexicalBlock(scope: !616, file: !478, line: 366, column: 45)
!693 = !DILocation(line: 365, column: 18, scope: !612)
!694 = !DILocation(line: 368, column: 9, scope: !692)
!695 = !DILocation(line: 370, column: 31, scope: !615)
!696 = !DILocation(line: 370, column: 23, scope: !615)
!697 = !DILocation(line: 371, column: 24, scope: !615)
!698 = !DILocation(line: 371, column: 22, scope: !615)
!699 = !DILocation(line: 372, column: 24, scope: !615)
!700 = !DILocation(line: 372, column: 13, scope: !615)
!701 = !DILocation(line: 372, column: 22, scope: !615)
!702 = !DILocation(line: 374, column: 13, scope: !615)
!703 = !DILocation(line: 375, column: 13, scope: !615)
!704 = !DILocation(line: 376, column: 24, scope: !615)
!705 = !DILocation(line: 377, column: 13, scope: !615)
!706 = !DILocation(line: 0, scope: !616)
!707 = !DILocation(line: 379, column: 22, scope: !708)
!708 = distinct !DILexicalBlock(scope: !612, file: !478, line: 379, column: 13)
!709 = !DILocation(line: 379, column: 13, scope: !612)
!710 = !DILocation(line: 381, column: 36, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !478, line: 380, column: 75)
!712 = distinct !DILexicalBlock(scope: !713, file: !478, line: 380, column: 17)
!713 = distinct !DILexicalBlock(scope: !708, file: !478, line: 379, column: 40)
!714 = !DILocation(line: 381, column: 17, scope: !711)
!715 = !DILocation(line: 392, column: 9, scope: !716)
!716 = distinct !DILexicalBlock(scope: !579, file: !478, line: 392, column: 9)
!717 = !DILocation(line: 392, column: 21, scope: !716)
!718 = !DILocation(line: 392, column: 29, scope: !716)
!719 = !DILocation(line: 392, column: 32, scope: !716)
!720 = !DILocation(line: 392, column: 45, scope: !716)
!721 = !DILocation(line: 392, column: 9, scope: !579)
!722 = !DILocation(line: 393, column: 37, scope: !723)
!723 = distinct !DILexicalBlock(scope: !716, file: !478, line: 392, column: 96)
!724 = !DILocation(line: 393, column: 24, scope: !723)
!725 = !{!726, !627, i64 24}
!726 = !{!"_mp_obj_type_t", !727, i64 0, !728, i64 8, !728, i64 10, !627, i64 16, !627, i64 24, !627, i64 32, !627, i64 40, !627, i64 48, !627, i64 56, !627, i64 64, !627, i64 72, !627, i64 80, !729, i64 88, !627, i64 96, !627, i64 104, !627, i64 112}
!727 = !{!"_mp_obj_base_t", !627, i64 0}
!728 = !{!"short", !628, i64 0}
!729 = !{!"_mp_buffer_p_t", !627, i64 0}
!730 = !DILocation(line: 393, column: 22, scope: !723)
!731 = !DILocation(line: 394, column: 5, scope: !723)
!732 = !DILocation(line: 396, column: 12, scope: !579)
!733 = !DILocation(line: 396, column: 5, scope: !579)
!734 = !DILocation(line: 397, column: 1, scope: !579)
!735 = distinct !DISubprogram(name: "mp_obj_class_lookup", scope: !478, file: !478, line: 152, type: !736, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !739)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !738, !319}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!739 = !{!740, !741, !742, !748, !749, !754, !757, !758, !771, !772, !773}
!740 = !DILocalVariable(name: "lookup", arg: 1, scope: !735, file: !478, line: 152, type: !738)
!741 = !DILocalVariable(name: "type", arg: 2, scope: !735, file: !478, line: 152, type: !319)
!742 = !DILocalVariable(name: "locals_map", scope: !743, file: !478, line: 176, type: !363)
!743 = distinct !DILexicalBlock(scope: !744, file: !478, line: 173, column: 40)
!744 = distinct !DILexicalBlock(scope: !745, file: !478, line: 173, column: 13)
!745 = distinct !DILexicalBlock(scope: !746, file: !478, line: 155, column: 14)
!746 = distinct !DILexicalBlock(scope: !747, file: !478, line: 155, column: 5)
!747 = distinct !DILexicalBlock(scope: !735, file: !478, line: 155, column: 5)
!748 = !DILocalVariable(name: "elem", scope: !743, file: !478, line: 177, type: !374)
!749 = !DILocalVariable(name: "org_type", scope: !750, file: !478, line: 182, type: !319)
!750 = distinct !DILexicalBlock(scope: !751, file: !478, line: 179, column: 38)
!751 = distinct !DILexicalBlock(scope: !752, file: !478, line: 179, column: 21)
!752 = distinct !DILexicalBlock(scope: !753, file: !478, line: 178, column: 31)
!753 = distinct !DILexicalBlock(scope: !743, file: !478, line: 178, column: 17)
!754 = !DILocalVariable(name: "obj", scope: !755, file: !478, line: 188, type: !463)
!755 = distinct !DILexicalBlock(scope: !756, file: !478, line: 187, column: 24)
!756 = distinct !DILexicalBlock(scope: !751, file: !478, line: 184, column: 28)
!757 = !DILocalVariable(name: "obj_obj", scope: !755, file: !478, line: 189, type: !311)
!758 = !DILocalVariable(name: "parent_tuple", scope: !759, file: !478, line: 225, type: !762)
!759 = distinct !DILexicalBlock(scope: !760, file: !478, line: 224, column: 76)
!760 = distinct !DILexicalBlock(scope: !761, file: !478, line: 224, column: 20)
!761 = distinct !DILexicalBlock(scope: !745, file: !478, line: 220, column: 13)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !765, line: 35, baseType: !766)
!765 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objtuple.h", directory: "")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !765, line: 31, size: 128, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !765, line: 32, baseType: !315, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !766, file: !765, line: 33, baseType: !350, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !766, file: !765, line: 34, baseType: !471, offset: 128)
!771 = !DILocalVariable(name: "item", scope: !759, file: !478, line: 226, type: !361)
!772 = !DILocalVariable(name: "top", scope: !759, file: !478, line: 227, type: !361)
!773 = !DILocalVariable(name: "bt", scope: !774, file: !478, line: 230, type: !462)
!774 = distinct !DILexicalBlock(scope: !775, file: !478, line: 228, column: 40)
!775 = distinct !DILexicalBlock(scope: !776, file: !478, line: 228, column: 13)
!776 = distinct !DILexicalBlock(scope: !759, file: !478, line: 228, column: 13)
!777 = !DILocation(line: 152, column: 60, scope: !735)
!778 = !DILocation(line: 152, column: 89, scope: !735)
!779 = !DILocation(line: 0, scope: !780)
!780 = distinct !DILexicalBlock(scope: !745, file: !478, line: 161, column: 13)
!781 = !DILocation(line: 0, scope: !743)
!782 = !DILocation(line: 0, scope: !783)
!783 = distinct !DILexicalBlock(scope: !745, file: !478, line: 211, column: 13)
!784 = !DILocation(line: 0, scope: !785)
!785 = distinct !DILexicalBlock(scope: !783, file: !478, line: 211, column: 144)
!786 = !DILocation(line: 0, scope: !787)
!787 = distinct !DILexicalBlock(scope: !774, file: !478, line: 236, column: 21)
!788 = !DILocation(line: 155, column: 5, scope: !735)
!789 = !DILocation(line: 161, column: 21, scope: !780)
!790 = !DILocation(line: 161, column: 33, scope: !780)
!791 = !DILocation(line: 161, column: 38, scope: !780)
!792 = !DILocation(line: 161, column: 41, scope: !780)
!793 = !DILocation(line: 161, column: 13, scope: !745)
!794 = !DILocation(line: 164, column: 27, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !478, line: 164, column: 17)
!796 = distinct !DILexicalBlock(scope: !780, file: !478, line: 161, column: 70)
!797 = !DILocation(line: 164, column: 39, scope: !795)
!798 = !DILocation(line: 164, column: 17, scope: !795)
!799 = !DILocation(line: 164, column: 62, scope: !795)
!800 = !DILocation(line: 164, column: 17, scope: !796)
!801 = !DILocation(line: 168, column: 25, scope: !802)
!802 = distinct !DILexicalBlock(scope: !795, file: !478, line: 164, column: 71)
!803 = !DILocation(line: 168, column: 33, scope: !802)
!804 = !DILocation(line: 169, column: 17, scope: !802)
!805 = !DILocation(line: 173, column: 19, scope: !744)
!806 = !{!726, !627, i64 112}
!807 = !DILocation(line: 173, column: 31, scope: !744)
!808 = !DILocation(line: 173, column: 13, scope: !745)
!809 = !DILocation(line: 176, column: 56, scope: !743)
!810 = !DILocation(line: 176, column: 23, scope: !743)
!811 = !DILocation(line: 177, column: 61, scope: !743)
!812 = !DILocation(line: 177, column: 35, scope: !743)
!813 = !DILocation(line: 177, column: 28, scope: !743)
!814 = !DILocation(line: 178, column: 22, scope: !753)
!815 = !DILocation(line: 178, column: 17, scope: !743)
!816 = !DILocation(line: 179, column: 29, scope: !751)
!817 = !{i8 0, i8 2}
!818 = !DILocation(line: 179, column: 21, scope: !752)
!819 = !DILocation(line: 182, column: 83, scope: !750)
!820 = !DILocation(line: 182, column: 42, scope: !750)
!821 = !DILocation(line: 183, column: 75, scope: !750)
!822 = !{!823, !627, i64 8}
!823 = !{!"_mp_map_elem_t", !627, i64 0, !627, i64 8}
!824 = !DILocation(line: 183, column: 90, scope: !750)
!825 = !DILocation(line: 183, column: 21, scope: !750)
!826 = !DILocation(line: 184, column: 28, scope: !756)
!827 = !{!727, !627, i64 0}
!828 = !DILocation(line: 184, column: 28, scope: !751)
!829 = !DILocation(line: 185, column: 29, scope: !830)
!830 = distinct !DILexicalBlock(scope: !756, file: !478, line: 184, column: 76)
!831 = !DILocation(line: 185, column: 37, scope: !830)
!832 = !DILocation(line: 188, column: 54, scope: !755)
!833 = !DILocation(line: 188, column: 40, scope: !755)
!834 = !DILocation(line: 190, column: 29, scope: !835)
!835 = distinct !DILexicalBlock(scope: !755, file: !478, line: 190, column: 25)
!836 = !DILocation(line: 190, column: 37, scope: !835)
!837 = !DILocation(line: 190, column: 40, scope: !835)
