; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/objtype.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/objtype.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_bool_t = type opaque
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct.class_lookup_data = type { %struct._mp_obj_instance_t*, i64, i64, i8**, i8 }
%struct._mp_obj_instance_t = type { %struct._mp_obj_base_t, %struct._mp_map_t, [0 x i8*] }

!229 = !DIEnumerator(name: "MP_QSTR_index", value: 157)
!230 = !DIEnumerator(name: "MP_QSTR_insert", value: 158)
!231 = !DIEnumerator(name: "MP_QSTR_int", value: 159)
!232 = !DIEnumerator(name: "MP_QSTR_isalpha", value: 160)
!233 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!234 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!235 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!236 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!237 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!238 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!239 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!240 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!241 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!242 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!243 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!244 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!245 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!246 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!247 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!248 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!249 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!250 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!251 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!252 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!253 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!254 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!255 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!256 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!257 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!258 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!259 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!260 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!261 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!262 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!263 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!264 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!265 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!266 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!267 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!268 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!269 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!270 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!271 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!272 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!273 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!274 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!275 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!276 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!277 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!278 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!279 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!280 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!281 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!282 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!283 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!284 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!285 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!286 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!287 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!288 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!289 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!290 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!291 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!292 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!293 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!294 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!295 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!296 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!297 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!298 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!299 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!300 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!301 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!302 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mp_map_lookup_kind_t", file: !6, line: 377, size: 32, elements: !304)
!304 = !{!305, !306, !307, !308}
!305 = !DIEnumerator(name: "MP_MAP_LOOKUP", value: 0)
!306 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND", value: 1)
!307 = !DIEnumerator(name: "MP_MAP_LOOKUP_REMOVE_IF_FOUND", value: 2)
!308 = !DIEnumerator(name: "MP_MAP_LOOKUP_ADD_IF_NOT_FOUND_OR_REMOVE_IF_FOUND", value: 3)
!309 = !{!310, !311, !312, !313, !461, !448, !462, !473, !474, !318, !434, !475, !482}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !316)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !6, line: 57, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !322)
!322 = !{!323, !324, !328, !329, !355, !379, !384, !390, !396, !402, !407, !421, !426, !451, !454, !455}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !321, file: !6, line: 476, baseType: !314, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !6, line: 479, baseType: !325, size: 16, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !326, line: 31, baseType: !327)
!326 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!327 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !6, line: 482, baseType: !325, size: 16, offset: 80)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !321, file: !6, line: 485, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !334, !310, !354}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !337, line: 53, baseType: !338)
!337 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !337, line: 50, size: 128, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !337, line: 51, baseType: !311, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !338, file: !337, line: 52, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !337, line: 48, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !311, !346, !349}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !350, line: 31, baseType: !351)
!350 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !352, line: 92, baseType: !353)
!352 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!353 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !321, file: !6, line: 488, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!310, !318, !349, !360, !362}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !364, file: !6, line: 366, baseType: !349, size: 1, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !364, file: !6, line: 367, baseType: !349, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !364, file: !6, line: 368, baseType: !349, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !364, file: !6, line: 369, baseType: !349, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !364, file: !6, line: 371, baseType: !349, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !364, file: !6, line: 372, baseType: !349, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !364, file: !6, line: 373, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !375, file: !6, line: 351, baseType: !310, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !375, file: !6, line: 352, baseType: !310, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !321, file: !6, line: 491, baseType: !380, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!310, !310, !349, !349, !360}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !321, file: !6, line: 495, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!310, !389, !310}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !321, file: !6, line: 496, baseType: !391, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!310, !395, !310, !310}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !321, file: !6, line: 509, baseType: !397, size: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !310, !401, !312}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !70, line: 48, baseType: !349)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !321, file: !6, line: 516, baseType: !403, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!310, !310, !310, !310}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !321, file: !6, line: 521, baseType: !408, size: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!310, !310, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !414, file: !6, line: 433, baseType: !314, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !414, file: !6, line: 434, baseType: !418, size: 192, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 192, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 3)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !321, file: !6, line: 525, baseType: !422, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!310, !310}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !321, file: !6, line: 528, baseType: !427, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !428, file: !6, line: 469, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !310, !440, !448}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !435, line: 70, baseType: !436)
!435 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !437, line: 32, baseType: !438)
!437 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !352, line: 49, baseType: !439)
!439 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !442, file: !6, line: 457, baseType: !311, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !442, file: !6, line: 458, baseType: !349, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !442, file: !6, line: 459, baseType: !447, size: 32, offset: 128)
!447 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !435, line: 71, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !450, line: 30, baseType: !353)
!450 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !321, file: !6, line: 531, baseType: !452, size: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !321, file: !6, line: 537, baseType: !452, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !321, file: !6, line: 540, baseType: !456, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !457, file: !6, line: 776, baseType: !314, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !457, file: !6, line: 777, baseType: !363, size: 192, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_instance_t", file: !464, line: 38, baseType: !465)
!464 = !DIFile(filename: "../../py/objtype.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_instance_t", file: !464, line: 33, size: 256, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !465, file: !464, line: 34, baseType: !314, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !465, file: !464, line: 35, baseType: !363, size: 192, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "subobj", scope: !465, file: !464, line: 36, baseType: !470, offset: 256)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: -1)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_super_t", file: !3, line: 1224, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_super_t", file: !3, line: 1220, size: 192, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !477, file: !3, line: 1221, baseType: !314, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !3, line: 1222, baseType: !310, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !477, file: !3, line: 1223, baseType: !310, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_static_class_method_t", file: !6, line: 842, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_static_class_method_t", file: !6, line: 839, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !484, file: !6, line: 840, baseType: !314, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !484, file: !6, line: 841, baseType: !310, size: 64, offset: 64)
!488 = !{!0, !489, !498, !500, !502, !525, !527, !529, !531}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "mp_binary_op_method_name", scope: !2, file: !3, line: 480, type: !491, isLocal: false, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 280, elements: !496)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !494, line: 39, baseType: !495)
!494 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!495 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!496 = !{!497}
!497 = !DISubrange(count: 35)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "mp_type_type", scope: !2, file: !3, line: 1103, type: !319, isLocal: false, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "mp_type_super", scope: !2, file: !3, line: 1338, type: !319, isLocal: false, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "mp_builtin_issubclass_obj", scope: !2, file: !3, line: 1426, type: !504, isLocal: false, isDefinition: true)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !506, file: !6, line: 795, baseType: !314, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !506, file: !6, line: 801, baseType: !510, size: 64, offset: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !6, line: 796, size: 64, elements: !511)
!511 = !{!512, !517, !518, !523}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !510, file: !6, line: 797, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!310}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !510, file: !6, line: 798, baseType: !422, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !510, file: !6, line: 799, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!310, !310, !310}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !510, file: !6, line: 800, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !404)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "mp_builtin_isinstance_obj", scope: !2, file: !3, line: 1432, type: !504, isLocal: false, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "mp_type_staticmethod", scope: !2, file: !3, line: 1459, type: !319, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "mp_type_classmethod", scope: !2, file: !3, line: 1465, type: !319, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "native_base_init_wrapper_obj", scope: !2, file: !3, line: 100, type: !533, isLocal: true, isDefinition: true)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !536)
!536 = !{!537, !538, !540, !541, !542}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !535, file: !6, line: 806, baseType: !314, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !535, file: !6, line: 807, baseType: !539, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!539 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !535, file: !6, line: 808, baseType: !448, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !535, file: !6, line: 809, baseType: !448, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !535, file: !6, line: 813, baseType: !543, size: 64, offset: 128)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !6, line: 810, size: 64, elements: !544)
!544 = !{!545, !550}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !543, file: !6, line: 811, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!310, !349, !360}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !543, file: !6, line: 812, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!310, !349, !360, !362}
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 72, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 9)
!558 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!559 = !{i32 2, !"Dwarf Version", i32 4}
!560 = !{i32 2, !"Debug Info Version", i32 3}
!561 = !{i32 1, !"wchar_size", i32 4}
!562 = !{i32 7, !"PIC Level", i32 2}
!563 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!564 = distinct !DISubprogram(name: "mp_obj_assert_native_inited", scope: !3, file: !3, line: 124, type: !565, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !310}
!567 = !{!568}
!568 = !DILocalVariable(name: "native_object", arg: 1, scope: !564, file: !3, line: 124, type: !310)
!569 = !DILocation(line: 124, column: 43, scope: !564)
!570 = !DILocation(line: 125, column: 23, scope: !571)
!571 = distinct !DILexicalBlock(scope: !564, file: !3, line: 125, column: 9)
!572 = !DILocation(line: 125, column: 9, scope: !564)
!573 = !DILocation(line: 126, column: 38, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !3, line: 125, column: 74)
!575 = !DILocation(line: 126, column: 9, scope: !574)
!576 = !DILocation(line: 128, column: 1, scope: !564)
!577 = distinct !DISubprogram(name: "mp_obj_instance_make_new", scope: !3, file: !3, line: 297, type: !358, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !578)
!578 = !{!579, !580, !581, !582, !583, !587, !595, !596, !597, !598, !601, !607, !609, !612}
!579 = !DILocalVariable(name: "self", arg: 1, scope: !577, file: !3, line: 297, type: !318)
!580 = !DILocalVariable(name: "n_args", arg: 2, scope: !577, file: !3, line: 297, type: !349)
!581 = !DILocalVariable(name: "args", arg: 3, scope: !577, file: !3, line: 297, type: !360)
!582 = !DILocalVariable(name: "kw_args", arg: 4, scope: !577, file: !3, line: 297, type: !362)
!583 = !DILocalVariable(name: "init_fn", scope: !577, file: !3, line: 301, type: !584)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 128, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 2)
!587 = !DILocalVariable(name: "lookup", scope: !577, file: !3, line: 302, type: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "class_lookup_data", file: !3, line: 144, size: 320, elements: !589)
!589 = !{!590, !591, !592, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !588, file: !3, line: 145, baseType: !462, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !588, file: !3, line: 146, baseType: !401, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "meth_offset", scope: !588, file: !3, line: 147, baseType: !349, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !588, file: !3, line: 148, baseType: !312, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "is_type", scope: !588, file: !3, line: 149, baseType: !539, size: 8, offset: 256)
!595 = !DILocalVariable(name: "native_base", scope: !577, file: !3, line: 311, type: !318)
!596 = !DILocalVariable(name: "o", scope: !577, file: !3, line: 312, type: !462)
!597 = !DILocalVariable(name: "n_kw", scope: !577, file: !3, line: 313, type: !349)
!598 = !DILocalVariable(name: "new_ret", scope: !599, file: !3, line: 330, type: !310)
!599 = distinct !DILexicalBlock(scope: !600, file: !3, line: 328, column: 12)
!600 = distinct !DILexicalBlock(scope: !577, file: !3, line: 317, column: 9)
!601 = !DILocalVariable(name: "args2", scope: !602, file: !3, line: 332, type: !604)
!602 = distinct !DILexicalBlock(scope: !603, file: !3, line: 331, column: 39)
!603 = distinct !DILexicalBlock(scope: !599, file: !3, line: 331, column: 13)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 64, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 1)
!607 = !DILocalVariable(name: "args2", scope: !608, file: !3, line: 336, type: !312)
!608 = distinct !DILexicalBlock(scope: !603, file: !3, line: 334, column: 16)
!609 = !DILocalVariable(name: "init_ret", scope: !610, file: !3, line: 365, type: !310)
!610 = distinct !DILexicalBlock(scope: !611, file: !3, line: 364, column: 36)
!611 = distinct !DILexicalBlock(scope: !577, file: !3, line: 364, column: 9)
!612 = !DILocalVariable(name: "args2", scope: !613, file: !3, line: 370, type: !312)
!613 = distinct !DILexicalBlock(scope: !614, file: !3, line: 368, column: 16)
!614 = distinct !DILexicalBlock(scope: !610, file: !3, line: 366, column: 13)
!615 = !DILocation(line: 297, column: 56, scope: !577)
!616 = !DILocation(line: 297, column: 69, scope: !577)
!617 = !DILocation(line: 297, column: 93, scope: !577)
!618 = !DILocation(line: 297, column: 109, scope: !577)
!619 = !DILocation(line: 301, column: 5, scope: !577)
!620 = !DILocation(line: 301, column: 14, scope: !577)
!621 = !DILocation(line: 302, column: 5, scope: !577)
!622 = !DILocation(line: 302, column: 39, scope: !577)
!623 = !{!624, !625, i64 0}
!624 = !{!"class_lookup_data", !625, i64 0, !628, i64 8, !628, i64 16, !625, i64 24, !629, i64 32}
!625 = !{!"any pointer", !626, i64 0}
!626 = !{!"omnipotent char", !627, i64 0}
!627 = !{!"Simple C/C++ TBAA"}
!628 = !{!"long", !626, i64 0}
!629 = !{!"_Bool", !626, i64 0}
!630 = !{!624, !628, i64 8}
!631 = !{!624, !628, i64 16}
!632 = !DILocation(line: 306, column: 17, scope: !577)
!633 = !{!624, !625, i64 24}
!634 = !{!624, !629, i64 32}
!635 = !DILocation(line: 302, column: 30, scope: !577)
!636 = !DILocation(line: 309, column: 5, scope: !577)
!637 = !DILocation(line: 311, column: 5, scope: !577)
!638 = !DILocation(line: 311, column: 26, scope: !577)
!639 = !{!625, !625, i64 0}
!640 = !DILocation(line: 313, column: 12, scope: !577)
!641 = !DILocation(line: 314, column: 17, scope: !642)
!642 = distinct !DILexicalBlock(scope: !577, file: !3, line: 314, column: 9)
!643 = !DILocation(line: 314, column: 9, scope: !577)
!644 = !DILocation(line: 315, column: 25, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !3, line: 314, column: 23)
!646 = !DILocation(line: 316, column: 5, scope: !645)
!647 = !DILocation(line: 0, scope: !577)
!648 = !DILocation(line: 317, column: 9, scope: !600)
!649 = !DILocation(line: 317, column: 35, scope: !600)
!650 = !DILocation(line: 320, column: 13, scope: !651)
!651 = distinct !DILexicalBlock(scope: !600, file: !3, line: 317, column: 69)
!652 = !DILocation(line: 312, column: 24, scope: !577)
!653 = !DILocation(line: 328, column: 5, scope: !651)
!654 = !DILocation(line: 331, column: 25, scope: !603)
!655 = !DILocation(line: 332, column: 13, scope: !602)
!656 = !DILocation(line: 332, column: 22, scope: !602)
!657 = !DILocation(line: 332, column: 33, scope: !602)
!658 = !DILocation(line: 333, column: 63, scope: !602)
!659 = !DILocation(line: 333, column: 23, scope: !602)
!660 = !DILocation(line: 330, column: 18, scope: !599)
!661 = !DILocation(line: 334, column: 9, scope: !603)
!662 = !DILocation(line: 334, column: 9, scope: !602)
!663 = !DILocation(line: 336, column: 31, scope: !608)
!664 = !DILocation(line: 336, column: 23, scope: !608)
!665 = !DILocation(line: 337, column: 22, scope: !608)
!666 = !DILocation(line: 338, column: 13, scope: !608)
!667 = !DILocation(line: 340, column: 13, scope: !608)
!668 = !{!669, !625, i64 16}
!669 = !{!"_mp_map_t", !628, i64 0, !628, i64 0, !628, i64 0, !628, i64 0, !628, i64 0, !628, i64 8, !625, i64 16}
!670 = !DILocation(line: 341, column: 45, scope: !608)
!671 = !DILocation(line: 341, column: 23, scope: !608)
!672 = !DILocation(line: 342, column: 13, scope: !608)
!673 = !DILocation(line: 0, scope: !608)
!674 = !DILocation(line: 348, column: 13, scope: !675)
!675 = distinct !DILexicalBlock(scope: !599, file: !3, line: 348, column: 13)
!676 = !DILocation(line: 348, column: 38, scope: !675)
!677 = !DILocation(line: 353, column: 13, scope: !599)
!678 = !DILocation(line: 359, column: 18, scope: !577)
!679 = !DILocation(line: 360, column: 16, scope: !577)
!680 = !DILocation(line: 359, column: 16, scope: !577)
!681 = !DILocation(line: 361, column: 17, scope: !577)
!682 = !DILocation(line: 362, column: 24, scope: !577)
!683 = !DILocation(line: 363, column: 5, scope: !577)
!684 = !DILocation(line: 364, column: 9, scope: !611)
!685 = !DILocation(line: 364, column: 20, scope: !611)
!686 = !DILocation(line: 364, column: 9, scope: !577)
!687 = !DILocation(line: 366, column: 20, scope: !614)
!688 = !DILocation(line: 366, column: 25, scope: !614)
!689 = !DILocation(line: 367, column: 24, scope: !690)
!690 = distinct !DILexicalBlock(scope: !614, file: !3, line: 366, column: 45)
!691 = !DILocation(line: 365, column: 18, scope: !610)
!692 = !DILocation(line: 368, column: 9, scope: !690)
!693 = !DILocation(line: 370, column: 31, scope: !613)
!694 = !DILocation(line: 370, column: 23, scope: !613)
!695 = !DILocation(line: 371, column: 24, scope: !613)
!696 = !DILocation(line: 371, column: 22, scope: !613)
!697 = !DILocation(line: 372, column: 24, scope: !613)
!698 = !DILocation(line: 372, column: 13, scope: !613)
!699 = !DILocation(line: 372, column: 22, scope: !613)
!700 = !DILocation(line: 374, column: 13, scope: !613)
!701 = !DILocation(line: 375, column: 13, scope: !613)
!702 = !DILocation(line: 376, column: 24, scope: !613)
!703 = !DILocation(line: 377, column: 13, scope: !613)
!704 = !DILocation(line: 0, scope: !613)
!705 = !DILocation(line: 379, column: 22, scope: !706)
!706 = distinct !DILexicalBlock(scope: !610, file: !3, line: 379, column: 13)
!707 = !DILocation(line: 379, column: 13, scope: !610)
!708 = !DILocation(line: 381, column: 36, scope: !709)
!709 = distinct !DILexicalBlock(scope: !710, file: !3, line: 380, column: 75)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 380, column: 17)
!711 = distinct !DILexicalBlock(scope: !706, file: !3, line: 379, column: 40)
!712 = !DILocation(line: 381, column: 17, scope: !709)
!713 = !DILocation(line: 392, column: 9, scope: !714)
!714 = distinct !DILexicalBlock(scope: !577, file: !3, line: 392, column: 9)
!715 = !DILocation(line: 392, column: 21, scope: !714)
!716 = !DILocation(line: 392, column: 29, scope: !714)
!717 = !DILocation(line: 392, column: 32, scope: !714)
!718 = !DILocation(line: 392, column: 45, scope: !714)
!719 = !DILocation(line: 392, column: 9, scope: !577)
!720 = !DILocation(line: 393, column: 37, scope: !721)
!721 = distinct !DILexicalBlock(scope: !714, file: !3, line: 392, column: 96)
!722 = !DILocation(line: 393, column: 24, scope: !721)
!723 = !{!724, !625, i64 24}
!724 = !{!"_mp_obj_type_t", !725, i64 0, !726, i64 8, !726, i64 10, !625, i64 16, !625, i64 24, !625, i64 32, !625, i64 40, !625, i64 48, !625, i64 56, !625, i64 64, !625, i64 72, !625, i64 80, !727, i64 88, !625, i64 96, !625, i64 104, !625, i64 112}
!725 = !{!"_mp_obj_base_t", !625, i64 0}
!726 = !{!"short", !626, i64 0}
!727 = !{!"_mp_buffer_p_t", !625, i64 0}
!728 = !DILocation(line: 393, column: 22, scope: !721)
!729 = !DILocation(line: 394, column: 5, scope: !721)
!730 = !DILocation(line: 396, column: 12, scope: !577)
!731 = !DILocation(line: 396, column: 5, scope: !577)
!732 = !DILocation(line: 0, scope: !733)
!733 = distinct !DILexicalBlock(scope: !675, file: !3, line: 348, column: 47)
!734 = !DILocation(line: 397, column: 1, scope: !577)
!735 = distinct !DISubprogram(name: "mp_obj_class_lookup", scope: !3, file: !3, line: 152, type: !736, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !739)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !738, !318}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!739 = !{!740, !741, !742, !748, !749, !754, !757, !758, !771, !772, !773}
!740 = !DILocalVariable(name: "lookup", arg: 1, scope: !735, file: !3, line: 152, type: !738)
!741 = !DILocalVariable(name: "type", arg: 2, scope: !735, file: !3, line: 152, type: !318)
!742 = !DILocalVariable(name: "locals_map", scope: !743, file: !3, line: 176, type: !362)
!743 = distinct !DILexicalBlock(scope: !744, file: !3, line: 173, column: 40)
!744 = distinct !DILexicalBlock(scope: !745, file: !3, line: 173, column: 13)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 155, column: 14)
!746 = distinct !DILexicalBlock(scope: !747, file: !3, line: 155, column: 5)
!747 = distinct !DILexicalBlock(scope: !735, file: !3, line: 155, column: 5)
!748 = !DILocalVariable(name: "elem", scope: !743, file: !3, line: 177, type: !373)
!749 = !DILocalVariable(name: "org_type", scope: !750, file: !3, line: 182, type: !318)
!750 = distinct !DILexicalBlock(scope: !751, file: !3, line: 179, column: 38)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 179, column: 21)
!752 = distinct !DILexicalBlock(scope: !753, file: !3, line: 178, column: 31)
!753 = distinct !DILexicalBlock(scope: !743, file: !3, line: 178, column: 17)
!754 = !DILocalVariable(name: "obj", scope: !755, file: !3, line: 188, type: !462)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 187, column: 24)
!756 = distinct !DILexicalBlock(scope: !751, file: !3, line: 184, column: 28)
!757 = !DILocalVariable(name: "obj_obj", scope: !755, file: !3, line: 189, type: !310)
!758 = !DILocalVariable(name: "parent_tuple", scope: !759, file: !3, line: 225, type: !762)
!759 = distinct !DILexicalBlock(scope: !760, file: !3, line: 224, column: 76)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 224, column: 20)
!761 = distinct !DILexicalBlock(scope: !745, file: !3, line: 220, column: 13)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_tuple_t", file: !765, line: 35, baseType: !766)
!765 = !DIFile(filename: "../../py/objtuple.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_tuple_t", file: !765, line: 31, size: 128, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !765, line: 32, baseType: !314, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !766, file: !765, line: 33, baseType: !349, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !766, file: !765, line: 34, baseType: !470, offset: 128)
!771 = !DILocalVariable(name: "item", scope: !759, file: !3, line: 226, type: !360)
!772 = !DILocalVariable(name: "top", scope: !759, file: !3, line: 227, type: !360)
!773 = !DILocalVariable(name: "bt", scope: !774, file: !3, line: 230, type: !461)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 228, column: 40)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 228, column: 13)
!776 = distinct !DILexicalBlock(scope: !759, file: !3, line: 228, column: 13)
!777 = !DILocation(line: 152, column: 60, scope: !735)
!778 = !DILocation(line: 152, column: 89, scope: !735)
!779 = !DILocation(line: 155, column: 5, scope: !735)
!780 = !DILocation(line: 161, column: 21, scope: !781)
!781 = distinct !DILexicalBlock(scope: !745, file: !3, line: 161, column: 13)
!782 = !DILocation(line: 161, column: 33, scope: !781)
!783 = !DILocation(line: 161, column: 38, scope: !781)
!784 = !DILocation(line: 161, column: 41, scope: !781)
!785 = !DILocation(line: 161, column: 13, scope: !745)
!786 = !DILocation(line: 164, column: 27, scope: !787)
!787 = distinct !DILexicalBlock(scope: !788, file: !3, line: 164, column: 17)
!788 = distinct !DILexicalBlock(scope: !781, file: !3, line: 161, column: 70)
!789 = !DILocation(line: 164, column: 39, scope: !787)
!790 = !DILocation(line: 164, column: 17, scope: !787)
!791 = !DILocation(line: 164, column: 62, scope: !787)
!792 = !DILocation(line: 164, column: 17, scope: !788)
!793 = !DILocation(line: 168, column: 25, scope: !794)
!794 = distinct !DILexicalBlock(scope: !787, file: !3, line: 164, column: 71)
!795 = !DILocation(line: 168, column: 33, scope: !794)
!796 = !DILocation(line: 169, column: 17, scope: !794)
!797 = !DILocation(line: 173, column: 19, scope: !744)
!798 = !{!724, !625, i64 112}
!799 = !DILocation(line: 173, column: 31, scope: !744)
!800 = !DILocation(line: 173, column: 13, scope: !745)
!801 = !DILocation(line: 176, column: 56, scope: !743)
!802 = !DILocation(line: 176, column: 23, scope: !743)
!803 = !DILocation(line: 177, column: 61, scope: !743)
!804 = !DILocation(line: 177, column: 35, scope: !743)
!805 = !DILocation(line: 177, column: 28, scope: !743)
!806 = !DILocation(line: 178, column: 22, scope: !753)
!807 = !DILocation(line: 178, column: 17, scope: !743)
!808 = !DILocation(line: 179, column: 29, scope: !751)
!809 = !{i8 0, i8 2}
!810 = !DILocation(line: 179, column: 21, scope: !752)
!811 = !DILocation(line: 182, column: 83, scope: !750)
!812 = !DILocation(line: 182, column: 42, scope: !750)
!813 = !DILocation(line: 183, column: 75, scope: !750)
!814 = !{!815, !625, i64 8}
!815 = !{!"_mp_map_elem_t", !625, i64 0, !625, i64 8}
!816 = !DILocation(line: 183, column: 90, scope: !750)
!817 = !DILocation(line: 183, column: 21, scope: !750)
!818 = !DILocation(line: 184, column: 28, scope: !756)
!819 = !{!725, !625, i64 0}
!820 = !DILocation(line: 184, column: 28, scope: !751)
!821 = !DILocation(line: 185, column: 29, scope: !822)
!822 = distinct !DILexicalBlock(scope: !756, file: !3, line: 184, column: 76)
!823 = !DILocation(line: 185, column: 37, scope: !822)
!824 = !DILocation(line: 188, column: 54, scope: !755)
!825 = !DILocation(line: 188, column: 40, scope: !755)
!826 = !DILocation(line: 190, column: 29, scope: !827)
!827 = distinct !DILexicalBlock(scope: !755, file: !3, line: 190, column: 25)
!828 = !DILocation(line: 190, column: 37, scope: !827)
!829 = !DILocation(line: 190, column: 40, scope: !827)
!830 = !DILocation(line: 190, column: 76, scope: !827)
!831 = !DILocation(line: 190, column: 68, scope: !827)
!832 = !DILocation(line: 192, column: 35, scope: !833)
!833 = distinct !DILexicalBlock(scope: !827, file: !3, line: 190, column: 128)
!834 = !DILocation(line: 189, column: 30, scope: !755)
!835 = !DILocation(line: 193, column: 21, scope: !833)
!836 = !DILocation(line: 194, column: 35, scope: !837)
