; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/parsenum.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/parsenum.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_lexer_t = type { i64, %struct._mp_reader_t, i32, i32, i32, i64, i64, i64, i64, i64, i64, i16*, i64, i64, i32, %struct._vstr_t }
%struct._mp_reader_t = type { i8*, i64 (i8*)*, void (i8*)* }
%struct._vstr_t = type { i64, i64, i8*, i8 }
%struct.compressed_string_t = type { i16, [0 x i8] }


!338 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!339 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!340 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!341 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!342 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!343 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!344 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!345 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!346 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!347 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!348 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!349 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!350 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!351 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!352 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!353 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!354 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!355 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!356 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!357 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!358 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!359 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!360 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!361 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!362 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!363 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!364 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!365 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!366 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!367 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!368 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!369 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!370 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!371 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!372 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!373 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!374 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!375 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!376 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!377 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!378 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!379 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!380 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!381 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!382 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!383 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!384 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!385 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!386 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!387 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!388 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!389 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!390 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!391 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!392 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!393 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!394 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!395 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!396 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!397 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!398 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!399 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!400 = !{!401, !406, !409, !414, !415, !416}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !404, line: 39, baseType: !405)
!404 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!405 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !410, line: 71, baseType: !411)
!410 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !412, line: 30, baseType: !413)
!412 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!413 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !103, line: 46, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !103, line: 59, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !103, line: 56, size: 64, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !103, line: 57, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !103, line: 52, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !103, line: 474, size: 960, elements: !425)
!425 = !{!426, !427, !431, !432, !454, !478, !483, !489, !495, !502, !507, !521, !526, !547, !550, !551}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !424, file: !103, line: 476, baseType: !417, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !424, file: !103, line: 479, baseType: !428, size: 16, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !429, line: 31, baseType: !430)
!429 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!430 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !424, file: !103, line: 482, baseType: !428, size: 16, offset: 80)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !424, file: !103, line: 485, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !103, line: 441, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437, !414, !453}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !440, line: 53, baseType: !441)
!440 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !440, line: 50, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !440, line: 51, baseType: !415, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !441, file: !440, line: 52, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !440, line: 48, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !415, !406, !449}
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !450, line: 31, baseType: !451)
!450 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !452, line: 92, baseType: !413)
!452 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !103, line: 430, baseType: !102)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !424, file: !103, line: 488, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !103, line: 442, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!414, !421, !449, !459, !461}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !103, line: 374, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !103, line: 365, size: 192, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !463, file: !103, line: 366, baseType: !449, size: 1, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !463, file: !103, line: 367, baseType: !449, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !463, file: !103, line: 368, baseType: !449, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !463, file: !103, line: 369, baseType: !449, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !463, file: !103, line: 371, baseType: !449, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !463, file: !103, line: 372, baseType: !449, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !463, file: !103, line: 373, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !103, line: 353, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !103, line: 350, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !474, file: !103, line: 351, baseType: !414, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !474, file: !103, line: 352, baseType: !414, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !424, file: !103, line: 491, baseType: !479, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !103, line: 443, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!414, !414, !449, !449, !459}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !424, file: !103, line: 495, baseType: !484, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !103, line: 444, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!414, !488, !414}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !112, line: 65, baseType: !111)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !424, file: !103, line: 496, baseType: !490, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !103, line: 445, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!414, !494, !414, !414}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !112, line: 145, baseType: !125)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !424, file: !103, line: 509, baseType: !496, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !103, line: 446, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !414, !500, !501}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !167, line: 48, baseType: !449)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !424, file: !103, line: 516, baseType: !503, size: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !103, line: 447, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!414, !414, !414, !414}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !424, file: !103, line: 521, baseType: !508, size: 64, offset: 576)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !103, line: 448, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!414, !414, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !103, line: 435, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !103, line: 432, size: 256, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !514, file: !103, line: 433, baseType: !417, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !514, file: !103, line: 434, baseType: !518, size: 192, offset: 64)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 192, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 3)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !424, file: !103, line: 525, baseType: !522, size: 64, offset: 640)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !103, line: 415, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!414, !414}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !424, file: !103, line: 528, baseType: !527, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !103, line: 470, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !103, line: 468, size: 64, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !528, file: !103, line: 469, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!534, !414, !539, !409}
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !410, line: 70, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !536, line: 32, baseType: !537)
!536 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !452, line: 49, baseType: !538)
!538 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !103, line: 464, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !103, line: 451, size: 192, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !541, file: !103, line: 457, baseType: !415, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !541, file: !103, line: 458, baseType: !449, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !541, file: !103, line: 459, baseType: !546, size: 32, offset: 128)
!546 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !424, file: !103, line: 531, baseType: !548, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !424, file: !103, line: 537, baseType: !548, size: 64, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !424, file: !103, line: 540, baseType: !552, size: 64, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !103, line: 775, size: 256, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !553, file: !103, line: 776, baseType: !417, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !553, file: !103, line: 777, baseType: !462, size: 192, offset: 64)
!557 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!558 = distinct !DISubprogram(name: "mp_parse_num_integer", scope: !6, file: !6, line: 51, type: !559, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !609)
!559 = !DISubroutineType(types: !560)
!560 = !{!414, !561, !449, !546, !562}
!561 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !406)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !9, line: 168, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !9, line: 148, size: 1280, elements: !565)
!565 = !{!566, !567, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !597, !599}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !564, file: !9, line: 149, baseType: !500, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !564, file: !9, line: 150, baseType: !568, size: 192, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !569, line: 40, baseType: !570)
!569 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !569, line: 36, size: 192, elements: !571)
!571 = !{!572, !573, !577}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !569, line: 37, baseType: !415, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !570, file: !569, line: 38, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!409, !415}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !570, file: !569, line: 39, baseType: !578, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !415}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !564, file: !9, line: 152, baseType: !582, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !404, line: 131, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !404, line: 40, baseType: !584)
!584 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !564, file: !9, line: 152, baseType: !582, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !564, file: !9, line: 152, baseType: !582, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !564, file: !9, line: 154, baseType: !449, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !564, file: !9, line: 155, baseType: !449, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !564, file: !9, line: 157, baseType: !534, size: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !564, file: !9, line: 158, baseType: !534, size: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !564, file: !9, line: 160, baseType: !449, size: 64, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !564, file: !9, line: 161, baseType: !449, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !564, file: !9, line: 162, baseType: !594, size: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !564, file: !9, line: 164, baseType: !449, size: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !564, file: !9, line: 165, baseType: !449, size: 64, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !564, file: !9, line: 166, baseType: !598, size: 32, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !9, line: 144, baseType: !8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !564, file: !9, line: 167, baseType: !600, size: 256, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !404, line: 165, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !404, line: 160, size: 256, elements: !602)
!602 = !{!603, !604, !605, !607}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !601, file: !404, line: 161, baseType: !449, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !601, file: !404, line: 162, baseType: !449, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !601, file: !404, line: 163, baseType: !606, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !601, file: !404, line: 164, baseType: !608, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!608 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!609 = !{!610, !611, !612, !613, !614, !616, !617, !618, !619, !620, !621, !625, !627}
!610 = !DILocalVariable(name: "str_", arg: 1, scope: !558, file: !6, line: 51, type: !561)
!611 = !DILocalVariable(name: "len", arg: 2, scope: !558, file: !6, line: 51, type: !449)
!612 = !DILocalVariable(name: "base", arg: 3, scope: !558, file: !6, line: 51, type: !546)
!613 = !DILocalVariable(name: "lex", arg: 4, scope: !558, file: !6, line: 51, type: !562)
!614 = !DILocalVariable(name: "str", scope: !558, file: !6, line: 52, type: !615)
!615 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !401)
!616 = !DILocalVariable(name: "top", scope: !558, file: !6, line: 53, type: !615)
!617 = !DILocalVariable(name: "neg", scope: !558, file: !6, line: 54, type: !608)
!618 = !DILocalVariable(name: "ret_val", scope: !558, file: !6, line: 55, type: !414)
!619 = !DILocalVariable(name: "int_val", scope: !558, file: !6, line: 81, type: !534)
!620 = !DILocalVariable(name: "str_val_start", scope: !558, file: !6, line: 82, type: !615)
!621 = !DILocalVariable(name: "dig", scope: !622, file: !6, line: 85, type: !409)
!622 = distinct !DILexicalBlock(scope: !623, file: !6, line: 83, column: 30)
!623 = distinct !DILexicalBlock(scope: !624, file: !6, line: 83, column: 5)
!624 = distinct !DILexicalBlock(scope: !558, file: !6, line: 83, column: 5)
!625 = !DILocalVariable(name: "s2", scope: !626, file: !6, line: 142, type: !406)
!626 = distinct !DILexicalBlock(scope: !558, file: !6, line: 141, column: 5)
!627 = !DILocalVariable(name: "exc", scope: !628, file: !6, line: 150, type: !414)
!628 = distinct !DILexicalBlock(scope: !629, file: !6, line: 149, column: 67)
!629 = distinct !DILexicalBlock(scope: !558, file: !6, line: 149, column: 9)
!630 = !DILocation(line: 51, column: 52, scope: !558)
!631 = !DILocation(line: 51, column: 65, scope: !558)
!632 = !DILocation(line: 51, column: 74, scope: !558)
!633 = !{!634, !634, i64 0}
!634 = !{!"int", !635, i64 0}
!635 = !{!"omnipotent char", !636, i64 0}
!636 = !{!"Simple C/C++ TBAA"}
!637 = !DILocation(line: 51, column: 92, scope: !558)
!638 = !DILocation(line: 52, column: 26, scope: !558)
!639 = !DILocation(line: 53, column: 36, scope: !558)
!640 = !DILocation(line: 53, column: 26, scope: !558)
!641 = !DILocation(line: 54, column: 10, scope: !558)
!642 = !DILocation(line: 58, column: 15, scope: !643)
!643 = distinct !DILexicalBlock(scope: !558, file: !6, line: 58, column: 9)
!644 = !DILocation(line: 58, column: 28, scope: !643)
!645 = !DILocation(line: 58, column: 20, scope: !643)
!646 = !DILocation(line: 58, column: 41, scope: !643)
!647 = !DILocation(line: 64, column: 16, scope: !648)
!648 = distinct !DILexicalBlock(scope: !649, file: !6, line: 64, column: 5)
!649 = distinct !DILexicalBlock(scope: !558, file: !6, line: 64, column: 5)
!650 = !DILocation(line: 64, column: 22, scope: !648)
!651 = !DILocation(line: 60, column: 29, scope: !652)
!652 = distinct !DILexicalBlock(scope: !643, file: !6, line: 58, column: 47)
!653 = !DILocation(line: 60, column: 9, scope: !652)
!654 = !DILocation(line: 64, column: 41, scope: !648)
!655 = !{!635, !635, i64 0}
!656 = !DILocation(line: 64, column: 25, scope: !648)
!657 = !DILocation(line: 64, column: 5, scope: !649)
!658 = !DILocation(line: 64, column: 51, scope: !648)
!659 = distinct !{!659, !657, !660}
!660 = !DILocation(line: 65, column: 5, scope: !649)
!661 = !DILocation(line: 69, column: 13, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !6, line: 69, column: 13)
!663 = distinct !DILexicalBlock(scope: !664, file: !6, line: 68, column: 20)
!664 = distinct !DILexicalBlock(scope: !558, file: !6, line: 68, column: 9)
!665 = !DILocation(line: 69, column: 13, scope: !663)
!666 = !DILocation(line: 70, column: 16, scope: !667)
