; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/parsenum.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/parsenum.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_lexer_t = type { i64, %struct._mp_reader_t, i32, i32, i32, i64, i64, i64, i64, i64, i64, i16*, i64, i64, i32, %struct._vstr_t }
%struct._mp_reader_t = type { i8*, i64 (i8*)*, void (i8*)* }
%struct._vstr_t = type { i64, i64, i8*, i8 }
%struct.compressed_string_t = type { i16, [0 x i8] }


!353 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!354 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!355 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!356 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!357 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!358 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!359 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!360 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!361 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!362 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!363 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!364 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!365 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!366 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!367 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!368 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!369 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!370 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!371 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!372 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!373 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!374 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!375 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!376 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!377 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!378 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!379 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!380 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!381 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!382 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!383 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!384 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!385 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!386 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!387 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!388 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!401 = !{!402, !407, !410, !415, !416, !417}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !405, line: 39, baseType: !406)
!405 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!406 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!409 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !411, line: 70, baseType: !412)
!411 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !413, line: 30, baseType: !414)
!413 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!414 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !104, line: 46, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !104, line: 59, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !104, line: 56, size: 64, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !104, line: 57, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !104, line: 52, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !104, line: 474, size: 960, elements: !426)
!426 = !{!427, !428, !432, !433, !455, !479, !484, !490, !496, !503, !508, !522, !527, !548, !551, !552}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !425, file: !104, line: 476, baseType: !418, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !425, file: !104, line: 479, baseType: !429, size: 16, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !430, line: 31, baseType: !431)
!430 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!431 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !425, file: !104, line: 482, baseType: !429, size: 16, offset: 80)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !425, file: !104, line: 485, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !104, line: 441, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438, !415, !454}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !441, line: 53, baseType: !442)
!441 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !441, line: 50, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !441, line: 51, baseType: !416, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !442, file: !441, line: 52, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !441, line: 48, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !416, !407, !450}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !451, line: 31, baseType: !452)
!451 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !453, line: 92, baseType: !414)
!453 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !104, line: 430, baseType: !103)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !425, file: !104, line: 488, baseType: !456, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !104, line: 442, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!415, !422, !450, !460, !462}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !104, line: 374, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !104, line: 365, size: 192, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !464, file: !104, line: 366, baseType: !450, size: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !464, file: !104, line: 367, baseType: !450, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !464, file: !104, line: 368, baseType: !450, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !464, file: !104, line: 369, baseType: !450, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !464, file: !104, line: 371, baseType: !450, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !464, file: !104, line: 372, baseType: !450, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !464, file: !104, line: 373, baseType: !473, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !104, line: 353, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !104, line: 350, size: 128, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !475, file: !104, line: 351, baseType: !415, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !475, file: !104, line: 352, baseType: !415, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !425, file: !104, line: 491, baseType: !480, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !104, line: 443, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!415, !415, !450, !450, !460}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !425, file: !104, line: 495, baseType: !485, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !104, line: 444, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!415, !489, !415}
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !113, line: 65, baseType: !112)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !425, file: !104, line: 496, baseType: !491, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !104, line: 445, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!415, !495, !415, !415}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !113, line: 145, baseType: !126)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !425, file: !104, line: 509, baseType: !497, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !104, line: 446, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !415, !501, !502}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !168, line: 48, baseType: !450)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !425, file: !104, line: 516, baseType: !504, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !104, line: 447, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!415, !415, !415, !415}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !425, file: !104, line: 521, baseType: !509, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !104, line: 448, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!415, !415, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !104, line: 435, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !104, line: 432, size: 256, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !104, line: 433, baseType: !418, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !515, file: !104, line: 434, baseType: !519, size: 192, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 192, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 3)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !425, file: !104, line: 525, baseType: !523, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !104, line: 415, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!415, !415}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !425, file: !104, line: 528, baseType: !528, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !104, line: 470, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !104, line: 468, size: 64, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !529, file: !104, line: 469, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !415, !540, !410}
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !411, line: 69, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !537, line: 32, baseType: !538)
!537 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !453, line: 49, baseType: !539)
!539 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !104, line: 464, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !104, line: 451, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !542, file: !104, line: 457, baseType: !416, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !542, file: !104, line: 458, baseType: !450, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !542, file: !104, line: 459, baseType: !547, size: 32, offset: 128)
!547 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !425, file: !104, line: 531, baseType: !549, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !425, file: !104, line: 537, baseType: !549, size: 64, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !425, file: !104, line: 540, baseType: !553, size: 64, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !104, line: 775, size: 256, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !554, file: !104, line: 776, baseType: !418, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !554, file: !104, line: 777, baseType: !463, size: 192, offset: 64)
!558 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!559 = distinct !DISubprogram(name: "mp_parse_num_integer", scope: !560, file: !560, line: 51, type: !561, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !610)
!560 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/parsenum.c", directory: "")
!561 = !DISubroutineType(types: !562)
!562 = !{!415, !563, !450, !547, !564}
!563 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !407)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !9, line: 168, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !9, line: 148, size: 1280, elements: !567)
!567 = !{!568, !569, !583, !586, !587, !588, !589, !590, !591, !592, !593, !594, !596, !597, !598, !600}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !566, file: !9, line: 149, baseType: !501, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !566, file: !9, line: 150, baseType: !570, size: 192, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !571, line: 40, baseType: !572)
!571 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !571, line: 36, size: 192, elements: !573)
!573 = !{!574, !575, !579}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !571, line: 37, baseType: !416, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !572, file: !571, line: 38, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!410, !416}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !572, file: !571, line: 39, baseType: !580, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !416}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !566, file: !9, line: 152, baseType: !584, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !405, line: 131, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !405, line: 40, baseType: !10)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !566, file: !9, line: 152, baseType: !584, size: 32, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !566, file: !9, line: 152, baseType: !584, size: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !566, file: !9, line: 154, baseType: !450, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !566, file: !9, line: 155, baseType: !450, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !566, file: !9, line: 157, baseType: !535, size: 64, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !566, file: !9, line: 158, baseType: !535, size: 64, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !566, file: !9, line: 160, baseType: !450, size: 64, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !566, file: !9, line: 161, baseType: !450, size: 64, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !566, file: !9, line: 162, baseType: !595, size: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !566, file: !9, line: 164, baseType: !450, size: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !566, file: !9, line: 165, baseType: !450, size: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !566, file: !9, line: 166, baseType: !599, size: 32, offset: 960)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !9, line: 144, baseType: !8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !566, file: !9, line: 167, baseType: !601, size: 256, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !405, line: 165, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !405, line: 160, size: 256, elements: !603)
!603 = !{!604, !605, !606, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !602, file: !405, line: 161, baseType: !450, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !602, file: !405, line: 162, baseType: !450, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !602, file: !405, line: 163, baseType: !607, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !602, file: !405, line: 164, baseType: !609, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!609 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!610 = !{!611, !612, !613, !614, !615, !617, !618, !619, !620, !621, !622, !626, !628}
!611 = !DILocalVariable(name: "str_", arg: 1, scope: !559, file: !560, line: 51, type: !563)
!612 = !DILocalVariable(name: "len", arg: 2, scope: !559, file: !560, line: 51, type: !450)
!613 = !DILocalVariable(name: "base", arg: 3, scope: !559, file: !560, line: 51, type: !547)
!614 = !DILocalVariable(name: "lex", arg: 4, scope: !559, file: !560, line: 51, type: !564)
!615 = !DILocalVariable(name: "str", scope: !559, file: !560, line: 52, type: !616)
!616 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !402)
!617 = !DILocalVariable(name: "top", scope: !559, file: !560, line: 53, type: !616)
!618 = !DILocalVariable(name: "neg", scope: !559, file: !560, line: 54, type: !609)
!619 = !DILocalVariable(name: "ret_val", scope: !559, file: !560, line: 55, type: !415)
!620 = !DILocalVariable(name: "int_val", scope: !559, file: !560, line: 81, type: !535)
!621 = !DILocalVariable(name: "str_val_start", scope: !559, file: !560, line: 82, type: !616)
!622 = !DILocalVariable(name: "dig", scope: !623, file: !560, line: 85, type: !410)
!623 = distinct !DILexicalBlock(scope: !624, file: !560, line: 83, column: 30)
!624 = distinct !DILexicalBlock(scope: !625, file: !560, line: 83, column: 5)
!625 = distinct !DILexicalBlock(scope: !559, file: !560, line: 83, column: 5)
!626 = !DILocalVariable(name: "s2", scope: !627, file: !560, line: 142, type: !407)
!627 = distinct !DILexicalBlock(scope: !559, file: !560, line: 141, column: 5)
!628 = !DILocalVariable(name: "exc", scope: !629, file: !560, line: 150, type: !415)
!629 = distinct !DILexicalBlock(scope: !630, file: !560, line: 149, column: 67)
!630 = distinct !DILexicalBlock(scope: !559, file: !560, line: 149, column: 9)
!631 = !DILocation(line: 51, column: 52, scope: !559)
!632 = !DILocation(line: 51, column: 65, scope: !559)
!633 = !DILocation(line: 51, column: 74, scope: !559)
!634 = !{!635, !635, i64 0}
!635 = !{!"int", !636, i64 0}
!636 = !{!"omnipotent char", !637, i64 0}
!637 = !{!"Simple C/C++ TBAA"}
!638 = !DILocation(line: 51, column: 92, scope: !559)
!639 = !DILocation(line: 52, column: 26, scope: !559)
!640 = !DILocation(line: 53, column: 36, scope: !559)
!641 = !DILocation(line: 53, column: 26, scope: !559)
!642 = !DILocation(line: 54, column: 10, scope: !559)
!643 = !DILocation(line: 58, column: 15, scope: !644)
!644 = distinct !DILexicalBlock(scope: !559, file: !560, line: 58, column: 9)
!645 = !DILocation(line: 58, column: 28, scope: !644)
!646 = !DILocation(line: 58, column: 20, scope: !644)
!647 = !DILocation(line: 58, column: 41, scope: !644)
!648 = !DILocation(line: 64, column: 16, scope: !649)
!649 = distinct !DILexicalBlock(scope: !650, file: !560, line: 64, column: 5)
!650 = distinct !DILexicalBlock(scope: !559, file: !560, line: 64, column: 5)
!651 = !DILocation(line: 64, column: 22, scope: !649)
!652 = !DILocation(line: 60, column: 29, scope: !653)
!653 = distinct !DILexicalBlock(scope: !644, file: !560, line: 58, column: 47)
!654 = !DILocation(line: 60, column: 9, scope: !653)
!655 = !DILocation(line: 64, column: 41, scope: !649)
!656 = !{!636, !636, i64 0}
!657 = !DILocation(line: 64, column: 25, scope: !649)
!658 = !DILocation(line: 64, column: 5, scope: !650)
!659 = !DILocation(line: 64, column: 51, scope: !649)
!660 = distinct !{!660, !658, !661}
!661 = !DILocation(line: 65, column: 5, scope: !650)
!662 = !DILocation(line: 69, column: 13, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !560, line: 69, column: 13)
!664 = distinct !DILexicalBlock(scope: !665, file: !560, line: 68, column: 20)
!665 = distinct !DILexicalBlock(scope: !559, file: !560, line: 68, column: 9)
!666 = !DILocation(line: 69, column: 13, scope: !664)
