; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/parse.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/parse.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

!508 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!509 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!510 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!511 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!512 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!513 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!514 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!515 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!516 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!517 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!518 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!519 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!520 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!521 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!522 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!523 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!524 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!525 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!526 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!527 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!528 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!529 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!530 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!531 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!532 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!533 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!534 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!535 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!536 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!537 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!538 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!539 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!540 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!541 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!542 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!543 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!544 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!545 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!546 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!547 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!548 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!549 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!550 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!551 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!552 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!553 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!554 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!555 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!556 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!557 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!558 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!559 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!560 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!561 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!562 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!563 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!564 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!565 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!566 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!567 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!568 = !{!569, !571, !576, !578, !582, !596, !577, !734, !741, !723, !742, !746, !593, !579, !748, !676}
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !570, line: 70, baseType: !571)
!570 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !572, line: 32, baseType: !573)
!572 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !574, line: 49, baseType: !575)
!574 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!575 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !265, line: 46, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !570, line: 71, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !580, line: 30, baseType: !581)
!580 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!581 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_struct_t", file: !329, line: 58, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_node_struct_t", file: !329, line: 54, size: 64, elements: !585)
!585 = !{!586, !590, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "source_line", scope: !584, file: !329, line: 55, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !588, line: 31, baseType: !589)
!588 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint32_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!589 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "kind_num_nodes", scope: !584, file: !329, line: 56, baseType: !587, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !584, file: !329, line: 57, baseType: !592, offset: 64)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, elements: !594)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !329, line: 52, baseType: !579)
!594 = !{!595}
!595 = !DISubrange(count: -1)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !265, line: 59, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !265, line: 56, size: 64, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !598, file: !265, line: 57, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !265, line: 52, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !265, line: 474, size: 960, elements: !605)
!605 = !{!606, !607, !611, !612, !636, !660, !665, !671, !677, !684, !689, !703, !708, !724, !727, !728}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !604, file: !265, line: 476, baseType: !597, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !604, file: !265, line: 479, baseType: !608, size: 16, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !609, line: 31, baseType: !610)
!609 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!610 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !265, line: 482, baseType: !608, size: 16, offset: 80)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !604, file: !265, line: 485, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !265, line: 441, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !617, !576, !635}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !620, line: 53, baseType: !621)
!620 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !620, line: 50, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !620, line: 51, baseType: !577, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !621, file: !620, line: 52, baseType: !625, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !620, line: 48, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !577, !629, !632}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !633, line: 31, baseType: !634)
!633 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !574, line: 92, baseType: !581)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !265, line: 430, baseType: !264)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !604, file: !265, line: 488, baseType: !637, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !265, line: 442, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!576, !601, !632, !641, !643}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !265, line: 374, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !265, line: 365, size: 192, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !645, file: !265, line: 366, baseType: !632, size: 1, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !645, file: !265, line: 367, baseType: !632, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !645, file: !265, line: 368, baseType: !632, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !645, file: !265, line: 369, baseType: !632, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !645, file: !265, line: 371, baseType: !632, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !645, file: !265, line: 372, baseType: !632, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !645, file: !265, line: 373, baseType: !654, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !265, line: 353, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !265, line: 350, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !656, file: !265, line: 351, baseType: !576, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !265, line: 352, baseType: !576, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !604, file: !265, line: 491, baseType: !661, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !265, line: 443, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!576, !576, !632, !632, !641}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !604, file: !265, line: 495, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !265, line: 444, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!576, !670, !576}
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !274, line: 65, baseType: !273)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !604, file: !265, line: 496, baseType: !672, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !265, line: 445, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!576, !676, !576, !576}
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !274, line: 145, baseType: !287)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !604, file: !265, line: 509, baseType: !678, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !265, line: 446, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !576, !682, !683}
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !335, line: 48, baseType: !632)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !604, file: !265, line: 516, baseType: !685, size: 64, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !265, line: 447, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!576, !576, !576, !576}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !604, file: !265, line: 521, baseType: !690, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !265, line: 448, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!576, !576, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !265, line: 435, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !265, line: 432, size: 256, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !265, line: 433, baseType: !597, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !696, file: !265, line: 434, baseType: !700, size: 192, offset: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 192, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 3)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !604, file: !265, line: 525, baseType: !704, size: 64, offset: 640)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !265, line: 415, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!576, !576}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !604, file: !265, line: 528, baseType: !709, size: 64, offset: 704)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !265, line: 470, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !265, line: 468, size: 64, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !710, file: !265, line: 469, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!569, !576, !716, !578}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !265, line: 464, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !265, line: 451, size: 192, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !718, file: !265, line: 457, baseType: !577, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !718, file: !265, line: 458, baseType: !632, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !718, file: !265, line: 459, baseType: !723, size: 32, offset: 128)
!723 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !604, file: !265, line: 531, baseType: !725, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !604, file: !265, line: 537, baseType: !725, size: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !604, file: !265, line: 540, baseType: !729, size: 64, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !265, line: 775, size: 256, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !730, file: !265, line: 776, baseType: !597, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !730, file: !265, line: 777, baseType: !644, size: 192, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "rule_stack_t", file: !3, line: 216, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rule_stack_t", file: !3, line: 212, size: 128, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "src_line", scope: !736, file: !3, line: 213, baseType: !632, size: 56, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rule_id", scope: !736, file: !3, line: 214, baseType: !632, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "arg_i", scope: !736, file: !3, line: 215, baseType: !632, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !744, line: 39, baseType: !745)
!744 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!745 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_chunk_t", file: !3, line: 225, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !3, line: 218, size: 128, elements: !751)
!751 = !{!752, !753, !759}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !750, file: !3, line: 219, baseType: !632, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "union_", scope: !750, file: !3, line: 223, baseType: !754, size: 64, offset: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !750, file: !3, line: 220, size: 64, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !754, file: !3, line: 221, baseType: !632, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !3, line: 222, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !750, file: !3, line: 224, baseType: !760, offset: 128)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, elements: !594)
!761 = !{!0, !762, !765, !773, !779, !783}
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression(DW_OP_constu, 102, DW_OP_stack_value))
!763 = distinct !DIGlobalVariable(name: "FIRST_RULE_WITH_OFFSET_ABOVE_255", scope: !2, file: !3, line: 182, type: !764, isLocal: true, isDefinition: true)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "rule_arg_offset_table", scope: !2, file: !3, line: 167, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 1304, elements: !771)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !770, line: 31, baseType: !745)
!770 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!771 = !{!772}
!772 = !DISubrange(count: 163)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "rule_arg_combined_table", scope: !2, file: !3, line: 114, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 6672, elements: !777)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!777 = !{!778}
!778 = !DISubrange(count: 417)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "rule_name_table", scope: !2, file: !3, line: 197, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 10432, elements: !771)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "token_to_op", scope: !785, file: !3, line: 679, type: !887, isLocal: true, isDefinition: true)
!785 = distinct !DISubprogram(name: "fold_constants", scope: !3, file: !3, line: 635, type: !786, isLocal: true, isDefinition: true, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !852)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !789, !769, !632}
!788 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_t", file: !3, line: 244, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_parser_t", file: !3, line: 227, size: 640, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !845, !851}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack_alloc", scope: !791, file: !3, line: 228, baseType: !632, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack_top", scope: !791, file: !3, line: 229, baseType: !632, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack", scope: !791, file: !3, line: 230, baseType: !734, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack_alloc", scope: !791, file: !3, line: 232, baseType: !632, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack_top", scope: !791, file: !3, line: 233, baseType: !632, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack", scope: !791, file: !3, line: 234, baseType: !741, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lexer", scope: !791, file: !3, line: 236, baseType: !800, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !6, line: 168, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !6, line: 148, size: 1280, elements: !803)
!803 = !{!804, !805, !819, !822, !823, !824, !825, !826, !827, !828, !829, !830, !832, !833, !834, !836}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !802, file: !6, line: 149, baseType: !682, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !802, file: !6, line: 150, baseType: !806, size: 192, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !807, line: 40, baseType: !808)
!807 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !807, line: 36, size: 192, elements: !809)
!809 = !{!810, !811, !815}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !807, line: 37, baseType: !577, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !808, file: !807, line: 38, baseType: !812, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!578, !577}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !808, file: !807, line: 39, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !577}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !802, file: !6, line: 152, baseType: !820, size: 32, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !744, line: 131, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !744, line: 40, baseType: !589)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !802, file: !6, line: 152, baseType: !820, size: 32, offset: 288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !802, file: !6, line: 152, baseType: !820, size: 32, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !802, file: !6, line: 154, baseType: !632, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !802, file: !6, line: 155, baseType: !632, size: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !802, file: !6, line: 157, baseType: !569, size: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !802, file: !6, line: 158, baseType: !569, size: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !802, file: !6, line: 160, baseType: !632, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !802, file: !6, line: 161, baseType: !632, size: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !802, file: !6, line: 162, baseType: !831, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !802, file: !6, line: 164, baseType: !632, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !802, file: !6, line: 165, baseType: !632, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !802, file: !6, line: 166, baseType: !835, size: 32, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !6, line: 144, baseType: !5)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !802, file: !6, line: 167, baseType: !837, size: 256, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !744, line: 165, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !744, line: 160, size: 256, elements: !839)
!839 = !{!840, !841, !842, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !838, file: !744, line: 161, baseType: !632, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !838, file: !744, line: 162, baseType: !632, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !838, file: !744, line: 163, baseType: !843, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !838, file: !744, line: 164, baseType: !788, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !791, file: !3, line: 238, baseType: !846, size: 128, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !329, line: 100, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !329, line: 97, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !847, file: !329, line: 98, baseType: !593, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !847, file: !329, line: 99, baseType: !758, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chunk", scope: !791, file: !3, line: 239, baseType: !748, size: 64, offset: 576)
!852 = !{!853, !854, !855, !856, !857, !860, !861, !866, !869, !872, !874, !877, !878, !879, !880, !883, !884, !885}
!853 = !DILocalVariable(name: "parser", arg: 1, scope: !785, file: !3, line: 635, type: !789)
!854 = !DILocalVariable(name: "rule_id", arg: 2, scope: !785, file: !3, line: 635, type: !769)
!855 = !DILocalVariable(name: "num_args", arg: 3, scope: !785, file: !3, line: 635, type: !632)
!856 = !DILocalVariable(name: "arg0", scope: !785, file: !3, line: 639, type: !576)
!857 = !DILocalVariable(name: "pn", scope: !858, file: !3, line: 644, type: !593)
!858 = distinct !DILexicalBlock(scope: !859, file: !3, line: 642, column: 38)
!859 = distinct !DILexicalBlock(scope: !785, file: !3, line: 640, column: 9)
!860 = !DILocalVariable(name: "op", scope: !858, file: !3, line: 648, type: !676)
!861 = !DILocalVariable(name: "i", scope: !862, file: !3, line: 656, type: !863)
!862 = distinct !DILexicalBlock(scope: !858, file: !3, line: 656, column: 9)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !864, line: 31, baseType: !865)
!864 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_ssize_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !574, line: 119, baseType: !575)
!866 = !DILocalVariable(name: "arg1", scope: !867, file: !3, line: 658, type: !576)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 656, column: 53)
!868 = distinct !DILexicalBlock(scope: !862, file: !3, line: 656, column: 9)
!869 = !DILocalVariable(name: "pn", scope: !870, file: !3, line: 668, type: !593)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 666, column: 34)
!871 = distinct !DILexicalBlock(scope: !859, file: !3, line: 664, column: 16)
!872 = !DILocalVariable(name: "i", scope: !873, file: !3, line: 672, type: !863)
!873 = distinct !DILexicalBlock(scope: !870, file: !3, line: 672, column: 9)
!874 = !DILocalVariable(name: "arg1", scope: !875, file: !3, line: 674, type: !576)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 672, column: 56)
!876 = distinct !DILexicalBlock(scope: !873, file: !3, line: 672, column: 9)
!877 = !DILocalVariable(name: "tok", scope: !875, file: !3, line: 678, type: !835)
!878 = !DILocalVariable(name: "op", scope: !875, file: !3, line: 692, type: !676)
!879 = !DILocalVariable(name: "rhs_sign", scope: !875, file: !3, line: 696, type: !723)
!880 = !DILocalVariable(name: "pn", scope: !881, file: !3, line: 712, type: !593)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 710, column: 42)
!882 = distinct !DILexicalBlock(scope: !871, file: !3, line: 710, column: 16)
!883 = !DILocalVariable(name: "tok", scope: !881, file: !3, line: 716, type: !835)
!884 = !DILocalVariable(name: "op", scope: !881, file: !3, line: 717, type: !670)
!885 = !DILocalVariable(name: "i", scope: !886, file: !3, line: 815, type: !632)
!886 = distinct !DILexicalBlock(scope: !785, file: !3, line: 815, column: 5)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 88, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 11)
!890 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!891 = !{i32 2, !"Dwarf Version", i32 4}
!892 = !{i32 2, !"Debug Info Version", i32 3}
!893 = !{i32 1, !"wchar_size", i32 4}
!894 = !{i32 7, !"PIC Level", i32 2}
!895 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!896 = distinct !DISubprogram(name: "mp_parse_node_is_const_false", scope: !3, file: !3, line: 351, type: !897, isLocal: false, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!788, !593}
!899 = !{!900}
