; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/parse.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/parse.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_parse_node_struct_t = type { i32, i32, [0 x i64] }
%struct._mp_parse_chunk_t = type { i64, %union.anon, [0 x i8] }
%union.anon = type { i64 }
%struct._mp_lexer_t = type { i64, %struct._mp_reader_t, i32, i32, i32, i64, i64, i64, i64, i64, i64, i16*, i64, i64, i32, %struct._vstr_t }
%struct._mp_reader_t = type { i8*, i64 (i8*)*, void (i8*)* }

!518 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!519 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!520 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!521 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!522 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!523 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!524 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!525 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!526 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!527 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!528 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!529 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!530 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!531 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!532 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!533 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!534 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!535 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!536 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!537 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!538 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!539 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!540 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!541 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!542 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!543 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!544 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!545 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!546 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!547 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!548 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!549 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!550 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!551 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!552 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!553 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!554 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!555 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!556 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!557 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!558 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!559 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!560 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!561 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!562 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!563 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!564 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!565 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!566 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!567 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!568 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!569 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!570 = !{!571, !573, !578, !580, !584, !597, !579, !735, !742, !743, !747, !594, !581, !749, !677}
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !572, line: 69, baseType: !573)
!572 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !574, line: 32, baseType: !575)
!574 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !576, line: 49, baseType: !577)
!576 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!577 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !267, line: 46, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !572, line: 70, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !582, line: 30, baseType: !583)
!582 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!583 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_struct_t", file: !331, line: 58, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_node_struct_t", file: !331, line: 54, size: 64, elements: !587)
!587 = !{!588, !591, !592}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "source_line", scope: !586, file: !331, line: 55, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !590, line: 31, baseType: !7)
!590 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint32_t.h", directory: "")
!591 = !DIDerivedType(tag: DW_TAG_member, name: "kind_num_nodes", scope: !586, file: !331, line: 56, baseType: !589, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !586, file: !331, line: 57, baseType: !593, offset: 64)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, elements: !595)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !331, line: 52, baseType: !581)
!595 = !{!596}
!596 = !DISubrange(count: -1)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !267, line: 59, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !267, line: 56, size: 64, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !267, line: 57, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !267, line: 52, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !267, line: 474, size: 960, elements: !606)
!606 = !{!607, !608, !612, !613, !637, !661, !666, !672, !678, !685, !690, !704, !709, !725, !728, !729}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !605, file: !267, line: 476, baseType: !598, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !267, line: 479, baseType: !609, size: 16, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !610, line: 31, baseType: !611)
!610 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!611 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !267, line: 482, baseType: !609, size: 16, offset: 80)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !605, file: !267, line: 485, baseType: !614, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !267, line: 441, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !618, !578, !636}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !621, line: 53, baseType: !622)
!621 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !621, line: 50, size: 128, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !622, file: !621, line: 51, baseType: !579, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !622, file: !621, line: 52, baseType: !626, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !621, line: 48, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !579, !630, !633}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !634, line: 31, baseType: !635)
!634 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !576, line: 92, baseType: !583)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !267, line: 430, baseType: !266)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !605, file: !267, line: 488, baseType: !638, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !267, line: 442, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!578, !602, !633, !642, !644}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !267, line: 374, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !267, line: 365, size: 192, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !646, file: !267, line: 366, baseType: !633, size: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !646, file: !267, line: 367, baseType: !633, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !646, file: !267, line: 368, baseType: !633, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !646, file: !267, line: 369, baseType: !633, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !646, file: !267, line: 371, baseType: !633, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !646, file: !267, line: 372, baseType: !633, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !646, file: !267, line: 373, baseType: !655, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !267, line: 353, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !267, line: 350, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !657, file: !267, line: 351, baseType: !578, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !657, file: !267, line: 352, baseType: !578, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !605, file: !267, line: 491, baseType: !662, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !267, line: 443, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!578, !578, !633, !633, !642}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !605, file: !267, line: 495, baseType: !667, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !267, line: 444, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!578, !671, !578}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !276, line: 65, baseType: !275)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !605, file: !267, line: 496, baseType: !673, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !267, line: 445, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!578, !677, !578, !578}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !276, line: 145, baseType: !289)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !605, file: !267, line: 509, baseType: !679, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !267, line: 446, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !578, !683, !684}
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !337, line: 48, baseType: !633)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !605, file: !267, line: 516, baseType: !686, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !267, line: 447, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!578, !578, !578, !578}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !605, file: !267, line: 521, baseType: !691, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !267, line: 448, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!578, !578, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !267, line: 435, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !267, line: 432, size: 256, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !697, file: !267, line: 433, baseType: !598, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !697, file: !267, line: 434, baseType: !701, size: 192, offset: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 192, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 3)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !605, file: !267, line: 525, baseType: !705, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !267, line: 415, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!578, !578}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !605, file: !267, line: 528, baseType: !710, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !267, line: 470, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !267, line: 468, size: 64, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !711, file: !267, line: 469, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!571, !578, !717, !580}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !267, line: 464, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !267, line: 451, size: 192, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !719, file: !267, line: 457, baseType: !579, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !719, file: !267, line: 458, baseType: !633, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !719, file: !267, line: 459, baseType: !724, size: 32, offset: 128)
!724 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !605, file: !267, line: 531, baseType: !726, size: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !605, file: !267, line: 537, baseType: !726, size: 64, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !605, file: !267, line: 540, baseType: !730, size: 64, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !267, line: 775, size: 256, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !731, file: !267, line: 776, baseType: !598, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !731, file: !267, line: 777, baseType: !645, size: 192, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "rule_stack_t", file: !101, line: 216, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rule_stack_t", file: !101, line: 212, size: 128, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "src_line", scope: !737, file: !101, line: 213, baseType: !633, size: 56, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rule_id", scope: !737, file: !101, line: 214, baseType: !633, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "arg_i", scope: !737, file: !101, line: 215, baseType: !633, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !745, line: 39, baseType: !746)
!745 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!746 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_chunk_t", file: !101, line: 225, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !101, line: 218, size: 128, elements: !752)
!752 = !{!753, !754, !760}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !751, file: !101, line: 219, baseType: !633, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "union_", scope: !751, file: !101, line: 223, baseType: !755, size: 64, offset: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !101, line: 220, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !755, file: !101, line: 221, baseType: !633, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !101, line: 222, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !751, file: !101, line: 224, baseType: !761, offset: 128)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, elements: !595)
!762 = !{!0, !763, !766, !774, !780}
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression(DW_OP_constu, 102, DW_OP_stack_value))
!764 = distinct !DIGlobalVariable(name: "FIRST_RULE_WITH_OFFSET_ABOVE_255", scope: !2, file: !101, line: 182, type: !765, isLocal: true, isDefinition: true)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "rule_arg_offset_table", scope: !2, file: !101, line: 167, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 1304, elements: !772)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !771, line: 31, baseType: !746)
!771 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!772 = !{!773}
!773 = !DISubrange(count: 163)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "rule_arg_combined_table", scope: !2, file: !101, line: 114, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 6672, elements: !778)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!778 = !{!779}
!779 = !DISubrange(count: 417)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "token_to_op", scope: !782, file: !101, line: 679, type: !884, isLocal: true, isDefinition: true)
!782 = distinct !DISubprogram(name: "fold_constants", scope: !101, file: !101, line: 635, type: !783, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !849)
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !786, !770, !633}
!785 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_t", file: !101, line: 244, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_parser_t", file: !101, line: 227, size: 640, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !842, !848}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack_alloc", scope: !788, file: !101, line: 228, baseType: !633, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack_top", scope: !788, file: !101, line: 229, baseType: !633, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rule_stack", scope: !788, file: !101, line: 230, baseType: !735, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack_alloc", scope: !788, file: !101, line: 232, baseType: !633, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack_top", scope: !788, file: !101, line: 233, baseType: !633, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "result_stack", scope: !788, file: !101, line: 234, baseType: !742, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lexer", scope: !788, file: !101, line: 236, baseType: !797, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !6, line: 168, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !6, line: 148, size: 1280, elements: !800)
!800 = !{!801, !802, !816, !819, !820, !821, !822, !823, !824, !825, !826, !827, !829, !830, !831, !833}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !799, file: !6, line: 149, baseType: !683, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !799, file: !6, line: 150, baseType: !803, size: 192, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !804, line: 40, baseType: !805)
!804 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !804, line: 36, size: 192, elements: !806)
!806 = !{!807, !808, !812}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !805, file: !804, line: 37, baseType: !579, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !805, file: !804, line: 38, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!580, !579}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !805, file: !804, line: 39, baseType: !813, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !579}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !799, file: !6, line: 152, baseType: !817, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !745, line: 131, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !745, line: 40, baseType: !7)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !799, file: !6, line: 152, baseType: !817, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !799, file: !6, line: 152, baseType: !817, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !799, file: !6, line: 154, baseType: !633, size: 64, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !799, file: !6, line: 155, baseType: !633, size: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !799, file: !6, line: 157, baseType: !571, size: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !799, file: !6, line: 158, baseType: !571, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !799, file: !6, line: 160, baseType: !633, size: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !799, file: !6, line: 161, baseType: !633, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !799, file: !6, line: 162, baseType: !828, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !799, file: !6, line: 164, baseType: !633, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !799, file: !6, line: 165, baseType: !633, size: 64, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !799, file: !6, line: 166, baseType: !832, size: 32, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !6, line: 144, baseType: !5)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !799, file: !6, line: 167, baseType: !834, size: 256, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !745, line: 165, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !745, line: 160, size: 256, elements: !836)
!836 = !{!837, !838, !839, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !835, file: !745, line: 161, baseType: !633, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !835, file: !745, line: 162, baseType: !633, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !835, file: !745, line: 163, baseType: !840, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !835, file: !745, line: 164, baseType: !785, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !788, file: !101, line: 238, baseType: !843, size: 128, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !331, line: 100, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !331, line: 97, size: 128, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !844, file: !331, line: 98, baseType: !594, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !844, file: !331, line: 99, baseType: !759, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chunk", scope: !788, file: !101, line: 239, baseType: !749, size: 64, offset: 576)
!849 = !{!850, !851, !852, !853, !854, !857, !858, !863, !866, !869, !871, !874, !875, !876, !877, !880, !881, !882}
!850 = !DILocalVariable(name: "parser", arg: 1, scope: !782, file: !101, line: 635, type: !786)
!851 = !DILocalVariable(name: "rule_id", arg: 2, scope: !782, file: !101, line: 635, type: !770)
!852 = !DILocalVariable(name: "num_args", arg: 3, scope: !782, file: !101, line: 635, type: !633)
!853 = !DILocalVariable(name: "arg0", scope: !782, file: !101, line: 639, type: !578)
!854 = !DILocalVariable(name: "pn", scope: !855, file: !101, line: 644, type: !594)
!855 = distinct !DILexicalBlock(scope: !856, file: !101, line: 642, column: 38)
!856 = distinct !DILexicalBlock(scope: !782, file: !101, line: 640, column: 9)
!857 = !DILocalVariable(name: "op", scope: !855, file: !101, line: 648, type: !677)
!858 = !DILocalVariable(name: "i", scope: !859, file: !101, line: 656, type: !860)
!859 = distinct !DILexicalBlock(scope: !855, file: !101, line: 656, column: 9)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !861, line: 31, baseType: !862)
!861 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_ssize_t.h", directory: "")
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_ssize_t", file: !576, line: 119, baseType: !577)
!863 = !DILocalVariable(name: "arg1", scope: !864, file: !101, line: 658, type: !578)
!864 = distinct !DILexicalBlock(scope: !865, file: !101, line: 656, column: 53)
!865 = distinct !DILexicalBlock(scope: !859, file: !101, line: 656, column: 9)
!866 = !DILocalVariable(name: "pn", scope: !867, file: !101, line: 668, type: !594)
!867 = distinct !DILexicalBlock(scope: !868, file: !101, line: 666, column: 34)
!868 = distinct !DILexicalBlock(scope: !856, file: !101, line: 664, column: 16)
!869 = !DILocalVariable(name: "i", scope: !870, file: !101, line: 672, type: !860)
!870 = distinct !DILexicalBlock(scope: !867, file: !101, line: 672, column: 9)
!871 = !DILocalVariable(name: "arg1", scope: !872, file: !101, line: 674, type: !578)
!872 = distinct !DILexicalBlock(scope: !873, file: !101, line: 672, column: 56)
!873 = distinct !DILexicalBlock(scope: !870, file: !101, line: 672, column: 9)
!874 = !DILocalVariable(name: "tok", scope: !872, file: !101, line: 678, type: !832)
!875 = !DILocalVariable(name: "op", scope: !872, file: !101, line: 692, type: !677)
!876 = !DILocalVariable(name: "rhs_sign", scope: !872, file: !101, line: 696, type: !724)
!877 = !DILocalVariable(name: "pn", scope: !878, file: !101, line: 712, type: !594)
!878 = distinct !DILexicalBlock(scope: !879, file: !101, line: 710, column: 42)
!879 = distinct !DILexicalBlock(scope: !868, file: !101, line: 710, column: 16)
!880 = !DILocalVariable(name: "tok", scope: !878, file: !101, line: 716, type: !832)
!881 = !DILocalVariable(name: "op", scope: !878, file: !101, line: 717, type: !671)
!882 = !DILocalVariable(name: "i", scope: !883, file: !101, line: 815, type: !633)
!883 = distinct !DILexicalBlock(scope: !782, file: !101, line: 815, column: 5)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 88, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 11)
!887 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!888 = !{i32 2, !"Dwarf Version", i32 4}
!889 = !{i32 2, !"Debug Info Version", i32 3}
!890 = !{i32 1, !"wchar_size", i32 4}
!891 = !{i32 7, !"PIC Level", i32 2}
!892 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!893 = distinct !DISubprogram(name: "mp_parse_node_is_const_false", scope: !101, file: !101, line: 351, type: !894, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!785, !594}
!896 = !{!897}
