; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/lib/utils/pyexec.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/lib/utils/pyexec.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!340 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!341 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!342 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!343 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!344 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!345 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!346 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!347 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!348 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!349 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!350 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!351 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!352 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!353 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!354 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!355 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!356 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!357 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!358 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!359 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!360 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!361 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!362 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!363 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!364 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!365 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!366 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!367 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!368 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!369 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!370 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!371 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!372 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!373 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!374 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!375 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!376 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!377 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!378 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!379 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!380 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!381 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!382 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!383 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!384 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!385 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!386 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!387 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!388 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!389 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!390 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!391 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!392 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!393 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!394 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!395 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!396 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!397 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!398 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!399 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!400 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!401 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!402 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!403 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!404 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!405 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!406 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!407 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 34, size: 32, elements: !410)
!409 = !DIFile(filename: "../../py/compile.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!410 = !{!411, !412, !413, !414, !415}
!411 = !DIEnumerator(name: "MP_EMIT_OPT_NONE", value: 0)
!412 = !DIEnumerator(name: "MP_EMIT_OPT_BYTECODE", value: 1)
!413 = !DIEnumerator(name: "MP_EMIT_OPT_NATIVE_PYTHON", value: 2)
!414 = !DIEnumerator(name: "MP_EMIT_OPT_VIPER", value: 3)
!415 = !DIEnumerator(name: "MP_EMIT_OPT_ASM", value: 4)
!416 = !{!417, !418, !419, !440, !486}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !17, line: 46, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !81, line: 168, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !81, line: 148, size: 1280, elements: !422)
!422 = !{!423, !430, !448, !453, !454, !455, !456, !457, !463, !464, !465, !466, !471, !472, !473, !475}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !421, file: !81, line: 149, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !175, line: 48, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !426, line: 31, baseType: !427)
!426 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !428, line: 92, baseType: !429)
!428 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!429 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !421, file: !81, line: 150, baseType: !431, size: 192, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !432, line: 40, baseType: !433)
!432 = !DIFile(filename: "../../py/reader.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !432, line: 36, size: 192, elements: !434)
!434 = !{!435, !436, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !433, file: !432, line: 37, baseType: !418, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !433, file: !432, line: 38, baseType: !437, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !418}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !441, line: 71, baseType: !442)
!441 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !443, line: 30, baseType: !429)
!443 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !433, file: !432, line: 39, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !418}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !421, file: !81, line: 152, baseType: !449, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !450, line: 131, baseType: !451)
!450 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !450, line: 40, baseType: !452)
!452 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !421, file: !81, line: 152, baseType: !449, size: 32, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !421, file: !81, line: 152, baseType: !449, size: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !421, file: !81, line: 154, baseType: !425, size: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !421, file: !81, line: 155, baseType: !425, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !421, file: !81, line: 157, baseType: !458, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !441, line: 70, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !460, line: 32, baseType: !461)
!460 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !428, line: 49, baseType: !462)
!462 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !421, file: !81, line: 158, baseType: !458, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !421, file: !81, line: 160, baseType: !425, size: 64, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !421, file: !81, line: 161, baseType: !425, size: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !421, file: !81, line: 162, baseType: !467, size: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !469, line: 31, baseType: !470)
!469 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!470 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !421, file: !81, line: 164, baseType: !425, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !421, file: !81, line: 165, baseType: !425, size: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !421, file: !81, line: 166, baseType: !474, size: 32, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !81, line: 144, baseType: !80)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !421, file: !81, line: 167, baseType: !476, size: 256, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !450, line: 165, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !450, line: 160, size: 256, elements: !478)
!478 = !{!479, !480, !481, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !477, file: !450, line: 161, baseType: !425, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !477, file: !450, line: 162, baseType: !425, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !477, file: !450, line: 163, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !477, file: !450, line: 164, baseType: !485, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!485 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !489, line: 31, baseType: !452)
!489 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint32_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!490 = !{!0, !491, !494, !645}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "pyexec_system_exit", scope: !2, file: !3, line: 48, type: !493, isLocal: false, isDefinition: true)
!493 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "pyb_set_repl_info_obj", scope: !2, file: !3, line: 560, type: !496, isLocal: false, isDefinition: true)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !17, line: 802, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !17, line: 794, size: 128, elements: !499)
!499 = !{!500, !629}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !17, line: 795, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !17, line: 59, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !17, line: 56, size: 64, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !17, line: 57, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !17, line: 52, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !17, line: 474, size: 960, elements: !509)
!509 = !{!510, !511, !512, !513, !533, !557, !562, !568, !574, !580, !585, !599, !604, !619, !622, !623}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !17, line: 476, baseType: !501, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !17, line: 479, baseType: !468, size: 16, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !17, line: 482, baseType: !468, size: 16, offset: 80)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !508, file: !17, line: 485, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !17, line: 441, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !518, !417, !532}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !521, line: 53, baseType: !522)
!521 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !521, line: 50, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !522, file: !521, line: 51, baseType: !418, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !522, file: !521, line: 52, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !521, line: 48, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !418, !530, !425}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !17, line: 430, baseType: !16)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !508, file: !17, line: 488, baseType: !534, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !17, line: 442, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!417, !505, !425, !538, !540}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !17, line: 374, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !17, line: 365, size: 192, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !542, file: !17, line: 366, baseType: !425, size: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !542, file: !17, line: 367, baseType: !425, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !542, file: !17, line: 368, baseType: !425, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !542, file: !17, line: 369, baseType: !425, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !542, file: !17, line: 371, baseType: !425, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !542, file: !17, line: 372, baseType: !425, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !542, file: !17, line: 373, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !17, line: 353, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !17, line: 350, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !553, file: !17, line: 351, baseType: !417, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !553, file: !17, line: 352, baseType: !417, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !508, file: !17, line: 491, baseType: !558, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !17, line: 443, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!417, !417, !425, !425, !538}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !508, file: !17, line: 495, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !17, line: 444, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!417, !567, !417}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !26, line: 65, baseType: !25)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !508, file: !17, line: 496, baseType: !569, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !17, line: 445, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!417, !573, !417, !417}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !26, line: 145, baseType: !39)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !508, file: !17, line: 509, baseType: !575, size: 64, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !17, line: 446, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !417, !424, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !508, file: !17, line: 516, baseType: !581, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !17, line: 447, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!417, !417, !417, !417}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !508, file: !17, line: 521, baseType: !586, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !17, line: 448, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!417, !417, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !17, line: 435, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !17, line: 432, size: 256, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !592, file: !17, line: 433, baseType: !501, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !592, file: !17, line: 434, baseType: !596, size: 192, offset: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 3)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !508, file: !17, line: 525, baseType: !600, size: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !17, line: 415, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!417, !417}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !508, file: !17, line: 528, baseType: !605, size: 64, offset: 704)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !17, line: 470, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !17, line: 468, size: 64, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !606, file: !17, line: 469, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!458, !417, !612, !440}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !17, line: 464, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !17, line: 451, size: 192, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !614, file: !17, line: 457, baseType: !418, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !614, file: !17, line: 458, baseType: !425, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !614, file: !17, line: 459, baseType: !493, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !508, file: !17, line: 531, baseType: !620, size: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !508, file: !17, line: 537, baseType: !620, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !508, file: !17, line: 540, baseType: !624, size: 64, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !17, line: 775, size: 256, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !625, file: !17, line: 776, baseType: !501, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !625, file: !17, line: 777, baseType: !541, size: 192, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !498, file: !17, line: 801, baseType: !630, size: 64, offset: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !498, file: !17, line: 796, size: 64, elements: !631)
!631 = !{!632, !637, !638, !643}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !630, file: !17, line: 797, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !17, line: 414, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!417}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !630, file: !17, line: 798, baseType: !600, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !630, file: !17, line: 799, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !17, line: 416, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!417, !417, !417}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !630, file: !17, line: 800, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !17, line: 417, baseType: !582)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "repl_display_debugging_info", scope: !2, file: !3, line: 49, type: !485, isLocal: true, isDefinition: true)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "pyexec_mode_kind_t", file: !6, line: 34, baseType: !5)
!648 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!649 = !{i32 2, !"Dwarf Version", i32 4}
!650 = !{i32 2, !"Debug Info Version", i32 3}
!651 = !{i32 1, !"wchar_size", i32 4}
!652 = !{i32 7, !"PIC Level", i32 2}
!653 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!654 = distinct !DISubprogram(name: "pyexec_raw_repl", scope: !3, file: !3, line: 352, type: !655, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{!493}
!657 = !{!658, !659, !666}
!658 = !DILocalVariable(name: "line", scope: !654, file: !3, line: 353, type: !476)
!659 = !DILocalVariable(name: "c", scope: !660, file: !3, line: 363, type: !493)
!660 = distinct !DILexicalBlock(scope: !661, file: !3, line: 362, column: 18)
!661 = distinct !DILexicalBlock(scope: !662, file: !3, line: 362, column: 9)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 362, column: 9)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 359, column: 14)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 359, column: 5)
!665 = distinct !DILexicalBlock(scope: !654, file: !3, line: 359, column: 5)
!666 = !DILocalVariable(name: "ret", scope: !663, file: !3, line: 395, type: !493)
!667 = !DILocation(line: 353, column: 5, scope: !654)
!668 = !DILocation(line: 353, column: 12, scope: !654)
!669 = !DILocation(line: 354, column: 5, scope: !654)
!670 = !DILocation(line: 357, column: 5, scope: !654)
!671 = !DILocation(line: 359, column: 5, scope: !654)
!672 = !DILocation(line: 360, column: 9, scope: !663)
!673 = !DILocation(line: 361, column: 9, scope: !663)
!674 = !DILocation(line: 362, column: 9, scope: !663)
!675 = !DILocation(line: 363, column: 21, scope: !660)
!676 = !DILocation(line: 363, column: 17, scope: !660)
!677 = !DILocation(line: 364, column: 17, scope: !660)
!678 = !DILocation(line: 369, column: 17, scope: !679)
!679 = distinct !DILexicalBlock(scope: !680, file: !3, line: 367, column: 42)
!680 = distinct !DILexicalBlock(scope: !681, file: !3, line: 367, column: 24)
!681 = distinct !DILexicalBlock(scope: !660, file: !3, line: 364, column: 17)
!682 = !DILocation(line: 370, column: 17, scope: !679)
!683 = !DILocation(line: 371, column: 34, scope: !679)
!684 = !{!685, !685, i64 0}
!685 = !{!"omnipotent char", !686, i64 0}
!686 = !{!"Simple C/C++ TBAA"}
!687 = !DILocation(line: 375, column: 17, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !3, line: 373, column: 42)
!689 = distinct !DILexicalBlock(scope: !680, file: !3, line: 373, column: 24)
!690 = !DILocation(line: 376, column: 13, scope: !688)
!691 = !DILocation(line: 381, column: 38, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !3, line: 379, column: 20)
!693 = distinct !DILexicalBlock(scope: !689, file: !3, line: 376, column: 24)
!694 = !DILocation(line: 381, column: 17, scope: !692)
!695 = !DILocation(line: 386, column: 9, scope: !663)
!696 = !DILocation(line: 388, column: 18, scope: !697)
!697 = distinct !DILexicalBlock(scope: !663, file: !3, line: 388, column: 13)
!698 = !{!699, !700, i64 8}
!699 = !{!"_vstr_t", !700, i64 0, !700, i64 8, !701, i64 16, !702, i64 24}
!700 = !{!"long", !685, i64 0}
!701 = !{!"any pointer", !685, i64 0}
!702 = !{!"_Bool", !685, i64 0}
!703 = !DILocation(line: 388, column: 22, scope: !697)
!704 = !DILocation(line: 388, column: 13, scope: !663)
!705 = !DILocation(line: 390, column: 13, scope: !706)
!706 = distinct !DILexicalBlock(scope: !697, file: !3, line: 388, column: 28)
!707 = !DILocation(line: 391, column: 13, scope: !706)
!708 = !DILocation(line: 392, column: 13, scope: !706)
!709 = !DILocation(line: 395, column: 19, scope: !663)
!710 = !DILocation(line: 395, column: 13, scope: !663)
!711 = !DILocation(line: 396, column: 17, scope: !712)
!712 = distinct !DILexicalBlock(scope: !663, file: !3, line: 396, column: 13)
!713 = distinct !{!713, !714, !715}
!714 = !DILocation(line: 359, column: 5, scope: !665)
!715 = !DILocation(line: 399, column: 5, scope: !665)
!716 = !DILocation(line: 400, column: 1, scope: !654)
!717 = distinct !DISubprogram(name: "vstr_reset", scope: !450, file: !450, line: 178, type: !718, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !721)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!721 = !{!722}
!722 = !DILocalVariable(name: "vstr", arg: 1, scope: !717, file: !450, line: 178, type: !720)
!723 = !DILocation(line: 178, column: 39, scope: !717)
!724 = !DILocation(line: 178, column: 53, scope: !717)
!725 = !DILocation(line: 178, column: 57, scope: !717)
!726 = !DILocation(line: 178, column: 62, scope: !717)
!727 = distinct !DISubprogram(name: "parse_compile_execute", scope: !3, file: !3, line: 63, type: !728, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !738)
!728 = !DISubroutineType(types: !729)
!729 = !{!493, !620, !730, !493, !731}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !11, line: 95, baseType: !10)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "pyexec_result_t", file: !6, line: 40, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 36, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "return_code", scope: !733, file: !6, line: 37, baseType: !493, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "exception_type", scope: !733, file: !6, line: 38, baseType: !505, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "exception_line", scope: !733, file: !6, line: 39, baseType: !493, size: 32, offset: 128)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !759, !762, !765, !770, !771, !780, !785, !788, !790, !793, !795, !796, !797}
!739 = !DILocalVariable(name: "source", arg: 1, scope: !727, file: !3, line: 63, type: !620)
!740 = !DILocalVariable(name: "input_kind", arg: 2, scope: !727, file: !3, line: 63, type: !730)
!741 = !DILocalVariable(name: "exec_flags", arg: 3, scope: !727, file: !3, line: 63, type: !493)
!742 = !DILocalVariable(name: "result", arg: 4, scope: !727, file: !3, line: 63, type: !731)
!743 = !DILocalVariable(name: "ret", scope: !727, file: !3, line: 64, type: !493)
!744 = !DILocalVariable(name: "start", scope: !727, file: !3, line: 65, type: !488)
!745 = !DILocalVariable(name: "nlr", scope: !727, file: !3, line: 70, type: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !747, line: 72, baseType: !748)
!747 = !DIFile(filename: "../../py/nlr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !747, line: 73, size: 1344, elements: !749)
!749 = !{!750, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !748, file: !747, line: 75, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !748, file: !747, line: 76, baseType: !418, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !748, file: !747, line: 79, baseType: !754, size: 1184, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !755, line: 37, baseType: !756)
!755 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/setjmp.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 1184, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 37)
!759 = !DILocalVariable(name: "module_fun", scope: !760, file: !3, line: 72, type: !417)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 71, column: 30)
!761 = distinct !DILexicalBlock(scope: !727, file: !3, line: 71, column: 9)
!762 = !DILocalVariable(name: "lex", scope: !763, file: !3, line: 81, type: !419)
!763 = distinct !DILexicalBlock(scope: !764, file: !3, line: 79, column: 9)
!764 = distinct !DILexicalBlock(scope: !760, file: !3, line: 74, column: 13)
!765 = !DILocalVariable(name: "vstr", scope: !766, file: !3, line: 83, type: !768)
!766 = distinct !DILexicalBlock(scope: !767, file: !3, line: 82, column: 56)
!767 = distinct !DILexicalBlock(scope: !763, file: !3, line: 82, column: 17)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!770 = !DILocalVariable(name: "source_name", scope: !763, file: !3, line: 91, type: !424)
!771 = !DILocalVariable(name: "parse_tree", scope: !763, file: !3, line: 95, type: !772)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !11, line: 100, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !11, line: 97, size: 128, elements: !774)
!774 = !{!775, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !773, file: !11, line: 98, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !11, line: 52, baseType: !442)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !773, file: !11, line: 99, baseType: !778, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !11, line: 99, flags: DIFlagFwdDecl)
!780 = !DILocalVariable(name: "return_value", scope: !781, file: !3, line: 143, type: !417)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 142, column: 23)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 142, column: 13)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 140, column: 25)
!784 = distinct !DILexicalBlock(scope: !727, file: !3, line: 140, column: 9)
!785 = !DILocalVariable(name: "n", scope: !786, file: !3, line: 148, type: !425)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 147, column: 61)
!787 = distinct !DILexicalBlock(scope: !781, file: !3, line: 147, column: 17)
!788 = !DILocalVariable(name: "values", scope: !786, file: !3, line: 148, type: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!790 = !DILocalVariable(name: "ticks", scope: !791, file: !3, line: 159, type: !440)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 158, column: 82)
!792 = distinct !DILexicalBlock(scope: !727, file: !3, line: 158, column: 9)
!793 = !DILocalVariable(name: "n_pool", scope: !794, file: !3, line: 163, type: !425)
!794 = distinct !DILexicalBlock(scope: !791, file: !3, line: 162, column: 9)
!795 = !DILocalVariable(name: "n_qstr", scope: !794, file: !3, line: 163, type: !425)
!796 = !DILocalVariable(name: "n_str_data_bytes", scope: !794, file: !3, line: 163, type: !425)
!797 = !DILocalVariable(name: "n_total_bytes", scope: !794, file: !3, line: 163, type: !425)
!798 = !DILocation(line: 63, column: 46, scope: !727)
!799 = !DILocation(line: 63, column: 76, scope: !727)
!800 = !DILocation(line: 63, column: 92, scope: !727)
!801 = !DILocation(line: 63, column: 121, scope: !727)
!802 = !DILocation(line: 64, column: 9, scope: !727)
!803 = !DILocation(line: 65, column: 14, scope: !727)
!804 = !DILocation(line: 68, column: 24, scope: !727)
!805 = !{!806, !806, i64 0}
!806 = !{!"int", !685, i64 0}
!807 = !DILocation(line: 70, column: 5, scope: !727)
!808 = !DILocation(line: 70, column: 15, scope: !727)
!809 = !DILocation(line: 71, column: 9, scope: !761)
!810 = !DILocation(line: 71, column: 24, scope: !761)
!811 = !DILocation(line: 71, column: 9, scope: !727)
!812 = !DILocation(line: 74, column: 24, scope: !764)
!813 = !DILocation(line: 74, column: 13, scope: !760)
!814 = !DILocation(line: 76, column: 57, scope: !815)
!815 = distinct !DILexicalBlock(scope: !764, file: !3, line: 74, column: 56)
!816 = !DILocation(line: 76, column: 26, scope: !815)
!817 = !DILocation(line: 72, column: 18, scope: !760)
!818 = !DILocation(line: 77, column: 9, scope: !815)
!819 = !DILocation(line: 82, column: 28, scope: !767)
!820 = !DILocation(line: 82, column: 17, scope: !763)
!821 = !DILocation(line: 83, column: 31, scope: !766)
!822 = !DILocation(line: 84, column: 78, scope: !766)
!823 = !{!699, !701, i64 16}
!824 = !DILocation(line: 84, column: 89, scope: !766)
!825 = !DILocation(line: 84, column: 23, scope: !766)
!826 = !DILocation(line: 81, column: 25, scope: !763)
!827 = !DILocation(line: 85, column: 13, scope: !766)
!828 = !DILocation(line: 85, column: 35, scope: !829)
!829 = distinct !DILexicalBlock(scope: !767, file: !3, line: 85, column: 24)
!830 = !DILocation(line: 85, column: 24, scope: !767)
!831 = !DILocation(line: 86, column: 23, scope: !832)
!832 = distinct !DILexicalBlock(scope: !829, file: !3, line: 85, column: 67)
!833 = !DILocation(line: 87, column: 13, scope: !832)
!834 = !DILocation(line: 88, column: 23, scope: !835)
!835 = distinct !DILexicalBlock(scope: !829, file: !3, line: 87, column: 20)
!836 = !DILocation(line: 0, scope: !835)
!837 = !DILocation(line: 91, column: 37, scope: !763)
!838 = !{!839, !700, i64 0}
