; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/lib/utils/pyexec.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/lib/utils/pyexec.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!356 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!357 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!358 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!359 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!360 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!361 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!362 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!363 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!364 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!365 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!366 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!367 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!368 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!369 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!370 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!371 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!372 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!373 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!374 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!375 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!376 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!377 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!378 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!379 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!380 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!381 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!382 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!383 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!384 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!385 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!386 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!387 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!388 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!389 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!390 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!391 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!392 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!393 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!394 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!395 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!396 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!397 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!398 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!399 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!400 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!401 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!402 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!403 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!404 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!405 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!406 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!407 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!408 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !410, line: 34, baseType: !7, size: 32, elements: !411)
!410 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/compile.h", directory: "")
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIEnumerator(name: "MP_EMIT_OPT_NONE", value: 0, isUnsigned: true)
!413 = !DIEnumerator(name: "MP_EMIT_OPT_BYTECODE", value: 1, isUnsigned: true)
!414 = !DIEnumerator(name: "MP_EMIT_OPT_NATIVE_PYTHON", value: 2, isUnsigned: true)
!415 = !DIEnumerator(name: "MP_EMIT_OPT_VIPER", value: 3, isUnsigned: true)
!416 = !DIEnumerator(name: "MP_EMIT_OPT_ASM", value: 4, isUnsigned: true)
!417 = !{!418, !419, !420, !441, !486}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !18, line: 46, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_lexer_t", file: !82, line: 168, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_lexer_t", file: !82, line: 148, size: 1280, elements: !423)
!423 = !{!424, !431, !449, !453, !454, !455, !456, !457, !463, !464, !465, !466, !471, !472, !473, !475}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "source_name", scope: !422, file: !82, line: 149, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !176, line: 48, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 31, baseType: !428)
!427 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !429, line: 92, baseType: !430)
!429 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!430 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !422, file: !82, line: 150, baseType: !432, size: 192, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_reader_t", file: !433, line: 40, baseType: !434)
!433 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/reader.h", directory: "")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_reader_t", file: !433, line: 36, size: 192, elements: !435)
!435 = !{!436, !437, !445}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !434, file: !433, line: 37, baseType: !419, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "readbyte", scope: !434, file: !433, line: 38, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !419}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !442, line: 70, baseType: !443)
!442 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !444, line: 30, baseType: !430)
!444 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !434, file: !433, line: 39, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !419}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "chr0", scope: !422, file: !82, line: 152, baseType: !450, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !451, line: 131, baseType: !452)
!451 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !451, line: 40, baseType: !7)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chr1", scope: !422, file: !82, line: 152, baseType: !450, size: 32, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "chr2", scope: !422, file: !82, line: 152, baseType: !450, size: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !422, file: !82, line: 154, baseType: !426, size: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !422, file: !82, line: 155, baseType: !426, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "emit_dent", scope: !422, file: !82, line: 157, baseType: !458, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !442, line: 69, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !460, line: 32, baseType: !461)
!460 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !429, line: 49, baseType: !462)
!462 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nested_bracket_level", scope: !422, file: !82, line: 158, baseType: !458, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_indent_level", scope: !422, file: !82, line: 160, baseType: !426, size: 64, offset: 640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "num_indent_level", scope: !422, file: !82, line: 161, baseType: !426, size: 64, offset: 704)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "indent_level", scope: !422, file: !82, line: 162, baseType: !467, size: 64, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !469, line: 31, baseType: !470)
!469 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!470 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tok_line", scope: !422, file: !82, line: 164, baseType: !426, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tok_column", scope: !422, file: !82, line: 165, baseType: !426, size: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tok_kind", scope: !422, file: !82, line: 166, baseType: !474, size: 32, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_token_kind_t", file: !82, line: 144, baseType: !81)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vstr", scope: !422, file: !82, line: 167, baseType: !476, size: 256, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !451, line: 165, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !451, line: 160, size: 256, elements: !478)
!478 = !{!479, !480, !481, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !477, file: !451, line: 161, baseType: !426, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !477, file: !451, line: 162, baseType: !426, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !477, file: !451, line: 163, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !477, file: !451, line: 164, baseType: !485, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!485 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !489, line: 31, baseType: !7)
!489 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint32_t.h", directory: "")
!490 = !{!0, !491, !495, !646}
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "pyexec_system_exit", scope: !2, file: !493, line: 48, type: !494, isLocal: false, isDefinition: true)
!493 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/lib/utils/pyexec.c", directory: "")
!494 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "pyb_set_repl_info_obj", scope: !2, file: !493, line: 560, type: !497, isLocal: false, isDefinition: true)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !18, line: 802, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !18, line: 794, size: 128, elements: !500)
!500 = !{!501, !630}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !499, file: !18, line: 795, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !18, line: 59, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !18, line: 56, size: 64, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !18, line: 57, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !18, line: 52, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !18, line: 474, size: 960, elements: !510)
!510 = !{!511, !512, !513, !514, !534, !558, !563, !569, !575, !581, !586, !600, !605, !620, !623, !624}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !18, line: 476, baseType: !502, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !18, line: 479, baseType: !468, size: 16, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !18, line: 482, baseType: !468, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !509, file: !18, line: 485, baseType: !515, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !18, line: 441, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519, !418, !533}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !522, line: 53, baseType: !523)
!522 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !522, line: 50, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !523, file: !522, line: 51, baseType: !419, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !523, file: !522, line: 52, baseType: !527, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !522, line: 48, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !419, !531, !426}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !18, line: 430, baseType: !17)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !509, file: !18, line: 488, baseType: !535, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !18, line: 442, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!418, !506, !426, !539, !541}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !18, line: 374, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !18, line: 365, size: 192, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !543, file: !18, line: 366, baseType: !426, size: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !543, file: !18, line: 367, baseType: !426, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !543, file: !18, line: 368, baseType: !426, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !543, file: !18, line: 369, baseType: !426, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !543, file: !18, line: 371, baseType: !426, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !543, file: !18, line: 372, baseType: !426, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !543, file: !18, line: 373, baseType: !552, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !18, line: 353, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !18, line: 350, size: 128, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !554, file: !18, line: 351, baseType: !418, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !554, file: !18, line: 352, baseType: !418, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !509, file: !18, line: 491, baseType: !559, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !18, line: 443, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!418, !418, !426, !426, !539}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !509, file: !18, line: 495, baseType: !564, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !18, line: 444, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!418, !568, !418}
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !27, line: 65, baseType: !26)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !509, file: !18, line: 496, baseType: !570, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !18, line: 445, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!418, !574, !418, !418}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !27, line: 145, baseType: !40)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !509, file: !18, line: 509, baseType: !576, size: 64, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !18, line: 446, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !418, !425, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !509, file: !18, line: 516, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !18, line: 447, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!418, !418, !418, !418}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !509, file: !18, line: 521, baseType: !587, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !18, line: 448, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!418, !418, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !18, line: 435, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !18, line: 432, size: 256, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !593, file: !18, line: 433, baseType: !502, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !593, file: !18, line: 434, baseType: !597, size: 192, offset: 64)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 192, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 3)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !509, file: !18, line: 525, baseType: !601, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !18, line: 415, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!418, !418}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !509, file: !18, line: 528, baseType: !606, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !18, line: 470, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !18, line: 468, size: 64, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !607, file: !18, line: 469, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!458, !418, !613, !441}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !18, line: 464, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !18, line: 451, size: 192, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !615, file: !18, line: 457, baseType: !419, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !615, file: !18, line: 458, baseType: !426, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !615, file: !18, line: 459, baseType: !494, size: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !509, file: !18, line: 531, baseType: !621, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !509, file: !18, line: 537, baseType: !621, size: 64, offset: 832)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !509, file: !18, line: 540, baseType: !625, size: 64, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !18, line: 775, size: 256, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !626, file: !18, line: 776, baseType: !502, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !626, file: !18, line: 777, baseType: !542, size: 192, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !499, file: !18, line: 801, baseType: !631, size: 64, offset: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !499, file: !18, line: 796, size: 64, elements: !632)
!632 = !{!633, !638, !639, !644}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !631, file: !18, line: 797, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !18, line: 414, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!418}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !631, file: !18, line: 798, baseType: !601, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !631, file: !18, line: 799, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !18, line: 416, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!418, !418, !418}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !631, file: !18, line: 800, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !18, line: 417, baseType: !583)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "repl_display_debugging_info", scope: !2, file: !493, line: 49, type: !485, isLocal: true, isDefinition: true)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "pyexec_mode_kind_t", file: !6, line: 34, baseType: !5)
!649 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!650 = !{i32 2, !"Dwarf Version", i32 4}
!651 = !{i32 2, !"Debug Info Version", i32 3}
!652 = !{i32 1, !"wchar_size", i32 4}
!653 = !{i32 7, !"PIC Level", i32 2}
!654 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!655 = distinct !DISubprogram(name: "pyexec_raw_repl", scope: !493, file: !493, line: 352, type: !656, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{!494}
!658 = !{!659, !660, !667}
!659 = !DILocalVariable(name: "line", scope: !655, file: !493, line: 353, type: !476)
!660 = !DILocalVariable(name: "c", scope: !661, file: !493, line: 363, type: !494)
!661 = distinct !DILexicalBlock(scope: !662, file: !493, line: 362, column: 18)
!662 = distinct !DILexicalBlock(scope: !663, file: !493, line: 362, column: 9)
!663 = distinct !DILexicalBlock(scope: !664, file: !493, line: 362, column: 9)
!664 = distinct !DILexicalBlock(scope: !665, file: !493, line: 359, column: 14)
!665 = distinct !DILexicalBlock(scope: !666, file: !493, line: 359, column: 5)
!666 = distinct !DILexicalBlock(scope: !655, file: !493, line: 359, column: 5)
!667 = !DILocalVariable(name: "ret", scope: !664, file: !493, line: 395, type: !494)
!668 = !DILocation(line: 353, column: 5, scope: !655)
!669 = !DILocation(line: 353, column: 12, scope: !655)
!670 = !DILocation(line: 354, column: 5, scope: !655)
!671 = !DILocation(line: 0, scope: !672)
!672 = distinct !DILexicalBlock(scope: !664, file: !493, line: 388, column: 13)
!673 = !DILocation(line: 357, column: 5, scope: !655)
!674 = !DILocation(line: 359, column: 5, scope: !655)
!675 = !DILocation(line: 360, column: 9, scope: !664)
!676 = !DILocation(line: 361, column: 9, scope: !664)
!677 = !DILocation(line: 362, column: 9, scope: !664)
!678 = !DILocation(line: 363, column: 21, scope: !661)
!679 = !DILocation(line: 363, column: 17, scope: !661)
!680 = !DILocation(line: 364, column: 17, scope: !661)
!681 = !DILocation(line: 369, column: 17, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !493, line: 367, column: 42)
!683 = distinct !DILexicalBlock(scope: !684, file: !493, line: 367, column: 24)
!684 = distinct !DILexicalBlock(scope: !661, file: !493, line: 364, column: 17)
!685 = !DILocation(line: 370, column: 17, scope: !682)
!686 = !DILocation(line: 371, column: 34, scope: !682)
!687 = !{!688, !688, i64 0}
!688 = !{!"omnipotent char", !689, i64 0}
!689 = !{!"Simple C/C++ TBAA"}
!690 = !DILocation(line: 375, column: 17, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !493, line: 373, column: 42)
!692 = distinct !DILexicalBlock(scope: !683, file: !493, line: 373, column: 24)
!693 = !DILocation(line: 376, column: 13, scope: !691)
!694 = !DILocation(line: 381, column: 38, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !493, line: 379, column: 20)
!696 = distinct !DILexicalBlock(scope: !692, file: !493, line: 376, column: 24)
!697 = !DILocation(line: 381, column: 17, scope: !695)
!698 = !DILocation(line: 386, column: 9, scope: !664)
!699 = !DILocation(line: 388, column: 18, scope: !672)
!700 = !{!701, !702, i64 8}
!701 = !{!"_vstr_t", !702, i64 0, !702, i64 8, !703, i64 16, !704, i64 24}
!702 = !{!"long", !688, i64 0}
!703 = !{!"any pointer", !688, i64 0}
!704 = !{!"_Bool", !688, i64 0}
!705 = !DILocation(line: 388, column: 22, scope: !672)
!706 = !DILocation(line: 388, column: 13, scope: !664)
!707 = !DILocation(line: 390, column: 13, scope: !708)
!708 = distinct !DILexicalBlock(scope: !672, file: !493, line: 388, column: 28)
!709 = !DILocation(line: 391, column: 13, scope: !708)
!710 = !DILocation(line: 392, column: 13, scope: !708)
!711 = !DILocation(line: 395, column: 19, scope: !664)
!712 = !DILocation(line: 395, column: 13, scope: !664)
!713 = !DILocation(line: 396, column: 17, scope: !714)
!714 = distinct !DILexicalBlock(scope: !664, file: !493, line: 396, column: 13)
!715 = distinct !{!715, !716, !717}
!716 = !DILocation(line: 359, column: 5, scope: !666)
!717 = !DILocation(line: 399, column: 5, scope: !666)
!718 = !DILocation(line: 400, column: 1, scope: !655)
!719 = distinct !DISubprogram(name: "vstr_reset", scope: !451, file: !451, line: 178, type: !720, scopeLine: 178, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !723)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!723 = !{!724}
!724 = !DILocalVariable(name: "vstr", arg: 1, scope: !719, file: !451, line: 178, type: !722)
!725 = !DILocation(line: 178, column: 39, scope: !719)
!726 = !DILocation(line: 178, column: 53, scope: !719)
!727 = !DILocation(line: 178, column: 57, scope: !719)
!728 = !DILocation(line: 178, column: 62, scope: !719)
!729 = distinct !DISubprogram(name: "parse_compile_execute", scope: !493, file: !493, line: 63, type: !730, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !740)
!730 = !DISubroutineType(types: !731)
!731 = !{!494, !621, !732, !494, !733}
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_input_kind_t", file: !12, line: 95, baseType: !11)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "pyexec_result_t", file: !6, line: 40, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 36, size: 192, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "return_code", scope: !735, file: !6, line: 37, baseType: !494, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "exception_type", scope: !735, file: !6, line: 38, baseType: !506, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "exception_line", scope: !735, file: !6, line: 39, baseType: !494, size: 32, offset: 128)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !761, !764, !767, !772, !773, !782, !787, !790, !792, !795, !797, !798, !799}
!741 = !DILocalVariable(name: "source", arg: 1, scope: !729, file: !493, line: 63, type: !621)
!742 = !DILocalVariable(name: "input_kind", arg: 2, scope: !729, file: !493, line: 63, type: !732)
!743 = !DILocalVariable(name: "exec_flags", arg: 3, scope: !729, file: !493, line: 63, type: !494)
!744 = !DILocalVariable(name: "result", arg: 4, scope: !729, file: !493, line: 63, type: !733)
!745 = !DILocalVariable(name: "ret", scope: !729, file: !493, line: 64, type: !494)
!746 = !DILocalVariable(name: "start", scope: !729, file: !493, line: 65, type: !488)
!747 = !DILocalVariable(name: "nlr", scope: !729, file: !493, line: 70, type: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !749, line: 72, baseType: !750)
!749 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/nlr.h", directory: "")
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !749, line: 73, size: 1344, elements: !751)
!751 = !{!752, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !749, line: 75, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !750, file: !749, line: 76, baseType: !419, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !750, file: !749, line: 79, baseType: !756, size: 1184, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !757, line: 37, baseType: !758)
!757 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/setjmp.h", directory: "")
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 1184, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 37)
!761 = !DILocalVariable(name: "module_fun", scope: !762, file: !493, line: 72, type: !418)
!762 = distinct !DILexicalBlock(scope: !763, file: !493, line: 71, column: 30)
!763 = distinct !DILexicalBlock(scope: !729, file: !493, line: 71, column: 9)
!764 = !DILocalVariable(name: "lex", scope: !765, file: !493, line: 81, type: !420)
!765 = distinct !DILexicalBlock(scope: !766, file: !493, line: 79, column: 9)
!766 = distinct !DILexicalBlock(scope: !762, file: !493, line: 74, column: 13)
!767 = !DILocalVariable(name: "vstr", scope: !768, file: !493, line: 83, type: !770)
!768 = distinct !DILexicalBlock(scope: !769, file: !493, line: 82, column: 56)
!769 = distinct !DILexicalBlock(scope: !765, file: !493, line: 82, column: 17)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!772 = !DILocalVariable(name: "source_name", scope: !765, file: !493, line: 91, type: !425)
!773 = !DILocalVariable(name: "parse_tree", scope: !765, file: !493, line: 95, type: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_tree_t", file: !12, line: 100, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_t", file: !12, line: 97, size: 128, elements: !776)
!776 = !{!777, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !775, file: !12, line: 98, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !12, line: 52, baseType: !443)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !775, file: !12, line: 99, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_chunk_t", file: !12, line: 99, flags: DIFlagFwdDecl)
!782 = !DILocalVariable(name: "return_value", scope: !783, file: !493, line: 143, type: !418)
!783 = distinct !DILexicalBlock(scope: !784, file: !493, line: 142, column: 23)
!784 = distinct !DILexicalBlock(scope: !785, file: !493, line: 142, column: 13)
!785 = distinct !DILexicalBlock(scope: !786, file: !493, line: 140, column: 25)
!786 = distinct !DILexicalBlock(scope: !729, file: !493, line: 140, column: 9)
!787 = !DILocalVariable(name: "n", scope: !788, file: !493, line: 148, type: !426)
!788 = distinct !DILexicalBlock(scope: !789, file: !493, line: 147, column: 61)
!789 = distinct !DILexicalBlock(scope: !783, file: !493, line: 147, column: 17)
!790 = !DILocalVariable(name: "values", scope: !788, file: !493, line: 148, type: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!792 = !DILocalVariable(name: "ticks", scope: !793, file: !493, line: 159, type: !441)
!793 = distinct !DILexicalBlock(scope: !794, file: !493, line: 158, column: 82)
!794 = distinct !DILexicalBlock(scope: !729, file: !493, line: 158, column: 9)
!795 = !DILocalVariable(name: "n_pool", scope: !796, file: !493, line: 163, type: !426)
!796 = distinct !DILexicalBlock(scope: !793, file: !493, line: 162, column: 9)
!797 = !DILocalVariable(name: "n_qstr", scope: !796, file: !493, line: 163, type: !426)
!798 = !DILocalVariable(name: "n_str_data_bytes", scope: !796, file: !493, line: 163, type: !426)
!799 = !DILocalVariable(name: "n_total_bytes", scope: !796, file: !493, line: 163, type: !426)
!800 = !DILocation(line: 63, column: 46, scope: !729)
!801 = !DILocation(line: 63, column: 76, scope: !729)
!802 = !DILocation(line: 63, column: 92, scope: !729)
!803 = !DILocation(line: 63, column: 121, scope: !729)
!804 = !DILocation(line: 64, column: 9, scope: !729)
!805 = !DILocation(line: 65, column: 14, scope: !729)
!806 = !DILocation(line: 68, column: 24, scope: !729)
!807 = !{!808, !808, i64 0}
!808 = !{!"int", !688, i64 0}
!809 = !DILocation(line: 70, column: 5, scope: !729)
!810 = !DILocation(line: 70, column: 15, scope: !729)
!811 = !DILocation(line: 71, column: 9, scope: !763)
!812 = !DILocation(line: 71, column: 24, scope: !763)
!813 = !DILocation(line: 71, column: 9, scope: !729)
!814 = !DILocation(line: 74, column: 24, scope: !766)
!815 = !DILocation(line: 74, column: 13, scope: !762)
!816 = !DILocation(line: 76, column: 57, scope: !817)
!817 = distinct !DILexicalBlock(scope: !766, file: !493, line: 74, column: 56)
!818 = !DILocation(line: 76, column: 26, scope: !817)
!819 = !DILocation(line: 72, column: 18, scope: !762)
!820 = !DILocation(line: 77, column: 9, scope: !817)
!821 = !DILocation(line: 82, column: 28, scope: !769)
!822 = !DILocation(line: 82, column: 17, scope: !765)
!823 = !DILocation(line: 83, column: 31, scope: !768)
!824 = !DILocation(line: 84, column: 78, scope: !768)
!825 = !{!701, !703, i64 16}
!826 = !DILocation(line: 84, column: 89, scope: !768)
!827 = !DILocation(line: 84, column: 23, scope: !768)
!828 = !DILocation(line: 81, column: 25, scope: !765)
!829 = !DILocation(line: 85, column: 13, scope: !768)
!830 = !DILocation(line: 85, column: 35, scope: !831)
!831 = distinct !DILexicalBlock(scope: !769, file: !493, line: 85, column: 24)
!832 = !DILocation(line: 85, column: 24, scope: !769)
!833 = !DILocation(line: 86, column: 23, scope: !834)
!834 = distinct !DILexicalBlock(scope: !831, file: !493, line: 85, column: 67)
!835 = !DILocation(line: 87, column: 13, scope: !834)
!836 = !DILocation(line: 88, column: 23, scope: !837)
!837 = distinct !DILexicalBlock(scope: !831, file: !493, line: 87, column: 20)
!838 = !DILocation(line: 0, scope: !769)
!839 = !DILocation(line: 91, column: 37, scope: !765)
