; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!1 = distinct !DIGlobalVariable(name: "rl", scope: !2, file: !6, line: 99, type: !26, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !24, nameTableKind: GNU)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c", directory: "/private/var/folders/8t/rc0yh_3d5j32mgv0b31lrm080000gn/T")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "ESEQ_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ESEQ_ESC", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ESEQ_ESC_BRACKET", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "ESEQ_ESC_BRACKET_DIGIT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "ESEQ_ESC_O", value: 4, isUnsigned: true)
!14 = !{!15, !20, !21, !22}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !16, line: 31, baseType: !17)
!16 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !18, line: 92, baseType: !19)
!18 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!19 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{!25}
!25 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "readline_t", file: !6, line: 97, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_readline_t", file: !6, line: 89, size: 384, elements: !28)
!28 = !{!29, !40, !41, !42, !43, !44, !48}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !27, file: !6, line: 90, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !32, line: 165, baseType: !33)
!32 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !32, line: 160, size: 256, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !33, file: !32, line: 161, baseType: !15, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !33, file: !32, line: 162, baseType: !15, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !33, file: !32, line: 163, baseType: !22, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !33, file: !32, line: 164, baseType: !39, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!39 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "orig_line_len", scope: !27, file: !6, line: 91, baseType: !15, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "escape_seq", scope: !27, file: !6, line: 92, baseType: !20, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cur", scope: !27, file: !6, line: 93, baseType: !20, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_pos", scope: !27, file: !6, line: 94, baseType: !15, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "escape_seq_buf", scope: !27, file: !6, line: 95, baseType: !45, size: 8, offset: 256)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 1)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !27, file: !6, line: 96, baseType: !49, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!51 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!52 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 32))
!53 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 160, 32))
!54 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 192, 64))
!55 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 320, 64))
!56 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 256, 8))
!57 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!58 = !{i32 2, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = !{i32 7, !"PIC Level", i32 2}
!62 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!63 = distinct !DISubprogram(name: "readline_init0", scope: !6, file: !6, line: 47, type: !64, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null}
!66 = !{}
!67 = !DILocation(line: 48, column: 5, scope: !63)
!68 = !DILocation(line: 49, column: 1, scope: !63)
!69 = distinct !DISubprogram(name: "readline_process_char", scope: !6, file: !6, line: 101, type: !70, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{!20, !20}
!72 = !{!73, !74, !75, !76, !77, !78, !91, !94, !95}
!73 = !DILocalVariable(name: "c", arg: 1, scope: !69, file: !6, line: 101, type: !20)
!74 = !DILocalVariable(name: "last_line_len", scope: !69, file: !6, line: 102, type: !15)
!75 = !DILocalVariable(name: "redraw_step_back", scope: !69, file: !6, line: 103, type: !20)
!76 = !DILocalVariable(name: "redraw_from_cursor", scope: !69, file: !6, line: 104, type: !39)
!77 = !DILocalVariable(name: "redraw_step_forward", scope: !69, file: !6, line: 105, type: !20)
!78 = !DILocalVariable(name: "nspace", scope: !79, file: !6, line: 178, type: !20)
!79 = distinct !DILexicalBlock(scope: !80, file: !6, line: 161, column: 51)
!80 = distinct !DILexicalBlock(scope: !81, file: !6, line: 161, column: 17)
!81 = distinct !DILexicalBlock(scope: !82, file: !6, line: 159, column: 40)
!82 = distinct !DILexicalBlock(scope: !83, file: !6, line: 159, column: 20)
!83 = distinct !DILexicalBlock(scope: !84, file: !6, line: 156, column: 20)
!84 = distinct !DILexicalBlock(scope: !85, file: !6, line: 151, column: 20)
!85 = distinct !DILexicalBlock(scope: !86, file: !6, line: 126, column: 20)
!86 = distinct !DILexicalBlock(scope: !87, file: !6, line: 118, column: 20)
!87 = distinct !DILexicalBlock(scope: !88, file: !6, line: 110, column: 20)
!88 = distinct !DILexicalBlock(scope: !89, file: !6, line: 107, column: 13)
!89 = distinct !DILexicalBlock(scope: !90, file: !6, line: 106, column: 37)
!90 = distinct !DILexicalBlock(scope: !69, file: !6, line: 106, column: 9)
!91 = !DILocalVariable(name: "compl_str", scope: !92, file: !6, line: 190, type: !49)
!92 = distinct !DILexicalBlock(scope: !93, file: !6, line: 188, column: 28)
!93 = distinct !DILexicalBlock(scope: !82, file: !6, line: 188, column: 20)
!94 = !DILocalVariable(name: "compl_len", scope: !92, file: !6, line: 191, type: !15)
!95 = !DILocalVariable(name: "i", scope: !96, file: !6, line: 201, type: !15)
!96 = distinct !DILexicalBlock(scope: !97, file: !6, line: 201, column: 17)
!97 = distinct !DILexicalBlock(scope: !98, file: !6, line: 199, column: 20)
!98 = distinct !DILexicalBlock(scope: !99, file: !6, line: 194, column: 24)
!99 = distinct !DILexicalBlock(scope: !92, file: !6, line: 192, column: 17)
