; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!1 = distinct !DIGlobalVariable(name: "rl", scope: !2, file: !3, line: 99, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !22)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/lib/mp-readline/readline.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 45, size: 32, elements: !6)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "ESEQ_NONE", value: 0)
!8 = !DIEnumerator(name: "ESEQ_ESC", value: 1)
!9 = !DIEnumerator(name: "ESEQ_ESC_BRACKET", value: 2)
!10 = !DIEnumerator(name: "ESEQ_ESC_BRACKET_DIGIT", value: 3)
!11 = !DIEnumerator(name: "ESEQ_ESC_O", value: 4)
!12 = !{!13, !18, !19, !20}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 31, baseType: !15)
!14 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !16, line: 92, baseType: !17)
!16 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!23}
!23 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "readline_t", file: !3, line: 97, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_readline_t", file: !3, line: 89, size: 384, elements: !26)
!26 = !{!27, !38, !39, !40, !41, !42, !46}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !25, file: !3, line: 90, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !30, line: 165, baseType: !31)
!30 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !30, line: 160, size: 256, elements: !32)
!32 = !{!33, !34, !35, !36}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !31, file: !30, line: 161, baseType: !13, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !31, file: !30, line: 162, baseType: !13, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !31, file: !30, line: 163, baseType: !20, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !31, file: !30, line: 164, baseType: !37, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "orig_line_len", scope: !25, file: !3, line: 91, baseType: !13, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "escape_seq", scope: !25, file: !3, line: 92, baseType: !18, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "hist_cur", scope: !25, file: !3, line: 93, baseType: !18, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_pos", scope: !25, file: !3, line: 94, baseType: !13, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "escape_seq_buf", scope: !25, file: !3, line: 95, baseType: !43, size: 8, offset: 256)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !25, file: !3, line: 96, baseType: !47, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!49 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!50 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 128, 32))
!51 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 160, 32))
!52 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 192, 64))
!53 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 320, 64))
!54 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 256, 8))
!55 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{i32 7, !"PIC Level", i32 2}
!60 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!61 = distinct !DISubprogram(name: "readline_init0", scope: !3, file: !3, line: 47, type: !62, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !64)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !{}
!65 = !DILocation(line: 48, column: 5, scope: !61)
!66 = !DILocation(line: 49, column: 1, scope: !61)
!67 = distinct !DISubprogram(name: "readline_process_char", scope: !3, file: !3, line: 101, type: !68, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !70)
!68 = !DISubroutineType(types: !69)
!69 = !{!18, !18}
!70 = !{!71, !72, !73, !74, !75, !76, !89, !92, !93}
!71 = !DILocalVariable(name: "c", arg: 1, scope: !67, file: !3, line: 101, type: !18)
!72 = !DILocalVariable(name: "last_line_len", scope: !67, file: !3, line: 102, type: !13)
!73 = !DILocalVariable(name: "redraw_step_back", scope: !67, file: !3, line: 103, type: !18)
!74 = !DILocalVariable(name: "redraw_from_cursor", scope: !67, file: !3, line: 104, type: !37)
!75 = !DILocalVariable(name: "redraw_step_forward", scope: !67, file: !3, line: 105, type: !18)
!76 = !DILocalVariable(name: "nspace", scope: !77, file: !3, line: 178, type: !18)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 161, column: 51)
!78 = distinct !DILexicalBlock(scope: !79, file: !3, line: 161, column: 17)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 159, column: 40)
!80 = distinct !DILexicalBlock(scope: !81, file: !3, line: 159, column: 20)
!81 = distinct !DILexicalBlock(scope: !82, file: !3, line: 156, column: 20)
!82 = distinct !DILexicalBlock(scope: !83, file: !3, line: 151, column: 20)
!83 = distinct !DILexicalBlock(scope: !84, file: !3, line: 126, column: 20)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 118, column: 20)
!85 = distinct !DILexicalBlock(scope: !86, file: !3, line: 110, column: 20)
!86 = distinct !DILexicalBlock(scope: !87, file: !3, line: 107, column: 13)
!87 = distinct !DILexicalBlock(scope: !88, file: !3, line: 106, column: 37)
!88 = distinct !DILexicalBlock(scope: !67, file: !3, line: 106, column: 9)
!89 = !DILocalVariable(name: "compl_str", scope: !90, file: !3, line: 190, type: !47)
!90 = distinct !DILexicalBlock(scope: !91, file: !3, line: 188, column: 28)
!91 = distinct !DILexicalBlock(scope: !80, file: !3, line: 188, column: 20)
!92 = !DILocalVariable(name: "compl_len", scope: !90, file: !3, line: 191, type: !13)
!93 = !DILocalVariable(name: "i", scope: !94, file: !3, line: 201, type: !13)
!94 = distinct !DILexicalBlock(scope: !95, file: !3, line: 201, column: 17)
!95 = distinct !DILexicalBlock(scope: !96, file: !3, line: 199, column: 20)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 194, column: 24)
!97 = distinct !DILexicalBlock(scope: !90, file: !3, line: 192, column: 17)
