; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/scope.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/scope.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._scope_t = type { i32, %struct._scope_t*, %struct._scope_t*, i64, i16, i16, %struct._mp_raw_code_t*, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, %struct._id_info_t* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._id_info_t = type { i8, i8, i16, i64 }
%struct._mp_parse_node_struct_t = type { i32, i32, [0 x i64] }

@scope_simple_name_table = internal unnamed_addr constant [7 x i8] c"0\0012345", align 1, !dbg !0

; Function Attrs: nounwind ssp uwtable
define %struct._scope_t* @scope_new(i32, i64, i64, i64) local_unnamed_addr #0 !dbg !126 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !130, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i64 %1, metadata !131, metadata !DIExpression()), !dbg !136
  call void @llvm.dbg.value(metadata i64 %2, metadata !132, metadata !DIExpression()), !dbg !137
  call void @llvm.dbg.value(metadata i64 %3, metadata !133, metadata !DIExpression()), !dbg !138
  %5 = tail call i8* @m_malloc0(i64 80, i1 zeroext false) #5, !dbg !139
  %6 = bitcast i8* %5 to %struct._scope_t*, !dbg !139

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "scope_simple_name_table", scope: !2, file: !3, line: 34, type: !116, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple LLVM version 10.0.1 (clang-1001.0.46.4)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !115)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/scope.c", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!4 = !{!5, !16}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, size: 32, elements: !7)
!6 = !DIFile(filename: "../../py/scope.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15}
!8 = !DIEnumerator(name: "SCOPE_MODULE", value: 0)
!9 = !DIEnumerator(name: "SCOPE_CLASS", value: 1)
!10 = !DIEnumerator(name: "SCOPE_LAMBDA", value: 2)
!11 = !DIEnumerator(name: "SCOPE_LIST_COMP", value: 3)
!12 = !DIEnumerator(name: "SCOPE_DICT_COMP", value: 4)
!13 = !DIEnumerator(name: "SCOPE_SET_COMP", value: 5)
!14 = !DIEnumerator(name: "SCOPE_GEN_EXPR", value: 6)
!15 = !DIEnumerator(name: "SCOPE_FUNCTION", value: 7)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 32, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "ID_INFO_KIND_GLOBAL_IMPLICIT", value: 0)
!19 = !DIEnumerator(name: "ID_INFO_KIND_GLOBAL_EXPLICIT", value: 1)
!20 = !DIEnumerator(name: "ID_INFO_KIND_LOCAL", value: 2)
!21 = !DIEnumerator(name: "ID_INFO_KIND_CELL", value: 3)
!22 = !DIEnumerator(name: "ID_INFO_KIND_FREE", value: 4)
!23 = !{!24, !36, !102, !90, !74}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_t", file: !6, line: 88, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_scope_t", file: !6, line: 69, size: 640, elements: !27)
!27 = !{!28, !30, !32, !33, !39, !43, !44, !77, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !26, file: !6, line: 70, baseType: !29, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_kind_t", file: !6, line: 67, baseType: !5)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !26, file: !6, line: 71, baseType: !31, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !6, line: 72, baseType: !31, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !26, file: !6, line: 73, baseType: !34, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !35, line: 52, baseType: !36)
!35 = !DIFile(filename: "../../py/parse.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !37, line: 30, baseType: !38)
!37 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "source_file", scope: !26, file: !6, line: 74, baseType: !40, size: 16, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 31, baseType: !42)
!41 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "simple_name", scope: !26, file: !6, line: 75, baseType: !40, size: 16, offset: 272)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "raw_code", scope: !26, file: !6, line: 76, baseType: !45, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !47, line: 62, baseType: !48)
!47 = !DIFile(filename: "../../py/emitglue.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !47, line: 42, size: 256, elements: !49)
!49 = !{!50, !53, !54, !55}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !48, file: !47, line: 43, baseType: !51, size: 3, flags: DIFlagBitField, extraData: i64 0)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !52, line: 71, baseType: !36)
!52 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !48, file: !47, line: 44, baseType: !51, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !48, file: !47, line: 45, baseType: !51, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !48, file: !47, line: 61, baseType: !56, size: 192, offset: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !48, file: !47, line: 46, size: 192, elements: !57)
!57 = !{!58, !70}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !56, file: !47, line: 55, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !47, line: 47, size: 128, elements: !60)
!60 = !{!61, !67}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !59, file: !47, line: 48, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !65, line: 39, baseType: !66)
!65 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !59, file: !47, line: 49, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !56, file: !47, line: 60, baseType: !71, size: 192)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !47, line: 56, size: 192, elements: !72)
!72 = !{!73, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !71, file: !47, line: 57, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !71, file: !47, line: 58, baseType: !68, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !71, file: !47, line: 59, baseType: !51, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !26, file: !6, line: 77, baseType: !78, size: 8, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !79, line: 31, baseType: !66)
!79 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint8_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "emit_options", scope: !26, file: !6, line: 78, baseType: !78, size: 8, offset: 392)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "num_pos_args", scope: !26, file: !6, line: 79, baseType: !40, size: 16, offset: 400)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "num_kwonly_args", scope: !26, file: !6, line: 80, baseType: !40, size: 16, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "num_def_pos_args", scope: !26, file: !6, line: 81, baseType: !40, size: 16, offset: 432)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "num_locals", scope: !26, file: !6, line: 82, baseType: !40, size: 16, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !26, file: !6, line: 83, baseType: !40, size: 16, offset: 464)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "exc_stack_size", scope: !26, file: !6, line: 84, baseType: !40, size: 16, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_alloc", scope: !26, file: !6, line: 85, baseType: !40, size: 16, offset: 496)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_len", scope: !26, file: !6, line: 86, baseType: !40, size: 16, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id_info", scope: !26, file: !6, line: 87, baseType: !90, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_info_t", file: !6, line: 53, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_id_info_t", file: !6, line: 46, size: 128, elements: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !92, file: !6, line: 47, baseType: !78, size: 8)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !92, file: !6, line: 48, baseType: !78, size: 8, offset: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "local_num", scope: !92, file: !6, line: 51, baseType: !40, size: 16, offset: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !92, file: !6, line: 52, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !99, line: 48, baseType: !100)
!99 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !38)
!101 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.1/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_struct_t", file: !35, line: 58, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_node_struct_t", file: !35, line: 54, size: 64, elements: !105)
!105 = !{!106, !110, !111}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "source_line", scope: !104, file: !35, line: 55, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !108, line: 31, baseType: !109)
!108 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint32_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!109 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "kind_num_nodes", scope: !104, file: !35, line: 56, baseType: !107, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !104, file: !35, line: 57, baseType: !112, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: -1)
!115 = !{!0}
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 56, elements: !118)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!118 = !{!119}
!119 = !DISubrange(count: 7)
!120 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!121 = !{i32 2, !"Dwarf Version", i32 4}
!122 = !{i32 2, !"Debug Info Version", i32 3}
!123 = !{i32 1, !"wchar_size", i32 4}
!124 = !{i32 7, !"PIC Level", i32 2}
!125 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!126 = distinct !DISubprogram(name: "scope_new", scope: !3, file: !3, line: 43, type: !127, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !129)
!127 = !DISubroutineType(types: !128)
!128 = !{!24, !29, !34, !98, !51}
!129 = !{!130, !131, !132, !133, !134}
!130 = !DILocalVariable(name: "kind", arg: 1, scope: !126, file: !3, line: 43, type: !29)
!131 = !DILocalVariable(name: "pn", arg: 2, scope: !126, file: !3, line: 43, type: !34)
!132 = !DILocalVariable(name: "source_file", arg: 3, scope: !126, file: !3, line: 43, type: !98)
!133 = !DILocalVariable(name: "emit_options", arg: 4, scope: !126, file: !3, line: 43, type: !51)
!134 = !DILocalVariable(name: "scope", scope: !126, file: !3, line: 44, type: !24)
!135 = !DILocation(line: 43, column: 33, scope: !126)
!136 = !DILocation(line: 43, column: 55, scope: !126)
!137 = !DILocation(line: 43, column: 64, scope: !126)
!138 = !DILocation(line: 43, column: 87, scope: !126)
!139 = !DILocation(line: 44, column: 22, scope: !126)
!140 = !DILocation(line: 44, column: 14, scope: !126)
!141 = !DILocation(line: 45, column: 12, scope: !126)
!142 = !DILocation(line: 45, column: 17, scope: !126)
!143 = !{!144, !145, i64 0}
!144 = !{!"_scope_t", !145, i64 0, !147, i64 8, !147, i64 16, !148, i64 24, !149, i64 32, !149, i64 34, !147, i64 40, !145, i64 48, !145, i64 49, !149, i64 50, !149, i64 52, !149, i64 54, !149, i64 56, !149, i64 58, !149, i64 60, !149, i64 62, !149, i64 64, !147, i64 72}
!145 = !{!"omnipotent char", !146, i64 0}
!146 = !{!"Simple C/C++ TBAA"}
!147 = !{!"any pointer", !145, i64 0}
!148 = !{!"long", !145, i64 0}
!149 = !{!"short", !145, i64 0}
!150 = !DILocation(line: 46, column: 12, scope: !126)
!151 = !DILocation(line: 46, column: 15, scope: !126)
!152 = !{!144, !148, i64 24}
!153 = !DILocation(line: 47, column: 26, scope: !126)
!154 = !DILocation(line: 47, column: 12, scope: !126)
!155 = !DILocation(line: 47, column: 24, scope: !126)
!156 = !{!144, !149, i64 32}
!157 = !DILocation(line: 48, column: 32, scope: !158)
!158 = distinct !DILexicalBlock(scope: !126, file: !3, line: 48, column: 9)
!159 = !DILocation(line: 50, column: 30, scope: !160)
!160 = distinct !DILexicalBlock(scope: !158, file: !3, line: 48, column: 56)
!161 = !{!148, !148, i64 0}
!162 = !DILocation(line: 51, column: 5, scope: !160)
!163 = !DILocation(line: 52, column: 30, scope: !164)
!164 = distinct !DILexicalBlock(scope: !158, file: !3, line: 51, column: 12)
!165 = !{!145, !145, i64 0}
!166 = !DILocation(line: 0, scope: !160)
!167 = !{!144, !149, i64 34}
!168 = !DILocation(line: 54, column: 23, scope: !126)
!169 = !DILocation(line: 54, column: 12, scope: !126)
!170 = !DILocation(line: 54, column: 21, scope: !126)
!171 = !{!144, !147, i64 40}
!172 = !DILocation(line: 55, column: 27, scope: !126)
!173 = !DILocation(line: 55, column: 12, scope: !126)
!174 = !DILocation(line: 55, column: 25, scope: !126)
!175 = !{!144, !145, i64 49}
!176 = !DILocation(line: 56, column: 12, scope: !126)
!177 = !DILocation(line: 56, column: 26, scope: !126)
!178 = !{!144, !149, i64 62}
!179 = !DILocation(line: 57, column: 22, scope: !126)
!180 = !DILocation(line: 57, column: 12, scope: !126)
