; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/scope.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/scope.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._scope_t = type { i32, %struct._scope_t*, %struct._scope_t*, i64, i16, i16, %struct._mp_raw_code_t*, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, %struct._id_info_t* }
%struct._mp_raw_code_t = type { i24, %union.anon }
%union.anon = type { %struct.anon.0 }
%struct.anon.0 = type { i8*, i64*, i64 }
%struct._id_info_t = type { i8, i8, i16, i64 }
%struct._mp_parse_node_struct_t = type { i32, i32, [0 x i64] }

@scope_simple_name_table = internal unnamed_addr constant [7 x i8] c"0\0012345", align 1, !dbg !0

; Function Attrs: nounwind ssp uwtable
define %struct._scope_t* @scope_new(i32, i64, i64, i64) local_unnamed_addr #0 !dbg !127 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !131, metadata !DIExpression()), !dbg !136
  call void @llvm.dbg.value(metadata i64 %1, metadata !132, metadata !DIExpression()), !dbg !137
  call void @llvm.dbg.value(metadata i64 %2, metadata !133, metadata !DIExpression()), !dbg !138
  call void @llvm.dbg.value(metadata i64 %3, metadata !134, metadata !DIExpression()), !dbg !139
  %5 = tail call i8* @m_malloc0(i64 80, i1 zeroext false) #5, !dbg !140
  %6 = bitcast i8* %5 to %struct._scope_t*, !dbg !140

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "scope_simple_name_table", scope: !2, file: !116, line: 34, type: !117, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Apple clang version 11.0.0 (clang-1100.0.33.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !115, nameTableKind: GNU)
!3 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/scope.c", directory: "/private/var/folders/8t/rc0yh_3d5j32mgv0b31lrm080000gn/T")
!4 = !{!5, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/scope.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "SCOPE_MODULE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SCOPE_CLASS", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "SCOPE_LAMBDA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "SCOPE_LIST_COMP", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "SCOPE_DICT_COMP", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "SCOPE_SET_COMP", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "SCOPE_GEN_EXPR", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "SCOPE_FUNCTION", value: 7, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 32, baseType: !7, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23}
!19 = !DIEnumerator(name: "ID_INFO_KIND_GLOBAL_IMPLICIT", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "ID_INFO_KIND_GLOBAL_EXPLICIT", value: 1, isUnsigned: true)
!21 = !DIEnumerator(name: "ID_INFO_KIND_LOCAL", value: 2, isUnsigned: true)
!22 = !DIEnumerator(name: "ID_INFO_KIND_CELL", value: 3, isUnsigned: true)
!23 = !DIEnumerator(name: "ID_INFO_KIND_FREE", value: 4, isUnsigned: true)
!24 = !{!25, !37, !103, !91, !75}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_t", file: !6, line: 88, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_scope_t", file: !6, line: 69, size: 640, elements: !28)
!28 = !{!29, !31, !33, !34, !40, !44, !45, !78, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !27, file: !6, line: 70, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "scope_kind_t", file: !6, line: 67, baseType: !5)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !27, file: !6, line: 71, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !6, line: 72, baseType: !32, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pn", scope: !27, file: !6, line: 73, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_t", file: !36, line: 52, baseType: !37)
!36 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/parse.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !38, line: 30, baseType: !39)
!38 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!39 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "source_file", scope: !27, file: !6, line: 74, baseType: !41, size: 16, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !42, line: 31, baseType: !43)
!42 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "simple_name", scope: !27, file: !6, line: 75, baseType: !41, size: 16, offset: 272)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "raw_code", scope: !27, file: !6, line: 76, baseType: !46, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_raw_code_t", file: !48, line: 62, baseType: !49)
!48 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/emitglue.h", directory: "")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_raw_code_t", file: !48, line: 42, size: 256, elements: !50)
!50 = !{!51, !54, !55, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !49, file: !48, line: 43, baseType: !52, size: 3, flags: DIFlagBitField, extraData: i64 0)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !53, line: 70, baseType: !37)
!53 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !49, file: !48, line: 44, baseType: !52, size: 7, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "n_pos_args", scope: !49, file: !48, line: 45, baseType: !52, size: 11, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !48, line: 61, baseType: !57, size: 192, offset: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !49, file: !48, line: 46, size: 192, elements: !58)
!58 = !{!59, !71}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "u_byte", scope: !57, file: !48, line: 55, baseType: !60, size: 128)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !48, line: 47, size: 128, elements: !61)
!61 = !{!62, !68}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !60, file: !48, line: 48, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !66, line: 39, baseType: !67)
!66 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !60, file: !48, line: 49, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "u_native", scope: !57, file: !48, line: 60, baseType: !72, size: 192)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !57, file: !48, line: 56, size: 192, elements: !73)
!73 = !{!74, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fun_data", scope: !72, file: !48, line: 57, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !72, file: !48, line: 58, baseType: !69, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type_sig", scope: !72, file: !48, line: 59, baseType: !52, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "scope_flags", scope: !27, file: !6, line: 77, baseType: !79, size: 8, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !80, line: 31, baseType: !67)
!80 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint8_t.h", directory: "")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "emit_options", scope: !27, file: !6, line: 78, baseType: !79, size: 8, offset: 392)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "num_pos_args", scope: !27, file: !6, line: 79, baseType: !41, size: 16, offset: 400)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "num_kwonly_args", scope: !27, file: !6, line: 80, baseType: !41, size: 16, offset: 416)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "num_def_pos_args", scope: !27, file: !6, line: 81, baseType: !41, size: 16, offset: 432)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "num_locals", scope: !27, file: !6, line: 82, baseType: !41, size: 16, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !27, file: !6, line: 83, baseType: !41, size: 16, offset: 464)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "exc_stack_size", scope: !27, file: !6, line: 84, baseType: !41, size: 16, offset: 480)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_alloc", scope: !27, file: !6, line: 85, baseType: !41, size: 16, offset: 496)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id_info_len", scope: !27, file: !6, line: 86, baseType: !41, size: 16, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "id_info", scope: !27, file: !6, line: 87, baseType: !91, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_info_t", file: !6, line: 53, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_id_info_t", file: !6, line: 46, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !93, file: !6, line: 47, baseType: !79, size: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !6, line: 48, baseType: !79, size: 8, offset: 8)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "local_num", scope: !93, file: !6, line: 51, baseType: !41, size: 16, offset: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "qst", scope: !93, file: !6, line: 52, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !100, line: 48, baseType: !101)
!100 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !39)
!102 = !DIFile(filename: "/Applications/Xcode11-beta7.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/11.0.0/include/stddef.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_parse_node_struct_t", file: !36, line: 58, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_parse_node_struct_t", file: !36, line: 54, size: 64, elements: !106)
!106 = !{!107, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "source_line", scope: !105, file: !36, line: 55, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !109, line: 31, baseType: !7)
!109 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint32_t.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "kind_num_nodes", scope: !105, file: !36, line: 56, baseType: !108, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !105, file: !36, line: 57, baseType: !112, offset: 64)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: -1)
!115 = !{!0}
!116 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/scope.c", directory: "")
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 56, elements: !119)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!119 = !{!120}
!120 = !DISubrange(count: 7)
!121 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!122 = !{i32 2, !"Dwarf Version", i32 4}
!123 = !{i32 2, !"Debug Info Version", i32 3}
!124 = !{i32 1, !"wchar_size", i32 4}
!125 = !{i32 7, !"PIC Level", i32 2}
!126 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!127 = distinct !DISubprogram(name: "scope_new", scope: !116, file: !116, line: 43, type: !128, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !130)
!128 = !DISubroutineType(types: !129)
!129 = !{!25, !30, !35, !99, !52}
!130 = !{!131, !132, !133, !134, !135}
!131 = !DILocalVariable(name: "kind", arg: 1, scope: !127, file: !116, line: 43, type: !30)
!132 = !DILocalVariable(name: "pn", arg: 2, scope: !127, file: !116, line: 43, type: !35)
!133 = !DILocalVariable(name: "source_file", arg: 3, scope: !127, file: !116, line: 43, type: !99)
!134 = !DILocalVariable(name: "emit_options", arg: 4, scope: !127, file: !116, line: 43, type: !52)
!135 = !DILocalVariable(name: "scope", scope: !127, file: !116, line: 44, type: !25)
!136 = !DILocation(line: 43, column: 33, scope: !127)
!137 = !DILocation(line: 43, column: 55, scope: !127)
!138 = !DILocation(line: 43, column: 64, scope: !127)
!139 = !DILocation(line: 43, column: 87, scope: !127)
!140 = !DILocation(line: 44, column: 22, scope: !127)
!141 = !DILocation(line: 44, column: 14, scope: !127)
!142 = !DILocation(line: 45, column: 12, scope: !127)
!143 = !DILocation(line: 45, column: 17, scope: !127)
!144 = !{!145, !146, i64 0}
!145 = !{!"_scope_t", !146, i64 0, !148, i64 8, !148, i64 16, !149, i64 24, !150, i64 32, !150, i64 34, !148, i64 40, !146, i64 48, !146, i64 49, !150, i64 50, !150, i64 52, !150, i64 54, !150, i64 56, !150, i64 58, !150, i64 60, !150, i64 62, !150, i64 64, !148, i64 72}
!146 = !{!"omnipotent char", !147, i64 0}
!147 = !{!"Simple C/C++ TBAA"}
!148 = !{!"any pointer", !146, i64 0}
!149 = !{!"long", !146, i64 0}
!150 = !{!"short", !146, i64 0}
!151 = !DILocation(line: 46, column: 12, scope: !127)
!152 = !DILocation(line: 46, column: 15, scope: !127)
!153 = !{!145, !149, i64 24}
!154 = !DILocation(line: 47, column: 26, scope: !127)
!155 = !DILocation(line: 47, column: 12, scope: !127)
!156 = !DILocation(line: 47, column: 24, scope: !127)
!157 = !{!145, !150, i64 32}
!158 = !DILocation(line: 48, column: 32, scope: !159)
!159 = distinct !DILexicalBlock(scope: !127, file: !116, line: 48, column: 9)
!160 = !DILocation(line: 50, column: 30, scope: !161)
!161 = distinct !DILexicalBlock(scope: !159, file: !116, line: 48, column: 56)
!162 = !{!149, !149, i64 0}
!163 = !DILocation(line: 51, column: 5, scope: !161)
!164 = !DILocation(line: 52, column: 30, scope: !165)
!165 = distinct !DILexicalBlock(scope: !159, file: !116, line: 51, column: 12)
!166 = !{!146, !146, i64 0}
!167 = !DILocation(line: 0, scope: !159)
!168 = !{!145, !150, i64 34}
!169 = !DILocation(line: 54, column: 23, scope: !127)
!170 = !DILocation(line: 54, column: 12, scope: !127)
!171 = !DILocation(line: 54, column: 21, scope: !127)
!172 = !{!145, !148, i64 40}
!173 = !DILocation(line: 55, column: 27, scope: !127)
!174 = !DILocation(line: 55, column: 12, scope: !127)
!175 = !DILocation(line: 55, column: 25, scope: !127)
!176 = !{!145, !146, i64 49}
!177 = !DILocation(line: 56, column: 12, scope: !127)
!178 = !DILocation(line: 56, column: 26, scope: !127)
!179 = !{!145, !150, i64 62}
