; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/stream.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/stream.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_stream_p_t = type { i64 (i8*, i8*, i64, i32*)*, i64 (i8*, i8*, i64, i32*)*, i64 (i8*, i64, i64, i32*)*, i8 }
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._vstr_t = type { i64, i64, i8*, i8 }
%struct.mp_stream_seek_t = type { i64, i32 }


!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 69, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!30 = !DIEnumerator(name: "MP_BINARY_OP_LESS", value: 0)
!31 = !DIEnumerator(name: "MP_BINARY_OP_MORE", value: 1)
!32 = !DIEnumerator(name: "MP_BINARY_OP_EQUAL", value: 2)
!33 = !DIEnumerator(name: "MP_BINARY_OP_LESS_EQUAL", value: 3)
!34 = !DIEnumerator(name: "MP_BINARY_OP_MORE_EQUAL", value: 4)
!35 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5)
!36 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7)
!38 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8)
!39 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20)
!51 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21)
!52 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22)
!53 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23)
!54 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24)
!55 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25)
!56 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26)
!57 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27)
!58 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28)
!59 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29)
!60 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30)
!61 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31)
!62 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32)
!63 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33)
!64 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33)
!65 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34)
!66 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36)
!68 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37)
!69 = !{!70, !74, !80, !79, !96, !122, !265, !159, !93, !245, !76}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_func_t", scope: !71, file: !3, line: 51, baseType: !103)
!71 = distinct !DISubprogram(name: "mp_stream_rw", scope: !3, file: !3, line: 49, type: !72, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !86)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !79, !80, !74, !81, !83}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !75, line: 71, baseType: !76)
!75 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !77, line: 30, baseType: !78)
!77 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !84, line: 39, baseType: !85)
!84 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87, !88, !89, !90, !91, !92, !94, !95, !119, !120}
!87 = !DILocalVariable(name: "stream", arg: 1, scope: !71, file: !3, line: 49, type: !79)
!88 = !DILocalVariable(name: "buf_", arg: 2, scope: !71, file: !3, line: 49, type: !80)
!89 = !DILocalVariable(name: "size", arg: 3, scope: !71, file: !3, line: 49, type: !74)
!90 = !DILocalVariable(name: "errcode", arg: 4, scope: !71, file: !3, line: 49, type: !81)
!91 = !DILocalVariable(name: "flags", arg: 5, scope: !71, file: !3, line: 49, type: !83)
!92 = !DILocalVariable(name: "buf", scope: !71, file: !3, line: 50, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!94 = !DILocalVariable(name: "io_func", scope: !71, file: !3, line: 52, type: !70)
!95 = !DILocalVariable(name: "stream_p", scope: !71, file: !3, line: 53, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_stream_p_t", file: !99, line: 74, baseType: !100)
!99 = !DIFile(filename: "../../py/stream.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_stream_p_t", file: !99, line: 66, size: 256, elements: !101)
!101 = !{!102, !106, !112, !116, !117}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !100, file: !99, line: 69, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!74, !79, !80, !74, !81}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !100, file: !99, line: 70, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!74, !79, !110, !74, !81}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !100, file: !99, line: 71, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!74, !79, !74, !76, !81}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "is_text", scope: !100, file: !99, line: 72, baseType: !74, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pyserial_compatibility", scope: !100, file: !99, line: 73, baseType: !118, size: 1, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!118 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!119 = !DILocalVariable(name: "done", scope: !71, file: !3, line: 61, type: !74)
!120 = !DILocalVariable(name: "out_sz", scope: !121, file: !3, line: 63, type: !74)
!121 = distinct !DILexicalBlock(scope: !71, file: !3, line: 62, column: 22)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !6, line: 57, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !132)
!132 = !{!133, !134, !138, !139, !164, !188, !193, !199, !205, !213, !218, !232, !237, !257, !258, !259}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !131, file: !6, line: 476, baseType: !124, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !6, line: 479, baseType: !135, size: 16, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !136, line: 31, baseType: !137)
!136 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!137 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !6, line: 482, baseType: !135, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !131, file: !6, line: 485, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !79, !163}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !147, line: 53, baseType: !148)
!147 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !147, line: 50, size: 128, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !147, line: 51, baseType: !80, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !148, file: !147, line: 52, baseType: !152, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !147, line: 48, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !80, !156, !159}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !160, line: 31, baseType: !161)
!160 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !162, line: 92, baseType: !78)
!162 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !131, file: !6, line: 488, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!79, !128, !159, !169, !171}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !173, file: !6, line: 366, baseType: !159, size: 1, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !173, file: !6, line: 367, baseType: !159, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !173, file: !6, line: 368, baseType: !159, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !173, file: !6, line: 369, baseType: !159, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !173, file: !6, line: 371, baseType: !159, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !173, file: !6, line: 372, baseType: !159, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !173, file: !6, line: 373, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !184, file: !6, line: 351, baseType: !79, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !184, file: !6, line: 352, baseType: !79, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !131, file: !6, line: 491, baseType: !189, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!79, !79, !159, !159, !169}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !131, file: !6, line: 495, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!79, !198, !79}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !15, line: 65, baseType: !14)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !131, file: !6, line: 496, baseType: !200, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!79, !204, !79, !79}
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !15, line: 145, baseType: !28)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !131, file: !6, line: 509, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !79, !210, !212}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !211, line: 48, baseType: !159)
!211 = !DIFile(filename: "../../py/qstr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !131, file: !6, line: 516, baseType: !214, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!79, !79, !79, !79}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !131, file: !6, line: 521, baseType: !219, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!79, !79, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !225, file: !6, line: 433, baseType: !124, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !225, file: !6, line: 434, baseType: !229, size: 192, offset: 64)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 192, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 3)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !131, file: !6, line: 525, baseType: !233, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!79, !79}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !131, file: !6, line: 528, baseType: !238, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !239, file: !6, line: 469, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !79, !250, !74}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !75, line: 70, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !247, line: 32, baseType: !248)
!247 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !162, line: 49, baseType: !249)
!249 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !252, file: !6, line: 457, baseType: !80, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !6, line: 458, baseType: !159, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !252, file: !6, line: 459, baseType: !82, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !131, file: !6, line: 531, baseType: !110, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !131, file: !6, line: 537, baseType: !110, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !131, file: !6, line: 540, baseType: !260, size: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !261, file: !6, line: 776, baseType: !124, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !261, file: !6, line: 777, baseType: !172, size: 192, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!266 = !{!0, !267, !290, !292, !315, !317, !319, !321, !323, !325, !327, !329}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "mp_stream_read1_obj", scope: !2, file: !3, line: 227, type: !269, isLocal: false, isDefinition: true)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !272)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !6, line: 806, baseType: !124, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !271, file: !6, line: 807, baseType: !118, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !271, file: !6, line: 808, baseType: !74, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !271, file: !6, line: 809, baseType: !74, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !271, file: !6, line: 813, baseType: !278, size: 64, offset: 128)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !271, file: !6, line: 810, size: 64, elements: !279)
!279 = !{!280, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !278, file: !6, line: 811, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!79, !159, !169}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !278, file: !6, line: 812, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!79, !159, !169, !171}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "mp_stream_write_obj", scope: !2, file: !3, line: 270, type: !269, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "mp_stream_write1_obj", scope: !2, file: !3, line: 277, type: !294, isLocal: false, isDefinition: true)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !296, file: !6, line: 795, baseType: !124, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !296, file: !6, line: 801, baseType: !300, size: 64, offset: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !296, file: !6, line: 796, size: 64, elements: !301)
!301 = !{!302, !307, !308, !313}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !300, file: !6, line: 797, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!79}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !300, file: !6, line: 798, baseType: !233, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !300, file: !6, line: 799, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!79, !79, !79}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !300, file: !6, line: 800, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !215)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "mp_stream_readinto_obj", scope: !2, file: !3, line: 308, type: !269, isLocal: false, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "mp_stream_unbuffered_readline_obj", scope: !2, file: !3, line: 402, type: !269, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "mp_stream_unbuffered_readlines_obj", scope: !2, file: !3, line: 416, type: !294, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "mp_stream_close_obj", scope: !2, file: !3, line: 435, type: !294, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "mp_stream_seek_obj", scope: !2, file: !3, line: 461, type: !269, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "mp_stream_tell_obj", scope: !2, file: !3, line: 469, type: !294, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "mp_stream_flush_obj", scope: !2, file: !3, line: 483, type: !294, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "mp_stream_ioctl_obj", scope: !2, file: !3, line: 505, type: !269, isLocal: false, isDefinition: true)
!331 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!332 = !{i32 2, !"Dwarf Version", i32 4}
!333 = !{i32 2, !"Debug Info Version", i32 3}
!334 = !{i32 1, !"wchar_size", i32 4}
!335 = !{i32 7, !"PIC Level", i32 2}
!336 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!337 = !DILocation(line: 49, column: 33, scope: !71)
!338 = !DILocation(line: 49, column: 47, scope: !71)
!339 = !DILocation(line: 49, column: 63, scope: !71)
!340 = !DILocation(line: 49, column: 74, scope: !71)
!341 = !DILocation(line: 49, column: 88, scope: !71)
!342 = !DILocation(line: 50, column: 11, scope: !71)
!343 = !DILocation(line: 53, column: 37, scope: !71)
!344 = !DILocation(line: 53, column: 26, scope: !71)
!345 = !DILocation(line: 54, column: 9, scope: !346)
!346 = distinct !DILexicalBlock(scope: !71, file: !3, line: 54, column: 9)
!347 = !DILocation(line: 54, column: 15, scope: !346)
!348 = !DILocation(line: 55, column: 40, scope: !349)
!349 = distinct !DILexicalBlock(scope: !346, file: !3, line: 54, column: 37)
!350 = !DILocation(line: 52, column: 15, scope: !71)
!351 = !DILocation(line: 57, column: 29, scope: !352)
!352 = distinct !DILexicalBlock(scope: !346, file: !3, line: 56, column: 12)
!353 = !DILocation(line: 54, column: 9, scope: !71)
!354 = !DILocation(line: 0, scope: !352)
!355 = !{!356, !356, i64 0}
!356 = !{!"any pointer", !357, i64 0}
!357 = !{!"omnipotent char", !358, i64 0}
!358 = !{!"Simple C/C++ TBAA"}
!359 = !DILocation(line: 60, column: 14, scope: !71)
!360 = !{!361, !361, i64 0}
!361 = !{!"int", !357, i64 0}
!362 = !DILocation(line: 61, column: 15, scope: !71)
!363 = !DILocation(line: 62, column: 17, scope: !71)
!364 = !DILocation(line: 62, column: 5, scope: !71)
!365 = !DILocation(line: 77, column: 19, scope: !366)
!366 = distinct !DILexicalBlock(scope: !121, file: !3, line: 77, column: 13)
!367 = !DILocation(line: 63, column: 28, scope: !121)
!368 = !DILocation(line: 63, column: 19, scope: !121)
!369 = !DILocation(line: 67, column: 13, scope: !121)
!370 = !DILocation(line: 77, column: 13, scope: !121)
!371 = !DILocation(line: 81, column: 13, scope: !121)
!372 = !DILocation(line: 82, column: 14, scope: !121)
!373 = !DILocation(line: 83, column: 14, scope: !121)
!374 = !DILocation(line: 0, scope: !71)
!375 = !DILocation(line: 86, column: 1, scope: !71)
!376 = distinct !DISubprogram(name: "mp_get_stream", scope: !99, file: !99, line: 95, type: !377, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !380)
!377 = !DISubroutineType(types: !378)
!378 = !{!96, !379}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !110)
!380 = !{!381}
!381 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !99, line: 95, type: !379)
!382 = !DILocation(line: 95, column: 65, scope: !376)
!383 = !DILocation(line: 96, column: 79, scope: !376)
!384 = !{!385, !356, i64 0}
!385 = !{!"_mp_obj_base_t", !356, i64 0}
!386 = !DILocation(line: 96, column: 85, scope: !376)
!387 = !{!388, !356, i64 96}
!388 = !{!"_mp_obj_type_t", !385, i64 0, !389, i64 8, !389, i64 10, !356, i64 16, !356, i64 24, !356, i64 32, !356, i64 40, !356, i64 48, !356, i64 56, !356, i64 64, !356, i64 72, !356, i64 80, !390, i64 88, !356, i64 96, !356, i64 104, !356, i64 112}
!389 = !{!"short", !357, i64 0}
!390 = !{!"_mp_buffer_p_t", !356, i64 0}
!391 = !DILocation(line: 96, column: 5, scope: !376)
!392 = distinct !DISubprogram(name: "mp_get_stream_raise", scope: !3, file: !3, line: 88, type: !393, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!96, !79, !82}
!395 = !{!396, !397, !398, !400}
!396 = !DILocalVariable(name: "self_in", arg: 1, scope: !392, file: !3, line: 88, type: !79)
!397 = !DILocalVariable(name: "flags", arg: 2, scope: !392, file: !3, line: 88, type: !82)
!398 = !DILocalVariable(name: "type", scope: !392, file: !3, line: 89, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!400 = !DILocalVariable(name: "stream_p", scope: !392, file: !3, line: 90, type: !96)
!401 = !DILocation(line: 88, column: 51, scope: !392)
!402 = !DILocation(line: 88, column: 64, scope: !392)
!403 = !DILocation(line: 89, column: 27, scope: !392)
!404 = !DILocation(line: 89, column: 20, scope: !392)
!405 = !DILocation(line: 90, column: 43, scope: !392)
!406 = !DILocation(line: 90, column: 26, scope: !392)
!407 = !DILocation(line: 91, column: 18, scope: !408)
!408 = distinct !DILexicalBlock(scope: !392, file: !3, line: 91, column: 9)
!409 = !DILocation(line: 92, column: 9, scope: !408)
!410 = !DILocation(line: 92, column: 20, scope: !408)
!411 = !DILocation(line: 92, column: 41, scope: !408)
!412 = !DILocation(line: 92, column: 54, scope: !408)
!413 = !{!414, !356, i64 0}
!414 = !{!"_mp_stream_p_t", !356, i64 0, !356, i64 8, !356, i64 16, !415, i64 24, !416, i64 24}
!415 = !{!"long", !357, i64 0}
!416 = !{!"_Bool", !357, i64 0}
!417 = !DILocation(line: 92, column: 59, scope: !408)
!418 = !DILocation(line: 93, column: 9, scope: !408)
!419 = !DILocation(line: 93, column: 20, scope: !408)
!420 = !DILocation(line: 93, column: 42, scope: !408)
!421 = !DILocation(line: 93, column: 55, scope: !408)
!422 = !{!414, !356, i64 8}
!423 = !DILocation(line: 93, column: 61, scope: !408)
!424 = !DILocation(line: 94, column: 9, scope: !408)
!425 = !DILocation(line: 94, column: 20, scope: !408)
!426 = !DILocation(line: 94, column: 42, scope: !408)
!427 = !DILocation(line: 94, column: 55, scope: !408)
!428 = !{!414, !356, i64 16}
!429 = !DILocation(line: 94, column: 61, scope: !408)
!430 = !DILocation(line: 91, column: 9, scope: !392)
!431 = !DILocation(line: 96, column: 40, scope: !432)
!432 = distinct !DILexicalBlock(scope: !408, file: !3, line: 94, column: 71)
!433 = !DILocation(line: 96, column: 9, scope: !432)
!434 = !DILocation(line: 98, column: 5, scope: !392)
!435 = distinct !DISubprogram(name: "stream_read", scope: !3, file: !3, line: 219, type: !283, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !436)
!436 = !{!437, !438}
!437 = !DILocalVariable(name: "n_args", arg: 1, scope: !435, file: !3, line: 219, type: !159)
!438 = !DILocalVariable(name: "args", arg: 2, scope: !435, file: !3, line: 219, type: !169)
!439 = !DILocation(line: 219, column: 36, scope: !435)
!440 = !DILocation(line: 219, column: 60, scope: !435)
!441 = !DILocation(line: 220, column: 12, scope: !435)
!442 = !DILocation(line: 220, column: 5, scope: !435)
!443 = distinct !DISubprogram(name: "stream_read1", scope: !3, file: !3, line: 224, type: !283, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !444)
!444 = !{!445, !446}
!445 = !DILocalVariable(name: "n_args", arg: 1, scope: !443, file: !3, line: 224, type: !159)
!446 = !DILocalVariable(name: "args", arg: 2, scope: !443, file: !3, line: 224, type: !169)
!447 = !DILocation(line: 224, column: 37, scope: !443)
!448 = !DILocation(line: 224, column: 61, scope: !443)
!449 = !DILocation(line: 225, column: 12, scope: !443)
!450 = !DILocation(line: 225, column: 5, scope: !443)
!451 = distinct !DISubprogram(name: "mp_stream_write", scope: !3, file: !3, line: 229, type: !452, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!79, !79, !110, !159, !83}
!454 = !{!455, !456, !457, !458, !459, !460}
!455 = !DILocalVariable(name: "self_in", arg: 1, scope: !451, file: !3, line: 229, type: !79)
!456 = !DILocalVariable(name: "buf", arg: 2, scope: !451, file: !3, line: 229, type: !110)
!457 = !DILocalVariable(name: "len", arg: 3, scope: !451, file: !3, line: 229, type: !159)
!458 = !DILocalVariable(name: "flags", arg: 4, scope: !451, file: !3, line: 229, type: !83)
!459 = !DILocalVariable(name: "error", scope: !451, file: !3, line: 230, type: !82)
!460 = !DILocalVariable(name: "out_sz", scope: !451, file: !3, line: 231, type: !74)
!461 = !DILocation(line: 229, column: 35, scope: !451)
!462 = !DILocation(line: 229, column: 56, scope: !451)
!463 = !DILocation(line: 229, column: 68, scope: !451)
!464 = !DILocation(line: 229, column: 78, scope: !451)
!465 = !DILocation(line: 230, column: 5, scope: !451)
!466 = !DILocation(line: 230, column: 9, scope: !451)
!467 = !DILocation(line: 231, column: 24, scope: !451)
!468 = !DILocation(line: 231, column: 15, scope: !451)
!469 = !DILocation(line: 232, column: 9, scope: !470)
!470 = distinct !DILexicalBlock(scope: !451, file: !3, line: 232, column: 9)
!471 = !DILocation(line: 232, column: 15, scope: !470)
!472 = !DILocation(line: 232, column: 9, scope: !451)
!473 = !DILocation(line: 239, column: 9, scope: !474)
!474 = distinct !DILexicalBlock(scope: !470, file: !3, line: 232, column: 21)
!475 = !DILocation(line: 241, column: 16, scope: !476)
!476 = distinct !DILexicalBlock(scope: !470, file: !3, line: 240, column: 12)
!477 = !DILocation(line: 243, column: 1, scope: !451)
!478 = !DILocation(line: 241, column: 9, scope: !476)
!479 = distinct !DISubprogram(name: "mp_stream_write_adaptor", scope: !3, file: !3, line: 246, type: !154, isLocal: false, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !480)
!480 = !{!481, !482, !483}
!481 = !DILocalVariable(name: "self", arg: 1, scope: !479, file: !3, line: 246, type: !80)
!482 = !DILocalVariable(name: "buf", arg: 2, scope: !479, file: !3, line: 246, type: !156)
!483 = !DILocalVariable(name: "len", arg: 3, scope: !479, file: !3, line: 246, type: !159)
!484 = !DILocation(line: 246, column: 36, scope: !479)
!485 = !DILocation(line: 246, column: 54, scope: !479)
!486 = !DILocation(line: 246, column: 66, scope: !479)
!487 = !DILocation(line: 247, column: 5, scope: !479)
!488 = !DILocation(line: 248, column: 1, scope: !479)
!489 = distinct !DISubprogram(name: "stream_write_method", scope: !3, file: !3, line: 250, type: !283, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !490)
!490 = !{!491, !492, !493, !494, !495}
!491 = !DILocalVariable(name: "n_args", arg: 1, scope: !489, file: !3, line: 250, type: !159)
!492 = !DILocalVariable(name: "args", arg: 2, scope: !489, file: !3, line: 250, type: !169)
!493 = !DILocalVariable(name: "bufinfo", scope: !489, file: !3, line: 251, type: !251)
!494 = !DILocalVariable(name: "max_len", scope: !489, file: !3, line: 256, type: !159)
!495 = !DILocalVariable(name: "off", scope: !489, file: !3, line: 257, type: !159)
!496 = !DILocation(line: 250, column: 44, scope: !489)
!497 = !DILocation(line: 250, column: 68, scope: !489)
!498 = !DILocation(line: 251, column: 5, scope: !489)
!499 = !DILocation(line: 252, column: 25, scope: !489)
!500 = !DILocation(line: 251, column: 22, scope: !489)
!501 = !DILocation(line: 252, column: 5, scope: !489)
!502 = !DILocation(line: 253, column: 24, scope: !503)
!503 = distinct !DILexicalBlock(scope: !489, file: !3, line: 253, column: 9)
!504 = !DILocation(line: 253, column: 10, scope: !503)
!505 = !DILocation(line: 253, column: 34, scope: !503)
!506 = !DILocation(line: 253, column: 42, scope: !503)
!507 = !DILocation(line: 253, column: 45, scope: !503)
!508 = !DILocation(line: 253, column: 9, scope: !489)
!509 = !DILocation(line: 254, column: 29, scope: !510)
!510 = distinct !DILexicalBlock(scope: !503, file: !3, line: 253, column: 69)
!511 = !DILocation(line: 254, column: 9, scope: !510)
!512 = !DILocation(line: 256, column: 12, scope: !489)
!513 = !DILocation(line: 257, column: 12, scope: !489)
!514 = !DILocation(line: 258, column: 9, scope: !489)
!515 = !DILocation(line: 259, column: 44, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 258, column: 22)
!517 = distinct !DILexicalBlock(scope: !489, file: !3, line: 258, column: 9)
!518 = !DILocation(line: 259, column: 19, scope: !516)
!519 = !DILocation(line: 260, column: 5, scope: !516)
!520 = !DILocation(line: 261, column: 40, scope: !521)
!521 = distinct !DILexicalBlock(scope: !522, file: !3, line: 260, column: 29)
!522 = distinct !DILexicalBlock(scope: !517, file: !3, line: 260, column: 16)
!523 = !DILocation(line: 261, column: 15, scope: !521)
!524 = !DILocation(line: 262, column: 44, scope: !521)
!525 = !DILocation(line: 262, column: 19, scope: !521)
!526 = !DILocation(line: 263, column: 27, scope: !527)
!527 = distinct !DILexicalBlock(scope: !521, file: !3, line: 263, column: 13)
!528 = !{!529, !415, i64 8}
!529 = !{!"_mp_buffer_info_t", !356, i64 0, !415, i64 8, !361, i64 16}
!530 = !DILocation(line: 263, column: 17, scope: !527)
!531 = !DILocation(line: 263, column: 13, scope: !521)
!532 = !DILocation(line: 0, scope: !489)
!533 = !DILocation(line: 267, column: 13, scope: !489)
!534 = !DILocation(line: 267, column: 17, scope: !489)
!535 = !DILocation(line: 268, column: 28, scope: !489)
!536 = !DILocation(line: 268, column: 52, scope: !489)
!537 = !{!529, !356, i64 0}
!538 = !DILocation(line: 268, column: 56, scope: !489)
!539 = !DILocation(line: 268, column: 63, scope: !489)
!540 = !DILocation(line: 268, column: 12, scope: !489)
!541 = !DILocation(line: 269, column: 1, scope: !489)
!542 = !DILocation(line: 268, column: 5, scope: !489)
!543 = distinct !DISubprogram(name: "stream_write1_method", scope: !3, file: !3, line: 272, type: !311, isLocal: true, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !544)
!544 = !{!545, !546, !547}
!545 = !DILocalVariable(name: "self_in", arg: 1, scope: !543, file: !3, line: 272, type: !79)
!546 = !DILocalVariable(name: "arg", arg: 2, scope: !543, file: !3, line: 272, type: !79)
!547 = !DILocalVariable(name: "bufinfo", scope: !543, file: !3, line: 273, type: !251)
!548 = !DILocation(line: 272, column: 47, scope: !543)
!549 = !DILocation(line: 272, column: 65, scope: !543)
!550 = !DILocation(line: 273, column: 5, scope: !543)
!551 = !DILocation(line: 273, column: 22, scope: !543)
!552 = !DILocation(line: 274, column: 5, scope: !543)
!553 = !DILocation(line: 275, column: 45, scope: !543)
!554 = !DILocation(line: 275, column: 58, scope: !543)
!555 = !DILocation(line: 275, column: 12, scope: !543)
!556 = !DILocation(line: 276, column: 1, scope: !543)
!557 = !DILocation(line: 275, column: 5, scope: !543)
!558 = distinct !DISubprogram(name: "stream_readinto", scope: !3, file: !3, line: 279, type: !283, isLocal: true, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !559)
!559 = !{!560, !561, !562, !563, !564, !565}
!560 = !DILocalVariable(name: "n_args", arg: 1, scope: !558, file: !3, line: 279, type: !159)
!561 = !DILocalVariable(name: "args", arg: 2, scope: !558, file: !3, line: 279, type: !169)
!562 = !DILocalVariable(name: "bufinfo", scope: !558, file: !3, line: 280, type: !251)
!563 = !DILocalVariable(name: "len", scope: !558, file: !3, line: 286, type: !74)
!564 = !DILocalVariable(name: "error", scope: !558, file: !3, line: 297, type: !82)
!565 = !DILocalVariable(name: "out_sz", scope: !558, file: !3, line: 298, type: !74)
!566 = !DILocation(line: 279, column: 40, scope: !558)
!567 = !DILocation(line: 279, column: 64, scope: !558)
!568 = !DILocation(line: 280, column: 5, scope: !558)
!569 = !DILocation(line: 281, column: 25, scope: !558)
!570 = !DILocation(line: 280, column: 22, scope: !558)
!571 = !DILocation(line: 281, column: 5, scope: !558)
!572 = !DILocation(line: 286, column: 29, scope: !558)
!573 = !DILocation(line: 286, column: 15, scope: !558)
!574 = !DILocation(line: 287, column: 16, scope: !575)
!575 = distinct !DILexicalBlock(scope: !558, file: !3, line: 287, column: 9)
!576 = !DILocation(line: 287, column: 9, scope: !558)
!577 = !DILocation(line: 288, column: 27, scope: !578)
!578 = distinct !DILexicalBlock(scope: !579, file: !3, line: 288, column: 13)
!579 = distinct !DILexicalBlock(scope: !575, file: !3, line: 287, column: 21)
!580 = !DILocation(line: 288, column: 13, scope: !578)
!581 = !DILocation(line: 288, column: 37, scope: !578)
!582 = !DILocation(line: 288, column: 13, scope: !579)
!583 = !DILocation(line: 289, column: 33, scope: !584)
!584 = distinct !DILexicalBlock(scope: !578, file: !3, line: 288, column: 61)
!585 = !DILocation(line: 289, column: 13, scope: !584)
!586 = !DILocation(line: 291, column: 30, scope: !579)
!587 = !DILocation(line: 291, column: 15, scope: !579)
!588 = !DILocation(line: 292, column: 27, scope: !589)
!589 = distinct !DILexicalBlock(scope: !579, file: !3, line: 292, column: 13)
!590 = !DILocation(line: 292, column: 17, scope: !589)
!591 = !DILocation(line: 292, column: 13, scope: !579)
!592 = !DILocation(line: 0, scope: !558)
!593 = !DILocation(line: 297, column: 5, scope: !558)
!594 = !DILocation(line: 298, column: 24, scope: !558)
!595 = !DILocation(line: 297, column: 9, scope: !558)
!596 = !DILocation(line: 298, column: 15, scope: !558)
!597 = !DILocation(line: 299, column: 9, scope: !598)
!598 = distinct !DILexicalBlock(scope: !558, file: !3, line: 299, column: 9)
!599 = !DILocation(line: 299, column: 15, scope: !598)
!600 = !DILocation(line: 299, column: 9, scope: !558)
!601 = !DILocation(line: 303, column: 9, scope: !602)
!602 = distinct !DILexicalBlock(scope: !598, file: !3, line: 299, column: 21)
!603 = !DILocation(line: 305, column: 16, scope: !604)
!604 = distinct !DILexicalBlock(scope: !598, file: !3, line: 304, column: 12)
!605 = !DILocation(line: 307, column: 1, scope: !558)
!606 = !DILocation(line: 305, column: 9, scope: !604)
!607 = distinct !DISubprogram(name: "stream_unbuffered_readline", scope: !3, file: !3, line: 351, type: !283, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !608)
!608 = !{!609, !610, !611, !612, !613, !622, !624, !625}
!609 = !DILocalVariable(name: "n_args", arg: 1, scope: !607, file: !3, line: 351, type: !159)
!610 = !DILocalVariable(name: "args", arg: 2, scope: !607, file: !3, line: 351, type: !169)
!611 = !DILocalVariable(name: "stream_p", scope: !607, file: !3, line: 352, type: !96)
!612 = !DILocalVariable(name: "max_size", scope: !607, file: !3, line: 354, type: !245)
!613 = !DILocalVariable(name: "vstr", scope: !607, file: !3, line: 359, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !84, line: 165, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !84, line: 160, size: 256, elements: !616)
!616 = !{!617, !618, !619, !621}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !615, file: !84, line: 161, baseType: !159, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !615, file: !84, line: 162, baseType: !159, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !615, file: !84, line: 163, baseType: !620, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !615, file: !84, line: 164, baseType: !118, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!622 = !DILocalVariable(name: "p", scope: !623, file: !3, line: 367, type: !620)
!623 = distinct !DILexicalBlock(scope: !607, file: !3, line: 366, column: 47)
!624 = !DILocalVariable(name: "error", scope: !623, file: !3, line: 368, type: !82)
!625 = !DILocalVariable(name: "out_sz", scope: !623, file: !3, line: 369, type: !74)
!626 = !DILocation(line: 351, column: 51, scope: !607)
!627 = !DILocation(line: 351, column: 75, scope: !607)
!628 = !DILocation(line: 352, column: 51, scope: !607)
!629 = !DILocation(line: 352, column: 37, scope: !607)
!630 = !DILocation(line: 352, column: 26, scope: !607)
!631 = !DILocation(line: 354, column: 14, scope: !607)
!632 = !DILocation(line: 355, column: 16, scope: !633)
!633 = distinct !DILexicalBlock(scope: !607, file: !3, line: 355, column: 9)
!634 = !DILocation(line: 355, column: 9, scope: !607)
!635 = !DILocation(line: 359, column: 5, scope: !607)
!636 = !DILocation(line: 359, column: 12, scope: !607)
!637 = !DILocation(line: 360, column: 9, scope: !607)
!638 = !DILocation(line: 356, column: 20, scope: !639)
!639 = distinct !DILexicalBlock(scope: !633, file: !3, line: 355, column: 21)
!640 = !DILocation(line: 360, column: 18, scope: !641)
!641 = distinct !DILexicalBlock(scope: !607, file: !3, line: 360, column: 9)
!642 = !DILocation(line: 361, column: 9, scope: !643)
!643 = distinct !DILexicalBlock(scope: !641, file: !3, line: 360, column: 25)
!644 = !DILocation(line: 362, column: 5, scope: !643)
!645 = !DILocation(line: 363, column: 9, scope: !646)
!646 = distinct !DILexicalBlock(scope: !641, file: !3, line: 362, column: 12)
!647 = !DILocation(line: 366, column: 5, scope: !607)
!648 = !DILocation(line: 356, column: 18, scope: !639)
!649 = !DILocation(line: 366, column: 21, scope: !607)
!650 = !DILocation(line: 366, column: 27, scope: !607)
!651 = !DILocation(line: 366, column: 38, scope: !607)
!652 = !DILocation(line: 366, column: 41, scope: !607)
!653 = !DILocation(line: 0, scope: !607)
!654 = !DILocation(line: 367, column: 19, scope: !623)
!655 = !DILocation(line: 367, column: 15, scope: !623)
!656 = !DILocation(line: 368, column: 9, scope: !623)
!657 = !DILocation(line: 369, column: 28, scope: !623)
!658 = !DILocation(line: 369, column: 43, scope: !623)
!659 = !DILocation(line: 368, column: 13, scope: !623)
!660 = !DILocation(line: 369, column: 19, scope: !623)
!661 = !DILocation(line: 370, column: 13, scope: !623)
!662 = !DILocation(line: 385, column: 30, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 370, column: 40)
!664 = distinct !DILexicalBlock(scope: !623, file: !3, line: 370, column: 13)
!665 = !DILocation(line: 385, column: 13, scope: !663)
!666 = !DILocation(line: 392, column: 13, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !3, line: 387, column: 26)
!668 = distinct !DILexicalBlock(scope: !623, file: !3, line: 387, column: 13)
!669 = !DILocation(line: 398, column: 5, scope: !607)
!670 = !DILocation(line: 395, column: 13, scope: !671)
!671 = distinct !DILexicalBlock(scope: !623, file: !3, line: 395, column: 13)
!672 = !{!357, !357, i64 0}
!673 = !DILocation(line: 395, column: 16, scope: !671)
!674 = distinct !{!674, !647, !669}
!675 = !DILocation(line: 400, column: 37, scope: !607)
!676 = !DILocation(line: 400, column: 12, scope: !607)
!677 = !DILocation(line: 401, column: 1, scope: !607)
!678 = !DILocation(line: 400, column: 5, scope: !607)
!679 = distinct !DISubprogram(name: "stream_unbuffered_readlines", scope: !3, file: !3, line: 405, type: !235, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !680)
!680 = !{!681, !682, !683}
!681 = !DILocalVariable(name: "self", arg: 1, scope: !679, file: !3, line: 405, type: !79)
!682 = !DILocalVariable(name: "lines", scope: !679, file: !3, line: 406, type: !79)
!683 = !DILocalVariable(name: "line", scope: !684, file: !3, line: 408, type: !79)
!684 = distinct !DILexicalBlock(scope: !685, file: !3, line: 407, column: 14)
!685 = distinct !DILexicalBlock(scope: !686, file: !3, line: 407, column: 5)
!686 = distinct !DILexicalBlock(scope: !679, file: !3, line: 407, column: 5)
!687 = !DILocation(line: 405, column: 54, scope: !679)
!688 = !DILocation(line: 406, column: 22, scope: !679)
!689 = !DILocation(line: 406, column: 14, scope: !679)
!690 = !DILocation(line: 408, column: 25, scope: !684)
!691 = !DILocation(line: 408, column: 18, scope: !684)
!692 = !DILocation(line: 409, column: 14, scope: !693)
!693 = distinct !DILexicalBlock(scope: !684, file: !3, line: 409, column: 13)
!694 = !DILocation(line: 409, column: 13, scope: !684)
!695 = !DILocation(line: 412, column: 9, scope: !684)
!696 = !DILocation(line: 414, column: 5, scope: !679)
!697 = distinct !DISubprogram(name: "mp_stream_unbuffered_iter", scope: !3, file: !3, line: 418, type: !235, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !698)
!698 = !{!699, !700}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !697, file: !3, line: 418, type: !79)
!700 = !DILocalVariable(name: "l_in", scope: !697, file: !3, line: 419, type: !79)
!701 = !DILocation(line: 418, column: 45, scope: !697)
!702 = !DILocation(line: 419, column: 21, scope: !697)
!703 = !DILocation(line: 419, column: 14, scope: !697)
!704 = !DILocation(line: 420, column: 9, scope: !705)
!705 = distinct !DILexicalBlock(scope: !697, file: !3, line: 420, column: 9)
!706 = !DILocation(line: 421, column: 9, scope: !707)
!707 = distinct !DILexicalBlock(scope: !705, file: !3, line: 420, column: 31)
!708 = !DILocation(line: 424, column: 1, scope: !697)
!709 = distinct !DISubprogram(name: "mp_stream_close", scope: !3, file: !3, line: 426, type: !235, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !710)
!710 = !{!711, !712, !713, !714}
!711 = !DILocalVariable(name: "stream", arg: 1, scope: !709, file: !3, line: 426, type: !79)
!712 = !DILocalVariable(name: "stream_p", scope: !709, file: !3, line: 427, type: !96)
!713 = !DILocalVariable(name: "error", scope: !709, file: !3, line: 428, type: !82)
!714 = !DILocalVariable(name: "res", scope: !709, file: !3, line: 429, type: !74)
!715 = !DILocation(line: 426, column: 35, scope: !709)
!716 = !DILocation(line: 427, column: 37, scope: !709)
!717 = !DILocation(line: 427, column: 26, scope: !709)
!718 = !DILocation(line: 428, column: 5, scope: !709)
!719 = !DILocation(line: 429, column: 31, scope: !709)
!720 = !DILocation(line: 429, column: 21, scope: !709)
!721 = !DILocation(line: 428, column: 9, scope: !709)
!722 = !DILocation(line: 429, column: 15, scope: !709)
!723 = !DILocation(line: 430, column: 13, scope: !724)
!724 = distinct !DILexicalBlock(scope: !709, file: !3, line: 430, column: 9)
!725 = !DILocation(line: 430, column: 9, scope: !709)
!726 = !DILocation(line: 431, column: 26, scope: !727)
!727 = distinct !DILexicalBlock(scope: !724, file: !3, line: 430, column: 33)
!728 = !DILocation(line: 431, column: 9, scope: !727)
!729 = !DILocation(line: 434, column: 1, scope: !709)
!730 = !DILocation(line: 433, column: 5, scope: !709)
!731 = distinct !DISubprogram(name: "stream_seek", scope: !3, file: !3, line: 437, type: !283, isLocal: true, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !732)
!732 = !{!733, !734, !735, !741, !742, !743}
!733 = !DILocalVariable(name: "n_args", arg: 1, scope: !731, file: !3, line: 437, type: !159)
!734 = !DILocalVariable(name: "args", arg: 2, scope: !731, file: !3, line: 437, type: !169)
!735 = !DILocalVariable(name: "seek_s", scope: !731, file: !3, line: 438, type: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mp_stream_seek_t", file: !99, line: 52, size: 128, elements: !737)
!737 = !{!738, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !736, file: !99, line: 56, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_off_t", file: !75, line: 73, baseType: !249)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "whence", scope: !736, file: !99, line: 57, baseType: !82, size: 32, offset: 64)
!741 = !DILocalVariable(name: "stream_p", scope: !731, file: !3, line: 451, type: !96)
!742 = !DILocalVariable(name: "error", scope: !731, file: !3, line: 452, type: !82)
!743 = !DILocalVariable(name: "res", scope: !731, file: !3, line: 453, type: !74)
!744 = !DILocation(line: 437, column: 36, scope: !731)
!745 = !DILocation(line: 437, column: 60, scope: !731)
!746 = !DILocation(line: 438, column: 5, scope: !731)
!747 = !DILocation(line: 440, column: 36, scope: !731)
!748 = !DILocation(line: 440, column: 21, scope: !731)
!749 = !DILocation(line: 440, column: 12, scope: !731)
!750 = !DILocation(line: 440, column: 19, scope: !731)
!751 = !{!752, !415, i64 0}
!752 = !{!"mp_stream_seek_t", !415, i64 0, !361, i64 8}
!753 = !DILocation(line: 441, column: 12, scope: !731)
!754 = !DILocation(line: 441, column: 19, scope: !731)
!755 = !{!752, !361, i64 8}
!756 = !DILocation(line: 442, column: 16, scope: !757)
!757 = distinct !DILexicalBlock(scope: !731, file: !3, line: 442, column: 9)
!758 = !DILocation(line: 442, column: 9, scope: !731)
!759 = !DILocation(line: 443, column: 40, scope: !760)
!760 = distinct !DILexicalBlock(scope: !757, file: !3, line: 442, column: 22)
!761 = !DILocation(line: 443, column: 25, scope: !760)
!762 = !DILocation(line: 443, column: 23, scope: !760)
!763 = !DILocation(line: 444, column: 5, scope: !760)
!764 = !DILocation(line: 447, column: 16, scope: !765)
!765 = distinct !DILexicalBlock(scope: !731, file: !3, line: 447, column: 9)
!766 = !DILocation(line: 447, column: 23, scope: !765)
!767 = !DILocation(line: 447, column: 45, scope: !765)
!768 = !DILocation(line: 447, column: 52, scope: !765)
!769 = !DILocation(line: 447, column: 35, scope: !765)
!770 = !DILocation(line: 448, column: 9, scope: !771)
!771 = distinct !DILexicalBlock(scope: !765, file: !3, line: 447, column: 57)
!772 = !DILocation(line: 451, column: 51, scope: !731)
!773 = !DILocation(line: 451, column: 37, scope: !731)
!774 = !DILocation(line: 451, column: 26, scope: !731)
!775 = !DILocation(line: 452, column: 5, scope: !731)
!776 = !DILocation(line: 453, column: 31, scope: !731)
!777 = !DILocation(line: 453, column: 21, scope: !731)
!778 = !DILocation(line: 453, column: 73, scope: !731)
!779 = !DILocation(line: 452, column: 9, scope: !731)
!780 = !DILocation(line: 453, column: 15, scope: !731)
!781 = !DILocation(line: 454, column: 13, scope: !782)
!782 = distinct !DILexicalBlock(scope: !731, file: !3, line: 454, column: 9)
!783 = !DILocation(line: 454, column: 9, scope: !731)
!784 = !DILocation(line: 455, column: 26, scope: !785)
!785 = distinct !DILexicalBlock(scope: !782, file: !3, line: 454, column: 33)
!786 = !DILocation(line: 455, column: 9, scope: !785)
!787 = !DILocation(line: 459, column: 44, scope: !731)
!788 = !DILocation(line: 459, column: 12, scope: !731)
!789 = !DILocation(line: 460, column: 1, scope: !731)
!790 = !DILocation(line: 459, column: 5, scope: !731)
!791 = distinct !DISubprogram(name: "stream_tell", scope: !3, file: !3, line: 463, type: !235, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !2, retainedNodes: !792)
!792 = !{!793, !794, !795, !796}
!793 = !DILocalVariable(name: "self", arg: 1, scope: !791, file: !3, line: 463, type: !79)
!794 = !DILocalVariable(name: "offset", scope: !791, file: !3, line: 464, type: !79)
!795 = !DILocalVariable(name: "whence", scope: !791, file: !3, line: 465, type: !79)
!796 = !DILocalVariable(name: "args", scope: !791, file: !3, line: 466, type: !797)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192, elements: !230)
!798 = !DILocation(line: 463, column: 38, scope: !791)
!799 = !DILocation(line: 464, column: 14, scope: !791)
!800 = !DILocation(line: 465, column: 14, scope: !791)
!801 = !DILocation(line: 466, column: 5, scope: !791)
