; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/stream.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/stream.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%union.anon = type { i8* (i64, i8**)* }
%struct._mp_obj_none_t = type opaque
%struct._mp_stream_p_t = type { i64 (i8*, i8*, i64, i32*)*, i64 (i8*, i8*, i64, i32*)*, i64 (i8*, i64, i64, i32*)*, i8 }
%struct.compressed_string_t = type { i16, [0 x i8] }
%struct._vstr_t = type { i64, i64, i8*, i8 }
%struct.mp_stream_seek_t = type { i64, i32 }


!36 = !DIEnumerator(name: "MP_BINARY_OP_NOT_EQUAL", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "MP_BINARY_OP_IN", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "MP_BINARY_OP_IS", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "MP_BINARY_OP_EXCEPTION_MATCH", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_OR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_XOR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_AND", value: 11, isUnsigned: true)
!43 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_LSHIFT", value: 12, isUnsigned: true)
!44 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_RSHIFT", value: 13, isUnsigned: true)
!45 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_ADD", value: 14, isUnsigned: true)
!46 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_SUBTRACT", value: 15, isUnsigned: true)
!47 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MULTIPLY", value: 16, isUnsigned: true)
!48 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_FLOOR_DIVIDE", value: 17, isUnsigned: true)
!49 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_TRUE_DIVIDE", value: 18, isUnsigned: true)
!50 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_MODULO", value: 19, isUnsigned: true)
!51 = !DIEnumerator(name: "MP_BINARY_OP_INPLACE_POWER", value: 20, isUnsigned: true)
!52 = !DIEnumerator(name: "MP_BINARY_OP_OR", value: 21, isUnsigned: true)
!53 = !DIEnumerator(name: "MP_BINARY_OP_XOR", value: 22, isUnsigned: true)
!54 = !DIEnumerator(name: "MP_BINARY_OP_AND", value: 23, isUnsigned: true)
!55 = !DIEnumerator(name: "MP_BINARY_OP_LSHIFT", value: 24, isUnsigned: true)
!56 = !DIEnumerator(name: "MP_BINARY_OP_RSHIFT", value: 25, isUnsigned: true)
!57 = !DIEnumerator(name: "MP_BINARY_OP_ADD", value: 26, isUnsigned: true)
!58 = !DIEnumerator(name: "MP_BINARY_OP_SUBTRACT", value: 27, isUnsigned: true)
!59 = !DIEnumerator(name: "MP_BINARY_OP_MULTIPLY", value: 28, isUnsigned: true)
!60 = !DIEnumerator(name: "MP_BINARY_OP_FLOOR_DIVIDE", value: 29, isUnsigned: true)
!61 = !DIEnumerator(name: "MP_BINARY_OP_TRUE_DIVIDE", value: 30, isUnsigned: true)
!62 = !DIEnumerator(name: "MP_BINARY_OP_MODULO", value: 31, isUnsigned: true)
!63 = !DIEnumerator(name: "MP_BINARY_OP_POWER", value: 32, isUnsigned: true)
!64 = !DIEnumerator(name: "MP_BINARY_OP_NUM_BYTECODE", value: 33, isUnsigned: true)
!65 = !DIEnumerator(name: "MP_BINARY_OP_DIVMOD", value: 33, isUnsigned: true)
!66 = !DIEnumerator(name: "MP_BINARY_OP_CONTAINS", value: 34, isUnsigned: true)
!67 = !DIEnumerator(name: "MP_BINARY_OP_NUM_RUNTIME", value: 35, isUnsigned: true)
!68 = !DIEnumerator(name: "MP_BINARY_OP_NOT_IN", value: 36, isUnsigned: true)
!69 = !DIEnumerator(name: "MP_BINARY_OP_IS_NOT", value: 37, isUnsigned: true)
!70 = !{!71, !76, !82, !81, !98, !124, !267, !161, !95, !247, !78}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_func_t", scope: !73, file: !72, line: 51, baseType: !105)
!72 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/stream.c", directory: "")
!73 = distinct !DISubprogram(name: "mp_stream_rw", scope: !72, file: !72, line: 49, type: !74, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!74 = !DISubroutineType(types: !75)
!75 = !{!76, !81, !82, !76, !83, !85}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !77, line: 70, baseType: !78)
!77 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !79, line: 30, baseType: !80)
!79 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !6, line: 46, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !86, line: 39, baseType: !87)
!86 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!87 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!88 = !{!89, !90, !91, !92, !93, !94, !96, !97, !121, !122}
!89 = !DILocalVariable(name: "stream", arg: 1, scope: !73, file: !72, line: 49, type: !81)
!90 = !DILocalVariable(name: "buf_", arg: 2, scope: !73, file: !72, line: 49, type: !82)
!91 = !DILocalVariable(name: "size", arg: 3, scope: !73, file: !72, line: 49, type: !76)
!92 = !DILocalVariable(name: "errcode", arg: 4, scope: !73, file: !72, line: 49, type: !83)
!93 = !DILocalVariable(name: "flags", arg: 5, scope: !73, file: !72, line: 49, type: !85)
!94 = !DILocalVariable(name: "buf", scope: !73, file: !72, line: 50, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!96 = !DILocalVariable(name: "io_func", scope: !73, file: !72, line: 52, type: !71)
!97 = !DILocalVariable(name: "stream_p", scope: !73, file: !72, line: 53, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_stream_p_t", file: !101, line: 74, baseType: !102)
!101 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/stream.h", directory: "")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_stream_p_t", file: !101, line: 66, size: 256, elements: !103)
!103 = !{!104, !108, !114, !118, !119}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !102, file: !101, line: 69, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!76, !81, !82, !76, !83}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !102, file: !101, line: 70, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!76, !81, !112, !76, !83}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ioctl", scope: !102, file: !101, line: 71, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!76, !81, !76, !78, !83}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "is_text", scope: !102, file: !101, line: 72, baseType: !76, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pyserial_compatibility", scope: !102, file: !101, line: 73, baseType: !120, size: 1, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !DILocalVariable(name: "done", scope: !73, file: !72, line: 61, type: !76)
!122 = !DILocalVariable(name: "out_sz", scope: !123, file: !72, line: 63, type: !76)
!123 = distinct !DILexicalBlock(scope: !73, file: !72, line: 62, column: 22)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !6, line: 59, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !6, line: 56, size: 64, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !6, line: 57, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !6, line: 52, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !6, line: 474, size: 960, elements: !134)
!134 = !{!135, !136, !140, !141, !166, !190, !195, !201, !207, !215, !220, !234, !239, !259, !260, !261}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !133, file: !6, line: 476, baseType: !126, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !6, line: 479, baseType: !137, size: 16, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !138, line: 31, baseType: !139)
!138 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!139 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !6, line: 482, baseType: !137, size: 16, offset: 80)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !133, file: !6, line: 485, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !6, line: 441, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146, !81, !165}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !149, line: 53, baseType: !150)
!149 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !149, line: 50, size: 128, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !149, line: 51, baseType: !82, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !150, file: !149, line: 52, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !149, line: 48, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !82, !158, !161}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 31, baseType: !163)
!162 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !164, line: 92, baseType: !80)
!164 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !6, line: 430, baseType: !5)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !133, file: !6, line: 488, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !6, line: 442, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!81, !130, !161, !171, !173}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !6, line: 374, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !6, line: 365, size: 192, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !175, file: !6, line: 366, baseType: !161, size: 1, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !175, file: !6, line: 367, baseType: !161, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !175, file: !6, line: 368, baseType: !161, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !175, file: !6, line: 369, baseType: !161, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !175, file: !6, line: 371, baseType: !161, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !175, file: !6, line: 372, baseType: !161, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !175, file: !6, line: 373, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !6, line: 353, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !6, line: 350, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !186, file: !6, line: 351, baseType: !81, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !186, file: !6, line: 352, baseType: !81, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !133, file: !6, line: 491, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !6, line: 443, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!81, !81, !161, !161, !171}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !133, file: !6, line: 495, baseType: !196, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !6, line: 444, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!81, !200, !81}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !16, line: 65, baseType: !15)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !133, file: !6, line: 496, baseType: !202, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !6, line: 445, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!81, !206, !81, !81}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !16, line: 145, baseType: !29)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !133, file: !6, line: 509, baseType: !208, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !6, line: 446, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !81, !212, !214}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !213, line: 48, baseType: !161)
!213 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/qstr.h", directory: "")
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !133, file: !6, line: 516, baseType: !216, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !6, line: 447, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!81, !81, !81, !81}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !133, file: !6, line: 521, baseType: !221, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !6, line: 448, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!81, !81, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !6, line: 435, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !6, line: 432, size: 256, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !227, file: !6, line: 433, baseType: !126, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !6, line: 434, baseType: !231, size: 192, offset: 64)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 192, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !133, file: !6, line: 525, baseType: !235, size: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !6, line: 415, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!81, !81}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !133, file: !6, line: 528, baseType: !240, size: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !6, line: 470, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !6, line: 468, size: 64, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !241, file: !6, line: 469, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !81, !252, !76}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !77, line: 69, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !249, line: 32, baseType: !250)
!249 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !164, line: 49, baseType: !251)
!251 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !6, line: 464, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !6, line: 451, size: 192, elements: !255)
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !6, line: 457, baseType: !82, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !6, line: 458, baseType: !161, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !254, file: !6, line: 459, baseType: !84, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !133, file: !6, line: 531, baseType: !112, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !133, file: !6, line: 537, baseType: !112, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !133, file: !6, line: 540, baseType: !262, size: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !6, line: 775, size: 256, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !263, file: !6, line: 776, baseType: !126, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !263, file: !6, line: 777, baseType: !174, size: 192, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!268 = !{!0, !269, !292, !294, !317, !319, !321, !323, !325, !327, !329, !331}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "mp_stream_read1_obj", scope: !2, file: !72, line: 227, type: !271, isLocal: false, isDefinition: true)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_var_t", file: !6, line: 814, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_var_t", file: !6, line: 805, size: 192, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !273, file: !6, line: 806, baseType: !126, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "is_kw", scope: !273, file: !6, line: 807, baseType: !120, size: 1, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_min", scope: !273, file: !6, line: 808, baseType: !76, size: 15, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "n_args_max", scope: !273, file: !6, line: 809, baseType: !76, size: 16, offset: 80, flags: DIFlagBitField, extraData: i64 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !273, file: !6, line: 813, baseType: !280, size: 64, offset: 128)
!280 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !6, line: 810, size: 64, elements: !281)
!281 = !{!282, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !280, file: !6, line: 811, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_var_t", file: !6, line: 418, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!81, !161, !171}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !280, file: !6, line: 812, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_kw_t", file: !6, line: 421, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!81, !161, !171, !173}
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "mp_stream_write_obj", scope: !2, file: !72, line: 270, type: !271, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "mp_stream_write1_obj", scope: !2, file: !72, line: 277, type: !296, isLocal: false, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_builtin_fixed_t", file: !6, line: 802, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_builtin_fixed_t", file: !6, line: 794, size: 128, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !298, file: !6, line: 795, baseType: !126, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !298, file: !6, line: 801, baseType: !302, size: 64, offset: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !6, line: 796, size: 64, elements: !303)
!303 = !{!304, !309, !310, !315}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_0", scope: !302, file: !6, line: 797, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_0_t", file: !6, line: 414, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!81}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_1", scope: !302, file: !6, line: 798, baseType: !235, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_2", scope: !302, file: !6, line: 799, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_2_t", file: !6, line: 416, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!81, !81, !81}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_3", scope: !302, file: !6, line: 800, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_3_t", file: !6, line: 417, baseType: !217)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "mp_stream_readinto_obj", scope: !2, file: !72, line: 308, type: !271, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "mp_stream_unbuffered_readline_obj", scope: !2, file: !72, line: 402, type: !271, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "mp_stream_unbuffered_readlines_obj", scope: !2, file: !72, line: 416, type: !296, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "mp_stream_close_obj", scope: !2, file: !72, line: 435, type: !296, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "mp_stream_seek_obj", scope: !2, file: !72, line: 461, type: !271, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "mp_stream_tell_obj", scope: !2, file: !72, line: 469, type: !296, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "mp_stream_flush_obj", scope: !2, file: !72, line: 483, type: !296, isLocal: false, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "mp_stream_ioctl_obj", scope: !2, file: !72, line: 505, type: !271, isLocal: false, isDefinition: true)
!333 = !{i32 2, !"SDK Version", [2 x i32] [i32 10, i32 14]}
!334 = !{i32 2, !"Dwarf Version", i32 4}
!335 = !{i32 2, !"Debug Info Version", i32 3}
!336 = !{i32 1, !"wchar_size", i32 4}
!337 = !{i32 7, !"PIC Level", i32 2}
!338 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!339 = !DILocation(line: 49, column: 33, scope: !73)
!340 = !DILocation(line: 49, column: 47, scope: !73)
!341 = !DILocation(line: 49, column: 63, scope: !73)
!342 = !DILocation(line: 49, column: 74, scope: !73)
!343 = !DILocation(line: 49, column: 88, scope: !73)
!344 = !DILocation(line: 50, column: 11, scope: !73)
!345 = !DILocation(line: 53, column: 37, scope: !73)
!346 = !DILocation(line: 53, column: 26, scope: !73)
!347 = !DILocation(line: 54, column: 9, scope: !348)
!348 = distinct !DILexicalBlock(scope: !73, file: !72, line: 54, column: 9)
!349 = !DILocation(line: 54, column: 15, scope: !348)
!350 = !DILocation(line: 54, column: 9, scope: !73)
!351 = !DILocation(line: 0, scope: !348)
!352 = !{!353, !353, i64 0}
!353 = !{!"any pointer", !354, i64 0}
!354 = !{!"omnipotent char", !355, i64 0}
!355 = !{!"Simple C/C++ TBAA"}
!356 = !DILocation(line: 52, column: 15, scope: !73)
!357 = !DILocation(line: 60, column: 14, scope: !73)
!358 = !{!359, !359, i64 0}
!359 = !{!"int", !354, i64 0}
!360 = !DILocation(line: 61, column: 15, scope: !73)
!361 = !DILocation(line: 62, column: 17, scope: !73)
!362 = !DILocation(line: 62, column: 5, scope: !73)
!363 = !DILocation(line: 77, column: 19, scope: !364)
!364 = distinct !DILexicalBlock(scope: !123, file: !72, line: 77, column: 13)
!365 = !DILocation(line: 0, scope: !364)
!366 = !DILocation(line: 63, column: 28, scope: !123)
!367 = !DILocation(line: 63, column: 19, scope: !123)
!368 = !DILocation(line: 67, column: 13, scope: !123)
!369 = !DILocation(line: 77, column: 13, scope: !123)
!370 = !DILocation(line: 81, column: 13, scope: !123)
!371 = !DILocation(line: 82, column: 14, scope: !123)
!372 = !DILocation(line: 83, column: 14, scope: !123)
!373 = !DILocation(line: 0, scope: !73)
!374 = !DILocation(line: 86, column: 1, scope: !73)
!375 = distinct !DISubprogram(name: "mp_get_stream", scope: !101, file: !101, line: 95, type: !376, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !379)
!376 = !DISubroutineType(types: !377)
!377 = !{!98, !378}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_const_obj_t", file: !6, line: 47, baseType: !112)
!379 = !{!380}
!380 = !DILocalVariable(name: "self", arg: 1, scope: !375, file: !101, line: 95, type: !378)
!381 = !DILocation(line: 95, column: 65, scope: !375)
!382 = !DILocation(line: 96, column: 79, scope: !375)
!383 = !{!384, !353, i64 0}
!384 = !{!"_mp_obj_base_t", !353, i64 0}
!385 = !DILocation(line: 96, column: 85, scope: !375)
!386 = !{!387, !353, i64 96}
!387 = !{!"_mp_obj_type_t", !384, i64 0, !388, i64 8, !388, i64 10, !353, i64 16, !353, i64 24, !353, i64 32, !353, i64 40, !353, i64 48, !353, i64 56, !353, i64 64, !353, i64 72, !353, i64 80, !389, i64 88, !353, i64 96, !353, i64 104, !353, i64 112}
!388 = !{!"short", !354, i64 0}
!389 = !{!"_mp_buffer_p_t", !353, i64 0}
!390 = !DILocation(line: 96, column: 5, scope: !375)
!391 = distinct !DISubprogram(name: "mp_get_stream_raise", scope: !72, file: !72, line: 88, type: !392, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!98, !81, !84}
!394 = !{!395, !396, !397, !399}
!395 = !DILocalVariable(name: "self_in", arg: 1, scope: !391, file: !72, line: 88, type: !81)
!396 = !DILocalVariable(name: "flags", arg: 2, scope: !391, file: !72, line: 88, type: !84)
!397 = !DILocalVariable(name: "type", scope: !391, file: !72, line: 89, type: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!399 = !DILocalVariable(name: "stream_p", scope: !391, file: !72, line: 90, type: !98)
!400 = !DILocation(line: 88, column: 51, scope: !391)
!401 = !DILocation(line: 88, column: 64, scope: !391)
!402 = !DILocation(line: 89, column: 27, scope: !391)
!403 = !DILocation(line: 89, column: 20, scope: !391)
!404 = !DILocation(line: 90, column: 43, scope: !391)
!405 = !DILocation(line: 90, column: 26, scope: !391)
!406 = !DILocation(line: 91, column: 18, scope: !407)
!407 = distinct !DILexicalBlock(scope: !391, file: !72, line: 91, column: 9)
!408 = !DILocation(line: 92, column: 9, scope: !407)
!409 = !DILocation(line: 92, column: 20, scope: !407)
!410 = !DILocation(line: 92, column: 41, scope: !407)
!411 = !DILocation(line: 92, column: 54, scope: !407)
!412 = !{!413, !353, i64 0}
!413 = !{!"_mp_stream_p_t", !353, i64 0, !353, i64 8, !353, i64 16, !414, i64 24, !415, i64 24}
!414 = !{!"long", !354, i64 0}
!415 = !{!"_Bool", !354, i64 0}
!416 = !DILocation(line: 92, column: 59, scope: !407)
!417 = !DILocation(line: 93, column: 9, scope: !407)
!418 = !DILocation(line: 93, column: 20, scope: !407)
!419 = !DILocation(line: 93, column: 42, scope: !407)
!420 = !DILocation(line: 93, column: 55, scope: !407)
!421 = !{!413, !353, i64 8}
!422 = !DILocation(line: 93, column: 61, scope: !407)
!423 = !DILocation(line: 94, column: 9, scope: !407)
!424 = !DILocation(line: 94, column: 20, scope: !407)
!425 = !DILocation(line: 94, column: 42, scope: !407)
!426 = !DILocation(line: 94, column: 55, scope: !407)
!427 = !{!413, !353, i64 16}
!428 = !DILocation(line: 94, column: 61, scope: !407)
!429 = !DILocation(line: 91, column: 9, scope: !391)
!430 = !DILocation(line: 96, column: 40, scope: !431)
!431 = distinct !DILexicalBlock(scope: !407, file: !72, line: 94, column: 71)
!432 = !DILocation(line: 96, column: 9, scope: !431)
!433 = !DILocation(line: 98, column: 5, scope: !391)
!434 = distinct !DISubprogram(name: "stream_read", scope: !72, file: !72, line: 219, type: !285, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !435)
!435 = !{!436, !437}
!436 = !DILocalVariable(name: "n_args", arg: 1, scope: !434, file: !72, line: 219, type: !161)
!437 = !DILocalVariable(name: "args", arg: 2, scope: !434, file: !72, line: 219, type: !171)
!438 = !DILocation(line: 219, column: 36, scope: !434)
!439 = !DILocation(line: 219, column: 60, scope: !434)
!440 = !DILocation(line: 220, column: 12, scope: !434)
!441 = !DILocation(line: 220, column: 5, scope: !434)
!442 = distinct !DISubprogram(name: "stream_read1", scope: !72, file: !72, line: 224, type: !285, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !443)
!443 = !{!444, !445}
!444 = !DILocalVariable(name: "n_args", arg: 1, scope: !442, file: !72, line: 224, type: !161)
!445 = !DILocalVariable(name: "args", arg: 2, scope: !442, file: !72, line: 224, type: !171)
!446 = !DILocation(line: 224, column: 37, scope: !442)
!447 = !DILocation(line: 224, column: 61, scope: !442)
!448 = !DILocation(line: 225, column: 12, scope: !442)
!449 = !DILocation(line: 225, column: 5, scope: !442)
!450 = distinct !DISubprogram(name: "mp_stream_write", scope: !72, file: !72, line: 229, type: !451, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{!81, !81, !112, !161, !85}
!453 = !{!454, !455, !456, !457, !458, !459}
!454 = !DILocalVariable(name: "self_in", arg: 1, scope: !450, file: !72, line: 229, type: !81)
!455 = !DILocalVariable(name: "buf", arg: 2, scope: !450, file: !72, line: 229, type: !112)
!456 = !DILocalVariable(name: "len", arg: 3, scope: !450, file: !72, line: 229, type: !161)
!457 = !DILocalVariable(name: "flags", arg: 4, scope: !450, file: !72, line: 229, type: !85)
!458 = !DILocalVariable(name: "error", scope: !450, file: !72, line: 230, type: !84)
!459 = !DILocalVariable(name: "out_sz", scope: !450, file: !72, line: 231, type: !76)
!460 = !DILocation(line: 229, column: 35, scope: !450)
!461 = !DILocation(line: 229, column: 56, scope: !450)
!462 = !DILocation(line: 229, column: 68, scope: !450)
!463 = !DILocation(line: 229, column: 78, scope: !450)
!464 = !DILocation(line: 230, column: 5, scope: !450)
!465 = !DILocation(line: 230, column: 9, scope: !450)
!466 = !DILocation(line: 231, column: 24, scope: !450)
!467 = !DILocation(line: 231, column: 15, scope: !450)
!468 = !DILocation(line: 232, column: 9, scope: !469)
!469 = distinct !DILexicalBlock(scope: !450, file: !72, line: 232, column: 9)
!470 = !DILocation(line: 232, column: 15, scope: !469)
!471 = !DILocation(line: 232, column: 9, scope: !450)
!472 = !DILocation(line: 239, column: 9, scope: !473)
!473 = distinct !DILexicalBlock(scope: !469, file: !72, line: 232, column: 21)
!474 = !DILocation(line: 241, column: 16, scope: !475)
!475 = distinct !DILexicalBlock(scope: !469, file: !72, line: 240, column: 12)
!476 = !DILocation(line: 243, column: 1, scope: !450)
!477 = !DILocation(line: 241, column: 9, scope: !475)
!478 = distinct !DISubprogram(name: "mp_stream_write_adaptor", scope: !72, file: !72, line: 246, type: !156, scopeLine: 246, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!479 = !{!480, !481, !482}
!480 = !DILocalVariable(name: "self", arg: 1, scope: !478, file: !72, line: 246, type: !82)
!481 = !DILocalVariable(name: "buf", arg: 2, scope: !478, file: !72, line: 246, type: !158)
!482 = !DILocalVariable(name: "len", arg: 3, scope: !478, file: !72, line: 246, type: !161)
!483 = !DILocation(line: 246, column: 36, scope: !478)
!484 = !DILocation(line: 246, column: 54, scope: !478)
!485 = !DILocation(line: 246, column: 66, scope: !478)
!486 = !DILocation(line: 247, column: 5, scope: !478)
!487 = !DILocation(line: 248, column: 1, scope: !478)
!488 = distinct !DISubprogram(name: "stream_write_method", scope: !72, file: !72, line: 250, type: !285, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !489)
!489 = !{!490, !491, !492, !493, !494}
!490 = !DILocalVariable(name: "n_args", arg: 1, scope: !488, file: !72, line: 250, type: !161)
!491 = !DILocalVariable(name: "args", arg: 2, scope: !488, file: !72, line: 250, type: !171)
!492 = !DILocalVariable(name: "bufinfo", scope: !488, file: !72, line: 251, type: !253)
!493 = !DILocalVariable(name: "max_len", scope: !488, file: !72, line: 256, type: !161)
!494 = !DILocalVariable(name: "off", scope: !488, file: !72, line: 257, type: !161)
!495 = !DILocation(line: 250, column: 44, scope: !488)
!496 = !DILocation(line: 250, column: 68, scope: !488)
!497 = !DILocation(line: 251, column: 5, scope: !488)
!498 = !DILocation(line: 252, column: 25, scope: !488)
!499 = !DILocation(line: 251, column: 22, scope: !488)
!500 = !DILocation(line: 252, column: 5, scope: !488)
!501 = !DILocation(line: 253, column: 24, scope: !502)
!502 = distinct !DILexicalBlock(scope: !488, file: !72, line: 253, column: 9)
!503 = !DILocation(line: 253, column: 10, scope: !502)
!504 = !DILocation(line: 253, column: 34, scope: !502)
!505 = !DILocation(line: 253, column: 42, scope: !502)
!506 = !DILocation(line: 253, column: 45, scope: !502)
!507 = !DILocation(line: 253, column: 9, scope: !488)
!508 = !DILocation(line: 254, column: 29, scope: !509)
!509 = distinct !DILexicalBlock(scope: !502, file: !72, line: 253, column: 69)
!510 = !DILocation(line: 254, column: 9, scope: !509)
!511 = !DILocation(line: 256, column: 12, scope: !488)
!512 = !DILocation(line: 257, column: 12, scope: !488)
!513 = !DILocation(line: 258, column: 9, scope: !488)
!514 = !DILocation(line: 259, column: 44, scope: !515)
!515 = distinct !DILexicalBlock(scope: !516, file: !72, line: 258, column: 22)
!516 = distinct !DILexicalBlock(scope: !488, file: !72, line: 258, column: 9)
!517 = !DILocation(line: 259, column: 19, scope: !515)
!518 = !DILocation(line: 260, column: 5, scope: !515)
!519 = !DILocation(line: 261, column: 40, scope: !520)
!520 = distinct !DILexicalBlock(scope: !521, file: !72, line: 260, column: 29)
!521 = distinct !DILexicalBlock(scope: !516, file: !72, line: 260, column: 16)
!522 = !DILocation(line: 261, column: 15, scope: !520)
!523 = !DILocation(line: 262, column: 44, scope: !520)
!524 = !DILocation(line: 262, column: 19, scope: !520)
!525 = !DILocation(line: 263, column: 27, scope: !526)
!526 = distinct !DILexicalBlock(scope: !520, file: !72, line: 263, column: 13)
!527 = !{!528, !414, i64 8}
!528 = !{!"_mp_buffer_info_t", !353, i64 0, !414, i64 8, !359, i64 16}
!529 = !DILocation(line: 263, column: 17, scope: !526)
!530 = !DILocation(line: 263, column: 13, scope: !520)
!531 = !DILocation(line: 0, scope: !488)
!532 = !DILocation(line: 267, column: 13, scope: !488)
!533 = !DILocation(line: 267, column: 17, scope: !488)
!534 = !DILocation(line: 268, column: 28, scope: !488)
!535 = !DILocation(line: 268, column: 52, scope: !488)
!536 = !{!528, !353, i64 0}
!537 = !DILocation(line: 268, column: 56, scope: !488)
!538 = !DILocation(line: 268, column: 63, scope: !488)
!539 = !DILocation(line: 268, column: 12, scope: !488)
!540 = !DILocation(line: 269, column: 1, scope: !488)
!541 = !DILocation(line: 268, column: 5, scope: !488)
!542 = distinct !DISubprogram(name: "stream_write1_method", scope: !72, file: !72, line: 272, type: !313, scopeLine: 272, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !543)
!543 = !{!544, !545, !546}
!544 = !DILocalVariable(name: "self_in", arg: 1, scope: !542, file: !72, line: 272, type: !81)
!545 = !DILocalVariable(name: "arg", arg: 2, scope: !542, file: !72, line: 272, type: !81)
!546 = !DILocalVariable(name: "bufinfo", scope: !542, file: !72, line: 273, type: !253)
!547 = !DILocation(line: 272, column: 47, scope: !542)
!548 = !DILocation(line: 272, column: 65, scope: !542)
!549 = !DILocation(line: 273, column: 5, scope: !542)
!550 = !DILocation(line: 273, column: 22, scope: !542)
!551 = !DILocation(line: 274, column: 5, scope: !542)
!552 = !DILocation(line: 275, column: 45, scope: !542)
!553 = !DILocation(line: 275, column: 58, scope: !542)
!554 = !DILocation(line: 275, column: 12, scope: !542)
!555 = !DILocation(line: 276, column: 1, scope: !542)
!556 = !DILocation(line: 275, column: 5, scope: !542)
!557 = distinct !DISubprogram(name: "stream_readinto", scope: !72, file: !72, line: 279, type: !285, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !558)
!558 = !{!559, !560, !561, !562, !563, !564}
!559 = !DILocalVariable(name: "n_args", arg: 1, scope: !557, file: !72, line: 279, type: !161)
!560 = !DILocalVariable(name: "args", arg: 2, scope: !557, file: !72, line: 279, type: !171)
!561 = !DILocalVariable(name: "bufinfo", scope: !557, file: !72, line: 280, type: !253)
!562 = !DILocalVariable(name: "len", scope: !557, file: !72, line: 286, type: !76)
!563 = !DILocalVariable(name: "error", scope: !557, file: !72, line: 297, type: !84)
!564 = !DILocalVariable(name: "out_sz", scope: !557, file: !72, line: 298, type: !76)
!565 = !DILocation(line: 279, column: 40, scope: !557)
!566 = !DILocation(line: 279, column: 64, scope: !557)
!567 = !DILocation(line: 280, column: 5, scope: !557)
!568 = !DILocation(line: 281, column: 25, scope: !557)
!569 = !DILocation(line: 280, column: 22, scope: !557)
!570 = !DILocation(line: 281, column: 5, scope: !557)
!571 = !DILocation(line: 286, column: 29, scope: !557)
!572 = !DILocation(line: 286, column: 15, scope: !557)
!573 = !DILocation(line: 287, column: 16, scope: !574)
!574 = distinct !DILexicalBlock(scope: !557, file: !72, line: 287, column: 9)
!575 = !DILocation(line: 287, column: 9, scope: !557)
!576 = !DILocation(line: 288, column: 27, scope: !577)
!577 = distinct !DILexicalBlock(scope: !578, file: !72, line: 288, column: 13)
!578 = distinct !DILexicalBlock(scope: !574, file: !72, line: 287, column: 21)
!579 = !DILocation(line: 288, column: 13, scope: !577)
!580 = !DILocation(line: 288, column: 37, scope: !577)
!581 = !DILocation(line: 288, column: 13, scope: !578)
!582 = !DILocation(line: 289, column: 33, scope: !583)
!583 = distinct !DILexicalBlock(scope: !577, file: !72, line: 288, column: 61)
!584 = !DILocation(line: 289, column: 13, scope: !583)
!585 = !DILocation(line: 291, column: 30, scope: !578)
!586 = !DILocation(line: 291, column: 15, scope: !578)
!587 = !DILocation(line: 292, column: 27, scope: !588)
!588 = distinct !DILexicalBlock(scope: !578, file: !72, line: 292, column: 13)
!589 = !DILocation(line: 292, column: 17, scope: !588)
!590 = !DILocation(line: 292, column: 13, scope: !578)
!591 = !DILocation(line: 0, scope: !557)
!592 = !DILocation(line: 297, column: 5, scope: !557)
!593 = !DILocation(line: 298, column: 24, scope: !557)
!594 = !DILocation(line: 297, column: 9, scope: !557)
!595 = !DILocation(line: 298, column: 15, scope: !557)
!596 = !DILocation(line: 299, column: 9, scope: !597)
!597 = distinct !DILexicalBlock(scope: !557, file: !72, line: 299, column: 9)
!598 = !DILocation(line: 299, column: 15, scope: !597)
!599 = !DILocation(line: 299, column: 9, scope: !557)
!600 = !DILocation(line: 303, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !597, file: !72, line: 299, column: 21)
!602 = !DILocation(line: 305, column: 16, scope: !603)
!603 = distinct !DILexicalBlock(scope: !597, file: !72, line: 304, column: 12)
!604 = !DILocation(line: 307, column: 1, scope: !557)
!605 = !DILocation(line: 305, column: 9, scope: !603)
!606 = distinct !DISubprogram(name: "stream_unbuffered_readline", scope: !72, file: !72, line: 351, type: !285, scopeLine: 351, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !607)
!607 = !{!608, !609, !610, !611, !612, !621, !623, !624}
!608 = !DILocalVariable(name: "n_args", arg: 1, scope: !606, file: !72, line: 351, type: !161)
!609 = !DILocalVariable(name: "args", arg: 2, scope: !606, file: !72, line: 351, type: !171)
!610 = !DILocalVariable(name: "stream_p", scope: !606, file: !72, line: 352, type: !98)
!611 = !DILocalVariable(name: "max_size", scope: !606, file: !72, line: 354, type: !247)
!612 = !DILocalVariable(name: "vstr", scope: !606, file: !72, line: 359, type: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "vstr_t", file: !86, line: 165, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vstr_t", file: !86, line: 160, size: 256, elements: !615)
!615 = !{!616, !617, !618, !620}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !614, file: !86, line: 161, baseType: !161, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !614, file: !86, line: 162, baseType: !161, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !614, file: !86, line: 163, baseType: !619, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_buf", scope: !614, file: !86, line: 164, baseType: !120, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!621 = !DILocalVariable(name: "p", scope: !622, file: !72, line: 367, type: !619)
!622 = distinct !DILexicalBlock(scope: !606, file: !72, line: 366, column: 47)
!623 = !DILocalVariable(name: "error", scope: !622, file: !72, line: 368, type: !84)
!624 = !DILocalVariable(name: "out_sz", scope: !622, file: !72, line: 369, type: !76)
!625 = !DILocation(line: 351, column: 51, scope: !606)
!626 = !DILocation(line: 351, column: 75, scope: !606)
!627 = !DILocation(line: 352, column: 51, scope: !606)
!628 = !DILocation(line: 352, column: 37, scope: !606)
!629 = !DILocation(line: 352, column: 26, scope: !606)
!630 = !DILocation(line: 354, column: 14, scope: !606)
!631 = !DILocation(line: 355, column: 16, scope: !632)
!632 = distinct !DILexicalBlock(scope: !606, file: !72, line: 355, column: 9)
!633 = !DILocation(line: 355, column: 9, scope: !606)
!634 = !DILocation(line: 359, column: 5, scope: !606)
!635 = !DILocation(line: 359, column: 12, scope: !606)
!636 = !DILocation(line: 360, column: 9, scope: !606)
!637 = !DILocation(line: 356, column: 20, scope: !638)
!638 = distinct !DILexicalBlock(scope: !632, file: !72, line: 355, column: 21)
!639 = !DILocation(line: 360, column: 18, scope: !640)
!640 = distinct !DILexicalBlock(scope: !606, file: !72, line: 360, column: 9)
!641 = !DILocation(line: 361, column: 9, scope: !642)
!642 = distinct !DILexicalBlock(scope: !640, file: !72, line: 360, column: 25)
!643 = !DILocation(line: 362, column: 5, scope: !642)
!644 = !DILocation(line: 363, column: 9, scope: !645)
!645 = distinct !DILexicalBlock(scope: !640, file: !72, line: 362, column: 12)
!646 = !DILocation(line: 0, scope: !622)
!647 = !DILocation(line: 366, column: 5, scope: !606)
!648 = !DILocation(line: 356, column: 18, scope: !638)
!649 = !DILocation(line: 366, column: 21, scope: !606)
!650 = !DILocation(line: 366, column: 27, scope: !606)
!651 = !DILocation(line: 366, column: 38, scope: !606)
!652 = !DILocation(line: 366, column: 41, scope: !606)
!653 = !DILocation(line: 0, scope: !606)
!654 = !DILocation(line: 367, column: 19, scope: !622)
!655 = !DILocation(line: 367, column: 15, scope: !622)
!656 = !DILocation(line: 368, column: 9, scope: !622)
!657 = !DILocation(line: 369, column: 28, scope: !622)
!658 = !DILocation(line: 369, column: 43, scope: !622)
!659 = !DILocation(line: 368, column: 13, scope: !622)
!660 = !DILocation(line: 369, column: 19, scope: !622)
!661 = !DILocation(line: 370, column: 13, scope: !622)
!662 = !DILocation(line: 385, column: 30, scope: !663)
!663 = distinct !DILexicalBlock(scope: !664, file: !72, line: 370, column: 40)
!664 = distinct !DILexicalBlock(scope: !622, file: !72, line: 370, column: 13)
!665 = !DILocation(line: 385, column: 13, scope: !663)
!666 = !DILocation(line: 392, column: 13, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !72, line: 387, column: 26)
!668 = distinct !DILexicalBlock(scope: !622, file: !72, line: 387, column: 13)
!669 = !DILocation(line: 398, column: 5, scope: !606)
!670 = !DILocation(line: 395, column: 13, scope: !671)
!671 = distinct !DILexicalBlock(scope: !622, file: !72, line: 395, column: 13)
!672 = !{!354, !354, i64 0}
!673 = !DILocation(line: 395, column: 16, scope: !671)
!674 = distinct !{!674, !647, !669}
!675 = !DILocation(line: 400, column: 37, scope: !606)
!676 = !DILocation(line: 400, column: 12, scope: !606)
!677 = !DILocation(line: 401, column: 1, scope: !606)
!678 = !DILocation(line: 400, column: 5, scope: !606)
!679 = distinct !DISubprogram(name: "stream_unbuffered_readlines", scope: !72, file: !72, line: 405, type: !237, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !680)
!680 = !{!681, !682, !683}
!681 = !DILocalVariable(name: "self", arg: 1, scope: !679, file: !72, line: 405, type: !81)
!682 = !DILocalVariable(name: "lines", scope: !679, file: !72, line: 406, type: !81)
!683 = !DILocalVariable(name: "line", scope: !684, file: !72, line: 408, type: !81)
!684 = distinct !DILexicalBlock(scope: !685, file: !72, line: 407, column: 14)
!685 = distinct !DILexicalBlock(scope: !686, file: !72, line: 407, column: 5)
!686 = distinct !DILexicalBlock(scope: !679, file: !72, line: 407, column: 5)
!687 = !DILocation(line: 405, column: 54, scope: !679)
!688 = !DILocation(line: 406, column: 22, scope: !679)
!689 = !DILocation(line: 406, column: 14, scope: !679)
!690 = !DILocation(line: 408, column: 25, scope: !684)
!691 = !DILocation(line: 408, column: 18, scope: !684)
!692 = !DILocation(line: 409, column: 14, scope: !693)
!693 = distinct !DILexicalBlock(scope: !684, file: !72, line: 409, column: 13)
!694 = !DILocation(line: 409, column: 13, scope: !684)
!695 = !DILocation(line: 412, column: 9, scope: !684)
!696 = !DILocation(line: 414, column: 5, scope: !679)
!697 = distinct !DISubprogram(name: "mp_stream_unbuffered_iter", scope: !72, file: !72, line: 418, type: !237, scopeLine: 418, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!698 = !{!699, !700}
!699 = !DILocalVariable(name: "self", arg: 1, scope: !697, file: !72, line: 418, type: !81)
!700 = !DILocalVariable(name: "l_in", scope: !697, file: !72, line: 419, type: !81)
!701 = !DILocation(line: 418, column: 45, scope: !697)
!702 = !DILocation(line: 419, column: 21, scope: !697)
!703 = !DILocation(line: 419, column: 14, scope: !697)
!704 = !DILocation(line: 420, column: 9, scope: !705)
!705 = distinct !DILexicalBlock(scope: !697, file: !72, line: 420, column: 9)
!706 = !DILocation(line: 424, column: 1, scope: !697)
!707 = distinct !DISubprogram(name: "mp_stream_close", scope: !72, file: !72, line: 426, type: !237, scopeLine: 426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DILocalVariable(name: "stream", arg: 1, scope: !707, file: !72, line: 426, type: !81)
!710 = !DILocalVariable(name: "stream_p", scope: !707, file: !72, line: 427, type: !98)
!711 = !DILocalVariable(name: "error", scope: !707, file: !72, line: 428, type: !84)
!712 = !DILocalVariable(name: "res", scope: !707, file: !72, line: 429, type: !76)
!713 = !DILocation(line: 426, column: 35, scope: !707)
!714 = !DILocation(line: 427, column: 37, scope: !707)
!715 = !DILocation(line: 427, column: 26, scope: !707)
!716 = !DILocation(line: 428, column: 5, scope: !707)
!717 = !DILocation(line: 429, column: 31, scope: !707)
!718 = !DILocation(line: 429, column: 21, scope: !707)
!719 = !DILocation(line: 428, column: 9, scope: !707)
!720 = !DILocation(line: 429, column: 15, scope: !707)
!721 = !DILocation(line: 430, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !707, file: !72, line: 430, column: 9)
!723 = !DILocation(line: 430, column: 9, scope: !707)
!724 = !DILocation(line: 431, column: 26, scope: !725)
!725 = distinct !DILexicalBlock(scope: !722, file: !72, line: 430, column: 33)
!726 = !DILocation(line: 431, column: 9, scope: !725)
!727 = !DILocation(line: 434, column: 1, scope: !707)
!728 = !DILocation(line: 433, column: 5, scope: !707)
!729 = distinct !DISubprogram(name: "stream_seek", scope: !72, file: !72, line: 437, type: !285, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !730)
!730 = !{!731, !732, !733, !739, !740, !741}
!731 = !DILocalVariable(name: "n_args", arg: 1, scope: !729, file: !72, line: 437, type: !161)
!732 = !DILocalVariable(name: "args", arg: 2, scope: !729, file: !72, line: 437, type: !171)
!733 = !DILocalVariable(name: "seek_s", scope: !729, file: !72, line: 438, type: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mp_stream_seek_t", file: !101, line: 52, size: 128, elements: !735)
!735 = !{!736, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !734, file: !101, line: 56, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_off_t", file: !77, line: 72, baseType: !251)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "whence", scope: !734, file: !101, line: 57, baseType: !84, size: 32, offset: 64)
!739 = !DILocalVariable(name: "stream_p", scope: !729, file: !72, line: 451, type: !98)
!740 = !DILocalVariable(name: "error", scope: !729, file: !72, line: 452, type: !84)
!741 = !DILocalVariable(name: "res", scope: !729, file: !72, line: 453, type: !76)
!742 = !DILocation(line: 437, column: 36, scope: !729)
!743 = !DILocation(line: 437, column: 60, scope: !729)
!744 = !DILocation(line: 438, column: 5, scope: !729)
!745 = !DILocation(line: 440, column: 36, scope: !729)
!746 = !DILocation(line: 440, column: 21, scope: !729)
!747 = !DILocation(line: 440, column: 12, scope: !729)
!748 = !DILocation(line: 440, column: 19, scope: !729)
!749 = !{!750, !414, i64 0}
!750 = !{!"mp_stream_seek_t", !414, i64 0, !359, i64 8}
!751 = !DILocation(line: 441, column: 12, scope: !729)
!752 = !DILocation(line: 441, column: 19, scope: !729)
!753 = !{!750, !359, i64 8}
!754 = !DILocation(line: 442, column: 16, scope: !755)
!755 = distinct !DILexicalBlock(scope: !729, file: !72, line: 442, column: 9)
!756 = !DILocation(line: 442, column: 9, scope: !729)
!757 = !DILocation(line: 443, column: 40, scope: !758)
!758 = distinct !DILexicalBlock(scope: !755, file: !72, line: 442, column: 22)
!759 = !DILocation(line: 443, column: 25, scope: !758)
!760 = !DILocation(line: 443, column: 23, scope: !758)
!761 = !DILocation(line: 444, column: 5, scope: !758)
!762 = !DILocation(line: 447, column: 16, scope: !763)
!763 = distinct !DILexicalBlock(scope: !729, file: !72, line: 447, column: 9)
!764 = !DILocation(line: 447, column: 23, scope: !763)
!765 = !DILocation(line: 447, column: 45, scope: !763)
!766 = !DILocation(line: 447, column: 52, scope: !763)
!767 = !DILocation(line: 447, column: 35, scope: !763)
!768 = !DILocation(line: 448, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !763, file: !72, line: 447, column: 57)
!770 = !DILocation(line: 451, column: 51, scope: !729)
!771 = !DILocation(line: 451, column: 37, scope: !729)
!772 = !DILocation(line: 451, column: 26, scope: !729)
!773 = !DILocation(line: 452, column: 5, scope: !729)
!774 = !DILocation(line: 453, column: 31, scope: !729)
!775 = !DILocation(line: 453, column: 21, scope: !729)
!776 = !DILocation(line: 453, column: 73, scope: !729)
!777 = !DILocation(line: 452, column: 9, scope: !729)
!778 = !DILocation(line: 453, column: 15, scope: !729)
!779 = !DILocation(line: 454, column: 13, scope: !780)
!780 = distinct !DILexicalBlock(scope: !729, file: !72, line: 454, column: 9)
!781 = !DILocation(line: 454, column: 9, scope: !729)
!782 = !DILocation(line: 455, column: 26, scope: !783)
!783 = distinct !DILexicalBlock(scope: !780, file: !72, line: 454, column: 33)
!784 = !DILocation(line: 455, column: 9, scope: !783)
!785 = !DILocation(line: 459, column: 44, scope: !729)
!786 = !DILocation(line: 459, column: 12, scope: !729)
!787 = !DILocation(line: 460, column: 1, scope: !729)
!788 = !DILocation(line: 459, column: 5, scope: !729)
!789 = distinct !DISubprogram(name: "stream_tell", scope: !72, file: !72, line: 463, type: !237, scopeLine: 463, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DILocalVariable(name: "self", arg: 1, scope: !789, file: !72, line: 463, type: !81)
!792 = !DILocalVariable(name: "offset", scope: !789, file: !72, line: 464, type: !81)
!793 = !DILocalVariable(name: "whence", scope: !789, file: !72, line: 465, type: !81)
!794 = !DILocalVariable(name: "args", scope: !789, file: !72, line: 466, type: !795)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 192, elements: !232)
!796 = !DILocation(line: 463, column: 38, scope: !789)
!797 = !DILocation(line: 464, column: 14, scope: !789)
!798 = !DILocation(line: 465, column: 14, scope: !789)
!799 = !DILocation(line: 466, column: 5, scope: !789)
