; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/vm.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/vm.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }
%struct._mp_obj_dict_t = type { %struct._mp_obj_base_t, %struct._mp_map_t }
%struct._mp_state_ctx_t = type { %struct._mp_state_thread_t, %struct._mp_state_vm_t, %struct._mp_state_mem_t }
%struct._mp_state_thread_t = type { i8*, %struct._mp_obj_dict_t*, %struct._mp_obj_dict_t*, %struct._nlr_buf_t* }
%struct._nlr_buf_t = type { %struct._nlr_buf_t*, i8*, [37 x i32] }

!225 = !DIEnumerator(name: "MP_QSTR_fromkeys", value: 144)
!226 = !DIEnumerator(name: "MP_QSTR_function", value: 145)
!227 = !DIEnumerator(name: "MP_QSTR_generator", value: 146)
!228 = !DIEnumerator(name: "MP_QSTR_get", value: 147)
!229 = !DIEnumerator(name: "MP_QSTR_getattr", value: 148)
!230 = !DIEnumerator(name: "MP_QSTR_getter", value: 149)
!231 = !DIEnumerator(name: "MP_QSTR_globals", value: 150)
!232 = !DIEnumerator(name: "MP_QSTR_hasattr", value: 151)
!233 = !DIEnumerator(name: "MP_QSTR_hash", value: 152)
!234 = !DIEnumerator(name: "MP_QSTR_heap_lock", value: 153)
!235 = !DIEnumerator(name: "MP_QSTR_heap_unlock", value: 154)
!236 = !DIEnumerator(name: "MP_QSTR_hex", value: 155)
!237 = !DIEnumerator(name: "MP_QSTR_id", value: 156)
!238 = !DIEnumerator(name: "MP_QSTR_index", value: 157)
!239 = !DIEnumerator(name: "MP_QSTR_insert", value: 158)
!240 = !DIEnumerator(name: "MP_QSTR_int", value: 159)
!241 = !DIEnumerator(name: "MP_QSTR_isalpha", value: 160)
!242 = !DIEnumerator(name: "MP_QSTR_isdigit", value: 161)
!243 = !DIEnumerator(name: "MP_QSTR_isinstance", value: 162)
!244 = !DIEnumerator(name: "MP_QSTR_islower", value: 163)
!245 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164)
!246 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165)
!247 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166)
!248 = !DIEnumerator(name: "MP_QSTR_items", value: 167)
!249 = !DIEnumerator(name: "MP_QSTR_iter", value: 168)
!250 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169)
!251 = !DIEnumerator(name: "MP_QSTR_join", value: 170)
!252 = !DIEnumerator(name: "MP_QSTR_key", value: 171)
!253 = !DIEnumerator(name: "MP_QSTR_keys", value: 172)
!254 = !DIEnumerator(name: "MP_QSTR_len", value: 173)
!255 = !DIEnumerator(name: "MP_QSTR_list", value: 174)
!256 = !DIEnumerator(name: "MP_QSTR_little", value: 175)
!257 = !DIEnumerator(name: "MP_QSTR_locals", value: 176)
!258 = !DIEnumerator(name: "MP_QSTR_lower", value: 177)
!259 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178)
!260 = !DIEnumerator(name: "MP_QSTR_map", value: 179)
!261 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180)
!262 = !DIEnumerator(name: "MP_QSTR_module", value: 181)
!263 = !DIEnumerator(name: "MP_QSTR_next", value: 182)
!264 = !DIEnumerator(name: "MP_QSTR_object", value: 183)
!265 = !DIEnumerator(name: "MP_QSTR_oct", value: 184)
!266 = !DIEnumerator(name: "MP_QSTR_open", value: 185)
!267 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186)
!268 = !DIEnumerator(name: "MP_QSTR_ord", value: 187)
!269 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188)
!270 = !DIEnumerator(name: "MP_QSTR_pop", value: 189)
!271 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190)
!272 = !DIEnumerator(name: "MP_QSTR_pow", value: 191)
!273 = !DIEnumerator(name: "MP_QSTR_print", value: 192)
!274 = !DIEnumerator(name: "MP_QSTR_property", value: 193)
!275 = !DIEnumerator(name: "MP_QSTR_range", value: 194)
!276 = !DIEnumerator(name: "MP_QSTR_remove", value: 195)
!277 = !DIEnumerator(name: "MP_QSTR_replace", value: 196)
!278 = !DIEnumerator(name: "MP_QSTR_repr", value: 197)
!279 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198)
!280 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199)
!281 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200)
!282 = !DIEnumerator(name: "MP_QSTR_round", value: 201)
!283 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202)
!284 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203)
!285 = !DIEnumerator(name: "MP_QSTR_send", value: 204)
!286 = !DIEnumerator(name: "MP_QSTR_sep", value: 205)
!287 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206)
!288 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207)
!289 = !DIEnumerator(name: "MP_QSTR_setter", value: 208)
!290 = !DIEnumerator(name: "MP_QSTR_sort", value: 209)
!291 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210)
!292 = !DIEnumerator(name: "MP_QSTR_split", value: 211)
!293 = !DIEnumerator(name: "MP_QSTR_start", value: 212)
!294 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213)
!295 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214)
!296 = !DIEnumerator(name: "MP_QSTR_step", value: 215)
!297 = !DIEnumerator(name: "MP_QSTR_stop", value: 216)
!298 = !DIEnumerator(name: "MP_QSTR_str", value: 217)
!299 = !DIEnumerator(name: "MP_QSTR_strip", value: 218)
!300 = !DIEnumerator(name: "MP_QSTR_sum", value: 219)
!301 = !DIEnumerator(name: "MP_QSTR_super", value: 220)
!302 = !DIEnumerator(name: "MP_QSTR_throw", value: 221)
!303 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222)
!304 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223)
!305 = !DIEnumerator(name: "MP_QSTR_type", value: 224)
!306 = !DIEnumerator(name: "MP_QSTR_update", value: 225)
!307 = !DIEnumerator(name: "MP_QSTR_upper", value: 226)
!308 = !DIEnumerator(name: "MP_QSTR_value", value: 227)
!309 = !DIEnumerator(name: "MP_QSTR_values", value: 228)
!310 = !DIEnumerator(name: "MP_QSTR_zip", value: 229)
!311 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230)
!312 = !{!313, !465, !327, !326, !464, !319, !450, !428, !329}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !315, line: 70, baseType: !316)
!315 = !DIFile(filename: "../../py/bc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !315, line: 63, size: 192, elements: !317)
!317 = !{!318, !324, !328}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !316, file: !315, line: 64, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !322, line: 39, baseType: !323)
!322 = !DIFile(filename: "../../py/misc.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!323 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !316, file: !315, line: 67, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !15, line: 46, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !316, file: !315, line: 69, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !15, line: 59, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !15, line: 56, size: 64, elements: !332)
!332 = !{!333}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !15, line: 57, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !15, line: 52, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !15, line: 474, size: 960, elements: !338)
!338 = !{!339, !340, !344, !345, !371, !395, !400, !406, !412, !418, !423, !437, !442, !467, !470, !471}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !337, file: !15, line: 476, baseType: !330, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !337, file: !15, line: 479, baseType: !341, size: 16, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !342, line: 31, baseType: !343)
!342 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/_types/_uint16_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!343 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !15, line: 482, baseType: !341, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !337, file: !15, line: 485, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !15, line: 441, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350, !326, !370}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !353, line: 53, baseType: !354)
!353 = !DIFile(filename: "../../py/mpprint.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !353, line: 50, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !353, line: 51, baseType: !327, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !354, file: !353, line: 52, baseType: !358, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !353, line: 48, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !327, !362, !365}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !366, line: 31, baseType: !367)
!366 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_size_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !368, line: 92, baseType: !369)
!368 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/i386/_types.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!369 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !15, line: 430, baseType: !14)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !337, file: !15, line: 488, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !15, line: 442, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!326, !334, !365, !376, !378}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !15, line: 374, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !15, line: 365, size: 192, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !380, file: !15, line: 366, baseType: !365, size: 1, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !380, file: !15, line: 367, baseType: !365, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !380, file: !15, line: 368, baseType: !365, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !380, file: !15, line: 369, baseType: !365, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !380, file: !15, line: 371, baseType: !365, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !380, file: !15, line: 372, baseType: !365, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !380, file: !15, line: 373, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !15, line: 353, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !15, line: 350, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !391, file: !15, line: 351, baseType: !326, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !391, file: !15, line: 352, baseType: !326, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !337, file: !15, line: 491, baseType: !396, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !15, line: 443, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!326, !326, !365, !365, !376}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !337, file: !15, line: 495, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !15, line: 444, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!326, !405, !326}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !24, line: 65, baseType: !23)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !337, file: !15, line: 496, baseType: !407, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !15, line: 445, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!326, !411, !326, !326}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !24, line: 145, baseType: !37)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !337, file: !15, line: 509, baseType: !413, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !15, line: 446, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !326, !417, !325}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !79, line: 48, baseType: !365)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !337, file: !15, line: 516, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !15, line: 447, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!326, !326, !326, !326}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !337, file: !15, line: 521, baseType: !424, size: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !15, line: 448, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!326, !326, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !15, line: 435, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !15, line: 432, size: 256, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !430, file: !15, line: 433, baseType: !330, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !430, file: !15, line: 434, baseType: !434, size: 192, offset: 64)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 192, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 3)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !337, file: !15, line: 525, baseType: !438, size: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !15, line: 415, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!326, !326}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !337, file: !15, line: 528, baseType: !443, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !15, line: 470, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !15, line: 468, size: 64, elements: !445)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !444, file: !15, line: 469, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !326, !456, !464}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !451, line: 70, baseType: !452)
!451 = !DIFile(filename: "./mpconfigport.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !453, line: 32, baseType: !454)
!453 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_intptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !368, line: 49, baseType: !455)
!455 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !15, line: 464, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !15, line: 451, size: 192, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !458, file: !15, line: 457, baseType: !327, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !458, file: !15, line: 458, baseType: !365, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !458, file: !15, line: 459, baseType: !463, size: 32, offset: 128)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !451, line: 71, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !466, line: 30, baseType: !369)
!466 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !337, file: !15, line: 531, baseType: !468, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !337, file: !15, line: 537, baseType: !468, size: 64, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !337, file: !15, line: 540, baseType: !472, size: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !15, line: 775, size: 256, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !15, line: 776, baseType: !330, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !473, file: !15, line: 777, baseType: !379, size: 192, offset: 64)
!477 = !{!"Apple LLVM version 10.0.1 (clang-1001.0.46.4)"}
!478 = distinct !DISubprogram(name: "mp_execute_bytecode", scope: !6, file: !6, line: 119, type: !479, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, isOptimized: true, unit: !5, retainedNodes: !513)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !482, !512}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_vm_return_kind_t", file: !9, line: 36, baseType: !8)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !315, line: 90, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !315, line: 72, size: 320, elements: !485)
!485 = !{!486, !504, !505, !506, !507, !508}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !484, file: !315, line: 77, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !489, line: 42, baseType: !490)
!489 = !DIFile(filename: "../../py/objfun.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !489, line: 31, size: 256, elements: !491)
!491 = !{!492, !493, !496, !497, !500}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !490, file: !489, line: 32, baseType: !330, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !490, file: !489, line: 33, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !15, line: 778, baseType: !473)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !490, file: !489, line: 34, baseType: !319, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !490, file: !489, line: 35, baseType: !498, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !490, file: !489, line: 41, baseType: !501, offset: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: -1)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !484, file: !315, line: 78, baseType: !319, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !484, file: !315, line: 79, baseType: !325, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !484, file: !315, line: 81, baseType: !313, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !484, file: !315, line: 82, baseType: !494, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !484, file: !315, line: 87, baseType: !509, offset: 320)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 0)
!512 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !326)
!513 = !{!514, !515, !516, !517, !518, !520, !523, !525, !542, !545, !546, !547, !550, !556, !558, !560, !561, !563, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609, !611, !613, !615, !617, !618, !620, !625, !626, !628, !630, !631, !634, !638, !640, !641, !643, !644, !645, !647, !649, !651, !653, !654, !656, !658, !660, !661, !663, !664, !665, !667, !668, !669, !671, !672, !673, !675, !677, !679, !681, !685, !687, !688, !692, !694, !695, !696, !697, !699, !700, !702, !703, !710, !711, !713, !716, !724, !725, !728, !729, !730, !731, !732, !733, !734, !736, !737}
!514 = !DILocalVariable(name: "code_state", arg: 1, scope: !478, file: !6, line: 119, type: !482)
!515 = !DILocalVariable(name: "inject_exc", arg: 2, scope: !478, file: !6, line: 119, type: !512)
!516 = !DILocalVariable(name: "fastn", scope: !478, file: !6, line: 155, type: !325)
!517 = !DILocalVariable(name: "exc_stack", scope: !478, file: !6, line: 156, type: !313)
!518 = !DILocalVariable(name: "n_state", scope: !519, file: !6, line: 158, type: !365)
!519 = distinct !DILexicalBlock(scope: !478, file: !6, line: 157, column: 5)
!520 = !DILocalVariable(name: "currently_in_except_block", scope: !478, file: !6, line: 164, type: !521)
!521 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !522)
!522 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!523 = !DILocalVariable(name: "exc_sp", scope: !478, file: !6, line: 165, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !313)
!525 = !DILocalVariable(name: "nlr", scope: !526, file: !6, line: 175, type: !529)
!526 = distinct !DILexicalBlock(scope: !527, file: !6, line: 174, column: 14)
!527 = distinct !DILexicalBlock(scope: !528, file: !6, line: 174, column: 5)
!528 = distinct !DILexicalBlock(scope: !478, file: !6, line: 174, column: 5)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !530, line: 72, baseType: !531)
!530 = !DIFile(filename: "../../py/nlr.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !530, line: 73, size: 1344, elements: !532)
!532 = !{!533, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !531, file: !530, line: 75, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !531, file: !530, line: 76, baseType: !327, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !531, file: !530, line: 79, baseType: !537, size: 1184, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !538, line: 37, baseType: !539)
!538 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX10.14.sdk/usr/include/setjmp.h", directory: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet")
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1184, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 37)
!542 = !DILocalVariable(name: "ip", scope: !543, file: !6, line: 179, type: !319)
!543 = distinct !DILexicalBlock(scope: !544, file: !6, line: 177, column: 34)
!544 = distinct !DILexicalBlock(scope: !526, file: !6, line: 177, column: 13)
!545 = !DILocalVariable(name: "sp", scope: !543, file: !6, line: 180, type: !325)
!546 = !DILocalVariable(name: "obj_shared", scope: !543, file: !6, line: 181, type: !326)
!547 = !DILocalVariable(name: "exc", scope: !548, file: !6, line: 190, type: !326)
!548 = distinct !DILexicalBlock(scope: !549, file: !6, line: 189, column: 71)
!549 = distinct !DILexicalBlock(scope: !543, file: !6, line: 189, column: 17)
!550 = !DILocalVariable(name: "num", scope: !551, file: !6, line: 220, type: !450)
!551 = distinct !DILexicalBlock(scope: !552, file: !6, line: 219, column: 52)
!552 = distinct !DILexicalBlock(scope: !553, file: !6, line: 204, column: 32)
!553 = distinct !DILexicalBlock(scope: !554, file: !6, line: 197, column: 22)
!554 = distinct !DILexicalBlock(scope: !555, file: !6, line: 197, column: 13)
!555 = distinct !DILexicalBlock(scope: !543, file: !6, line: 197, column: 13)
!556 = !DILocalVariable(name: "qst", scope: !557, file: !6, line: 233, type: !417)
!557 = distinct !DILexicalBlock(scope: !552, file: !6, line: 232, column: 49)
!558 = !DILocalVariable(name: "unum", scope: !559, file: !6, line: 239, type: !464)
!559 = distinct !DILexicalBlock(scope: !552, file: !6, line: 238, column: 46)
!560 = !DILocalVariable(name: "obj", scope: !559, file: !6, line: 239, type: !326)
!561 = !DILocalVariable(name: "unum", scope: !562, file: !6, line: 249, type: !464)
!562 = distinct !DILexicalBlock(scope: !552, file: !6, line: 248, column: 43)
!563 = !DILocalVariable(name: "obj", scope: !564, file: !6, line: 255, type: !326)
!564 = distinct !DILexicalBlock(scope: !565, file: !6, line: 253, column: 43)
!565 = distinct !DILexicalBlock(scope: !566, file: !6, line: 252, column: 52)
!566 = distinct !DILexicalBlock(scope: !562, file: !6, line: 252, column: 25)
!567 = !DILocalVariable(name: "unum", scope: !568, file: !6, line: 264, type: !464)
!568 = distinct !DILexicalBlock(scope: !552, file: !6, line: 263, column: 42)
!569 = !DILocalVariable(name: "qst", scope: !570, file: !6, line: 272, type: !417)
!570 = distinct !DILexicalBlock(scope: !552, file: !6, line: 270, column: 41)
!571 = !DILocalVariable(name: "qst", scope: !572, file: !6, line: 301, type: !417)
!572 = distinct !DILexicalBlock(scope: !552, file: !6, line: 299, column: 43)
!573 = !DILocalVariable(name: "qst", scope: !574, file: !6, line: 330, type: !417)
!574 = distinct !DILexicalBlock(scope: !552, file: !6, line: 328, column: 41)
!575 = !DILocalVariable(name: "qst", scope: !576, file: !6, line: 367, type: !417)
!576 = distinct !DILexicalBlock(scope: !552, file: !6, line: 365, column: 43)
!577 = !DILocalVariable(name: "qst", scope: !578, file: !6, line: 375, type: !417)
!578 = distinct !DILexicalBlock(scope: !552, file: !6, line: 373, column: 49)
!579 = !DILocalVariable(name: "index", scope: !580, file: !6, line: 388, type: !326)
!580 = distinct !DILexicalBlock(scope: !552, file: !6, line: 386, column: 43)
!581 = !DILocalVariable(name: "unum", scope: !582, file: !6, line: 394, type: !464)
!582 = distinct !DILexicalBlock(scope: !552, file: !6, line: 393, column: 44)
!583 = !DILocalVariable(name: "unum", scope: !584, file: !6, line: 400, type: !464)
