; ModuleID = '/Users/fak/Dropbox/Projects/circuitpython/py/vm.c'
source_filename = "/Users/fak/Dropbox/Projects/circuitpython/py/vm.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }
%struct._mp_obj_bool_t = type opaque
%struct._mp_obj_none_t = type opaque
%struct._mp_obj_type_t = type { %struct._mp_obj_base_t, i16, i16, void (%struct._mp_print_t*, i8*, i32)*, i8* (%struct._mp_obj_type_t*, i64, i8**, %struct._mp_map_t*)*, i8* (i8*, i64, i64, i8**)*, i8* (i32, i8*)*, i8* (i32, i8*, i8*)*, void (i8*, i64, i8**)*, i8* (i8*, i8*, i8*)*, i8* (i8*, %struct._mp_obj_iter_buf_t*)*, i8* (i8*)*, %struct._mp_buffer_p_t, i8*, i8*, %struct._mp_obj_dict_t* }
%struct._mp_obj_base_t = type { %struct._mp_obj_type_t* }
%struct._mp_print_t = type { i8*, void (i8*, i8*, i64)* }
%struct._mp_map_t = type { i64, i64, %struct._mp_map_elem_t* }
%struct._mp_map_elem_t = type { i8*, i8* }
%struct._mp_obj_iter_buf_t = type { %struct._mp_obj_base_t, [3 x i8*] }
%struct._mp_buffer_p_t = type { i64 (i8*, %struct._mp_buffer_info_t*, i64)* }
%struct._mp_buffer_info_t = type { i8*, i64, i32 }

!246 = !DIEnumerator(name: "MP_QSTR_isspace", value: 164, isUnsigned: true)
!247 = !DIEnumerator(name: "MP_QSTR_issubclass", value: 165, isUnsigned: true)
!248 = !DIEnumerator(name: "MP_QSTR_isupper", value: 166, isUnsigned: true)
!249 = !DIEnumerator(name: "MP_QSTR_items", value: 167, isUnsigned: true)
!250 = !DIEnumerator(name: "MP_QSTR_iter", value: 168, isUnsigned: true)
!251 = !DIEnumerator(name: "MP_QSTR_iterator", value: 169, isUnsigned: true)
!252 = !DIEnumerator(name: "MP_QSTR_join", value: 170, isUnsigned: true)
!253 = !DIEnumerator(name: "MP_QSTR_key", value: 171, isUnsigned: true)
!254 = !DIEnumerator(name: "MP_QSTR_keys", value: 172, isUnsigned: true)
!255 = !DIEnumerator(name: "MP_QSTR_len", value: 173, isUnsigned: true)
!256 = !DIEnumerator(name: "MP_QSTR_list", value: 174, isUnsigned: true)
!257 = !DIEnumerator(name: "MP_QSTR_little", value: 175, isUnsigned: true)
!258 = !DIEnumerator(name: "MP_QSTR_locals", value: 176, isUnsigned: true)
!259 = !DIEnumerator(name: "MP_QSTR_lower", value: 177, isUnsigned: true)
!260 = !DIEnumerator(name: "MP_QSTR_lstrip", value: 178, isUnsigned: true)
!261 = !DIEnumerator(name: "MP_QSTR_map", value: 179, isUnsigned: true)
!262 = !DIEnumerator(name: "MP_QSTR_micropython", value: 180, isUnsigned: true)
!263 = !DIEnumerator(name: "MP_QSTR_module", value: 181, isUnsigned: true)
!264 = !DIEnumerator(name: "MP_QSTR_next", value: 182, isUnsigned: true)
!265 = !DIEnumerator(name: "MP_QSTR_object", value: 183, isUnsigned: true)
!266 = !DIEnumerator(name: "MP_QSTR_oct", value: 184, isUnsigned: true)
!267 = !DIEnumerator(name: "MP_QSTR_open", value: 185, isUnsigned: true)
!268 = !DIEnumerator(name: "MP_QSTR_opt_level", value: 186, isUnsigned: true)
!269 = !DIEnumerator(name: "MP_QSTR_ord", value: 187, isUnsigned: true)
!270 = !DIEnumerator(name: "MP_QSTR_pend_throw", value: 188, isUnsigned: true)
!271 = !DIEnumerator(name: "MP_QSTR_pop", value: 189, isUnsigned: true)
!272 = !DIEnumerator(name: "MP_QSTR_popitem", value: 190, isUnsigned: true)
!273 = !DIEnumerator(name: "MP_QSTR_pow", value: 191, isUnsigned: true)
!274 = !DIEnumerator(name: "MP_QSTR_print", value: 192, isUnsigned: true)
!275 = !DIEnumerator(name: "MP_QSTR_property", value: 193, isUnsigned: true)
!276 = !DIEnumerator(name: "MP_QSTR_range", value: 194, isUnsigned: true)
!277 = !DIEnumerator(name: "MP_QSTR_remove", value: 195, isUnsigned: true)
!278 = !DIEnumerator(name: "MP_QSTR_replace", value: 196, isUnsigned: true)
!279 = !DIEnumerator(name: "MP_QSTR_repr", value: 197, isUnsigned: true)
!280 = !DIEnumerator(name: "MP_QSTR_reverse", value: 198, isUnsigned: true)
!281 = !DIEnumerator(name: "MP_QSTR_rfind", value: 199, isUnsigned: true)
!282 = !DIEnumerator(name: "MP_QSTR_rindex", value: 200, isUnsigned: true)
!283 = !DIEnumerator(name: "MP_QSTR_round", value: 201, isUnsigned: true)
!284 = !DIEnumerator(name: "MP_QSTR_rsplit", value: 202, isUnsigned: true)
!285 = !DIEnumerator(name: "MP_QSTR_rstrip", value: 203, isUnsigned: true)
!286 = !DIEnumerator(name: "MP_QSTR_send", value: 204, isUnsigned: true)
!287 = !DIEnumerator(name: "MP_QSTR_sep", value: 205, isUnsigned: true)
!288 = !DIEnumerator(name: "MP_QSTR_setattr", value: 206, isUnsigned: true)
!289 = !DIEnumerator(name: "MP_QSTR_setdefault", value: 207, isUnsigned: true)
!290 = !DIEnumerator(name: "MP_QSTR_setter", value: 208, isUnsigned: true)
!291 = !DIEnumerator(name: "MP_QSTR_sort", value: 209, isUnsigned: true)
!292 = !DIEnumerator(name: "MP_QSTR_sorted", value: 210, isUnsigned: true)
!293 = !DIEnumerator(name: "MP_QSTR_split", value: 211, isUnsigned: true)
!294 = !DIEnumerator(name: "MP_QSTR_start", value: 212, isUnsigned: true)
!295 = !DIEnumerator(name: "MP_QSTR_startswith", value: 213, isUnsigned: true)
!296 = !DIEnumerator(name: "MP_QSTR_staticmethod", value: 214, isUnsigned: true)
!297 = !DIEnumerator(name: "MP_QSTR_step", value: 215, isUnsigned: true)
!298 = !DIEnumerator(name: "MP_QSTR_stop", value: 216, isUnsigned: true)
!299 = !DIEnumerator(name: "MP_QSTR_str", value: 217, isUnsigned: true)
!300 = !DIEnumerator(name: "MP_QSTR_strip", value: 218, isUnsigned: true)
!301 = !DIEnumerator(name: "MP_QSTR_sum", value: 219, isUnsigned: true)
!302 = !DIEnumerator(name: "MP_QSTR_super", value: 220, isUnsigned: true)
!303 = !DIEnumerator(name: "MP_QSTR_throw", value: 221, isUnsigned: true)
!304 = !DIEnumerator(name: "MP_QSTR_to_bytes", value: 222, isUnsigned: true)
!305 = !DIEnumerator(name: "MP_QSTR_tuple", value: 223, isUnsigned: true)
!306 = !DIEnumerator(name: "MP_QSTR_type", value: 224, isUnsigned: true)
!307 = !DIEnumerator(name: "MP_QSTR_update", value: 225, isUnsigned: true)
!308 = !DIEnumerator(name: "MP_QSTR_upper", value: 226, isUnsigned: true)
!309 = !DIEnumerator(name: "MP_QSTR_value", value: 227, isUnsigned: true)
!310 = !DIEnumerator(name: "MP_QSTR_values", value: 228, isUnsigned: true)
!311 = !DIEnumerator(name: "MP_QSTR_zip", value: 229, isUnsigned: true)
!312 = !DIEnumerator(name: "MP_QSTRnumber_of", value: 230, isUnsigned: true)
!313 = !{!314, !466, !328, !327, !464, !465, !320, !451, !429, !330}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_exc_stack_t", file: !316, line: 70, baseType: !317)
!316 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/bc.h", directory: "")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_exc_stack_t", file: !316, line: 63, size: 192, elements: !318)
!318 = !{!319, !325, !329}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !317, file: !316, line: 64, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !323, line: 39, baseType: !324)
!323 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/misc.h", directory: "")
!324 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "val_sp", scope: !317, file: !316, line: 67, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_t", file: !16, line: 46, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev_exc", scope: !317, file: !316, line: 69, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_base_t", file: !16, line: 59, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_base_t", file: !16, line: 56, size: 64, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !16, line: 57, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_type_t", file: !16, line: 52, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_type_t", file: !16, line: 474, size: 960, elements: !339)
!339 = !{!340, !341, !345, !346, !372, !396, !401, !407, !413, !419, !424, !438, !443, !468, !471, !472}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !338, file: !16, line: 476, baseType: !331, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !16, line: 479, baseType: !342, size: 16, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !343, line: 31, baseType: !344)
!343 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uint16_t.h", directory: "")
!344 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !16, line: 482, baseType: !342, size: 16, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "print", scope: !338, file: !16, line: 485, baseType: !347, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_fun_t", file: !16, line: 441, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351, !327, !371}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_t", file: !354, line: 53, baseType: !355)
!354 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/mpprint.h", directory: "")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_print_t", file: !354, line: 50, size: 128, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !354, line: 51, baseType: !328, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "print_strn", scope: !355, file: !354, line: 52, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_strn_t", file: !354, line: 48, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !328, !363, !366}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !367, line: 31, baseType: !368)
!367 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_size_t.h", directory: "")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !369, line: 92, baseType: !370)
!369 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!370 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_print_kind_t", file: !16, line: 430, baseType: !15)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "make_new", scope: !338, file: !16, line: 488, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_make_new_fun_t", file: !16, line: 442, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!327, !335, !366, !377, !379}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_t", file: !16, line: 374, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_t", file: !16, line: 365, size: 192, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "all_keys_are_qstrs", scope: !381, file: !16, line: 366, baseType: !366, size: 1, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "is_fixed", scope: !381, file: !16, line: 367, baseType: !366, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_ordered", scope: !381, file: !16, line: 368, baseType: !366, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scanning", scope: !381, file: !16, line: 369, baseType: !366, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !381, file: !16, line: 371, baseType: !366, size: 60, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !381, file: !16, line: 372, baseType: !366, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !381, file: !16, line: 373, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_map_elem_t", file: !16, line: 353, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_map_elem_t", file: !16, line: 350, size: 128, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !392, file: !16, line: 351, baseType: !327, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !392, file: !16, line: 352, baseType: !327, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !338, file: !16, line: 491, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_call_fun_t", file: !16, line: 443, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!327, !327, !366, !366, !377}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "unary_op", scope: !338, file: !16, line: 495, baseType: !402, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_fun_t", file: !16, line: 444, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!327, !406, !327}
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_unary_op_t", file: !25, line: 65, baseType: !24)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "binary_op", scope: !338, file: !16, line: 496, baseType: !408, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_fun_t", file: !16, line: 445, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!327, !412, !327, !327}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_binary_op_t", file: !25, line: 145, baseType: !38)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !338, file: !16, line: 509, baseType: !414, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_attr_fun_t", file: !16, line: 446, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !327, !418, !326}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "qstr", file: !80, line: 48, baseType: !366)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "subscr", scope: !338, file: !16, line: 516, baseType: !420, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_subscr_fun_t", file: !16, line: 447, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!327, !327, !327, !327}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "getiter", scope: !338, file: !16, line: 521, baseType: !425, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_getiter_fun_t", file: !16, line: 448, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!327, !327, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_iter_buf_t", file: !16, line: 435, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_iter_buf_t", file: !16, line: 432, size: 256, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !431, file: !16, line: 433, baseType: !331, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !431, file: !16, line: 434, baseType: !435, size: 192, offset: 64)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 192, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "iternext", scope: !338, file: !16, line: 525, baseType: !439, size: 64, offset: 640)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_fun_1_t", file: !16, line: 415, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!327, !327}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_p", scope: !338, file: !16, line: 528, baseType: !444, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_p_t", file: !16, line: 470, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_p_t", file: !16, line: 468, size: 64, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer", scope: !445, file: !16, line: 469, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !327, !457, !465}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_int_t", file: !452, line: 69, baseType: !453)
!452 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/ports/dotnet/mpconfigport.h", directory: "")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !454, line: 32, baseType: !455)
!454 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !369, line: 49, baseType: !456)
!456 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_buffer_info_t", file: !16, line: 464, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_buffer_info_t", file: !16, line: 451, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !459, file: !16, line: 457, baseType: !328, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !459, file: !16, line: 458, baseType: !366, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !459, file: !16, line: 459, baseType: !464, size: 32, offset: 128)
!464 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_uint_t", file: !452, line: 70, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !467, line: 30, baseType: !370)
!467 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !338, file: !16, line: 531, baseType: !469, size: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !338, file: !16, line: 537, baseType: !469, size: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "locals_dict", scope: !338, file: !16, line: 540, baseType: !473, size: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_dict_t", file: !16, line: 775, size: 256, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !474, file: !16, line: 776, baseType: !331, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !474, file: !16, line: 777, baseType: !380, size: 192, offset: 64)
!478 = !{!"Apple clang version 11.0.0 (clang-1100.0.33.5)"}
!479 = distinct !DISubprogram(name: "exec_small_int", scope: !480, file: !480, line: 114, type: !481, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !484)
!480 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/vm.c", directory: "")
!481 = !DISubroutineType(types: !482)
!482 = !{!451, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!484 = !{!485, !486, !487}
!485 = !DILocalVariable(name: "pip", arg: 1, scope: !479, file: !480, line: 114, type: !483)
!486 = !DILocalVariable(name: "ip", scope: !479, file: !480, line: 116, type: !320)
!487 = !DILocalVariable(name: "num", scope: !479, file: !480, line: 118, type: !451)
!488 = !DILocation(line: 114, column: 38, scope: !479)
!489 = !DILocation(line: 116, column: 22, scope: !479)
!490 = !{!491, !491, i64 0}
!491 = !{!"any pointer", !492, i64 0}
!492 = !{!"omnipotent char", !493, i64 0}
!493 = !{!"Simple C/C++ TBAA"}
!494 = !DILocation(line: 116, column: 17, scope: !479)
!495 = !DILocation(line: 118, column: 14, scope: !479)
!496 = !DILocation(line: 119, column: 10, scope: !497)
!497 = distinct !DILexicalBlock(scope: !479, file: !480, line: 119, column: 9)
!498 = !{!492, !492, i64 0}
!499 = !DILocation(line: 119, column: 9, scope: !479)
!500 = !DILocation(line: 126, column: 20, scope: !501)
!501 = distinct !DILexicalBlock(scope: !479, file: !480, line: 124, column: 8)
!502 = !DILocation(line: 126, column: 33, scope: !501)
!503 = !DILocation(line: 126, column: 28, scope: !501)
!504 = !DILocation(line: 126, column: 26, scope: !501)
!505 = !DILocation(line: 128, column: 18, scope: !479)
!506 = !DILocation(line: 128, column: 29, scope: !479)
!507 = !DILocation(line: 128, column: 5, scope: !501)
!508 = distinct !{!508, !509, !510}
!509 = !DILocation(line: 124, column: 5, scope: !479)
!510 = !DILocation(line: 128, column: 33, scope: !479)
!511 = !DILocation(line: 126, column: 29, scope: !501)
!512 = !DILocation(line: 130, column: 10, scope: !479)
!513 = !DILocation(line: 131, column: 5, scope: !479)
!514 = distinct !DISubprogram(name: "mp_execute_bytecode", scope: !480, file: !480, line: 140, type: !515, scopeLine: 140, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5, retainedNodes: !549)
!515 = !DISubroutineType(types: !516)
!516 = !{!517, !518, !548}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_vm_return_kind_t", file: !9, line: 36, baseType: !8)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_code_state_t", file: !316, line: 90, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_code_state_t", file: !316, line: 72, size: 320, elements: !521)
!521 = !{!522, !540, !541, !542, !543, !544}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fun_bc", scope: !520, file: !316, line: 77, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_fun_bc_t", file: !525, line: 42, baseType: !526)
!525 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/objfun.h", directory: "")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mp_obj_fun_bc_t", file: !525, line: 31, size: 256, elements: !527)
!527 = !{!528, !529, !532, !533, !536}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !526, file: !525, line: 32, baseType: !331, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "globals", scope: !526, file: !525, line: 33, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_obj_dict_t", file: !16, line: 778, baseType: !474)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bytecode", scope: !526, file: !525, line: 34, baseType: !320, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "const_table", scope: !526, file: !525, line: 35, baseType: !534, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "extra_args", scope: !526, file: !525, line: 41, baseType: !537, offset: 256)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: -1)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !520, file: !316, line: 78, baseType: !320, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !520, file: !316, line: 79, baseType: !326, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "exc_sp", scope: !520, file: !316, line: 81, baseType: !314, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "old_globals", scope: !520, file: !316, line: 82, baseType: !530, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !520, file: !316, line: 87, baseType: !545, offset: 320)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 0)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!549 = !{!550, !551, !552, !553, !554, !556, !559, !561, !578, !581, !582, !583, !586, !592, !594, !596, !597, !599, !603, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !654, !656, !661, !662, !664, !666, !667, !670, !674, !676, !677, !679, !680, !681, !683, !685, !687, !689, !690, !692, !694, !696, !697, !699, !700, !701, !703, !704, !705, !707, !708, !709, !711, !713, !715, !717, !721, !723, !724, !728, !730, !731, !732, !733, !735, !736, !738, !739, !746, !747, !749, !752, !760, !761, !764, !765, !766, !767, !768, !769, !770, !772, !773}
!550 = !DILocalVariable(name: "code_state", arg: 1, scope: !514, file: !480, line: 140, type: !518)
!551 = !DILocalVariable(name: "inject_exc", arg: 2, scope: !514, file: !480, line: 140, type: !548)
!552 = !DILocalVariable(name: "fastn", scope: !514, file: !480, line: 176, type: !326)
!553 = !DILocalVariable(name: "exc_stack", scope: !514, file: !480, line: 177, type: !314)
!554 = !DILocalVariable(name: "n_state", scope: !555, file: !480, line: 179, type: !366)
!555 = distinct !DILexicalBlock(scope: !514, file: !480, line: 178, column: 5)
!556 = !DILocalVariable(name: "currently_in_except_block", scope: !514, file: !480, line: 189, type: !557)
!557 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !558)
!558 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!559 = !DILocalVariable(name: "exc_sp", scope: !514, file: !480, line: 191, type: !560)
!560 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !314)
!561 = !DILocalVariable(name: "nlr", scope: !562, file: !480, line: 203, type: !565)
!562 = distinct !DILexicalBlock(scope: !563, file: !480, line: 201, column: 14)
!563 = distinct !DILexicalBlock(scope: !564, file: !480, line: 201, column: 5)
!564 = distinct !DILexicalBlock(scope: !514, file: !480, line: 201, column: 5)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlr_buf_t", file: !566, line: 72, baseType: !567)
!566 = !DIFile(filename: "/Users/fak/Dropbox/Projects/circuitpython/py/nlr.h", directory: "")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_nlr_buf_t", file: !566, line: 73, size: 1344, elements: !568)
!568 = !{!569, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !567, file: !566, line: 75, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ret_val", scope: !567, file: !566, line: 76, baseType: !328, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !567, file: !566, line: 79, baseType: !573, size: 1184, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !574, line: 37, baseType: !575)
!574 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/setjmp.h", directory: "")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 1184, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 37)
!578 = !DILocalVariable(name: "ip", scope: !579, file: !480, line: 208, type: !320)
!579 = distinct !DILexicalBlock(scope: !580, file: !480, line: 205, column: 34)
!580 = distinct !DILexicalBlock(scope: !562, file: !480, line: 205, column: 13)
!581 = !DILocalVariable(name: "sp", scope: !579, file: !480, line: 209, type: !326)
!582 = !DILocalVariable(name: "obj_shared", scope: !579, file: !480, line: 210, type: !327)
!583 = !DILocalVariable(name: "exc", scope: !584, file: !480, line: 219, type: !327)
!584 = distinct !DILexicalBlock(scope: !585, file: !480, line: 218, column: 71)
!585 = distinct !DILexicalBlock(scope: !579, file: !480, line: 218, column: 17)
!586 = !DILocalVariable(name: "num", scope: !587, file: !480, line: 251, type: !451)
!587 = distinct !DILexicalBlock(scope: !588, file: !480, line: 250, column: 52)
!588 = distinct !DILexicalBlock(scope: !589, file: !480, line: 235, column: 32)
!589 = distinct !DILexicalBlock(scope: !590, file: !480, line: 226, column: 22)
!590 = distinct !DILexicalBlock(scope: !591, file: !480, line: 226, column: 13)
!591 = distinct !DILexicalBlock(scope: !579, file: !480, line: 226, column: 13)
!592 = !DILocalVariable(name: "qst", scope: !593, file: !480, line: 257, type: !418)
!593 = distinct !DILexicalBlock(scope: !588, file: !480, line: 256, column: 49)
!594 = !DILocalVariable(name: "unum", scope: !595, file: !480, line: 263, type: !465)
!595 = distinct !DILexicalBlock(scope: !588, file: !480, line: 262, column: 46)
!596 = !DILocalVariable(name: "obj", scope: !595, file: !480, line: 263, type: !327)
!597 = !DILocalVariable(name: "unum", scope: !598, file: !480, line: 273, type: !465)
!598 = distinct !DILexicalBlock(scope: !588, file: !480, line: 272, column: 43)
!599 = !DILocalVariable(name: "obj", scope: !600, file: !480, line: 279, type: !327)
!600 = distinct !DILexicalBlock(scope: !601, file: !480, line: 277, column: 43)
!601 = distinct !DILexicalBlock(scope: !602, file: !480, line: 276, column: 52)
!602 = distinct !DILexicalBlock(scope: !598, file: !480, line: 276, column: 25)
!603 = !DILocalVariable(name: "unum", scope: !604, file: !480, line: 288, type: !465)
!604 = distinct !DILexicalBlock(scope: !588, file: !480, line: 287, column: 42)
!605 = !DILocalVariable(name: "qst", scope: !606, file: !480, line: 296, type: !418)
!606 = distinct !DILexicalBlock(scope: !588, file: !480, line: 294, column: 41)
!607 = !DILocalVariable(name: "qst", scope: !608, file: !480, line: 325, type: !418)
!608 = distinct !DILexicalBlock(scope: !588, file: !480, line: 323, column: 43)
!609 = !DILocalVariable(name: "qst", scope: !610, file: !480, line: 354, type: !418)
!610 = distinct !DILexicalBlock(scope: !588, file: !480, line: 352, column: 41)
!611 = !DILocalVariable(name: "qst", scope: !612, file: !480, line: 391, type: !418)
!612 = distinct !DILexicalBlock(scope: !588, file: !480, line: 389, column: 43)
!613 = !DILocalVariable(name: "qst", scope: !614, file: !480, line: 399, type: !418)
!614 = distinct !DILexicalBlock(scope: !588, file: !480, line: 397, column: 49)
!615 = !DILocalVariable(name: "index", scope: !616, file: !480, line: 412, type: !327)
!616 = distinct !DILexicalBlock(scope: !588, file: !480, line: 410, column: 43)
!617 = !DILocalVariable(name: "unum", scope: !618, file: !480, line: 418, type: !465)
!618 = distinct !DILexicalBlock(scope: !588, file: !480, line: 417, column: 44)
!619 = !DILocalVariable(name: "unum", scope: !620, file: !480, line: 424, type: !465)
